{"validated_at": "2025-09-01T14:48:13.154027", "input": {"call_type": "earnings", "summary_length": "short", "answer_format": "bullet", "filename": "Alibaba Group Holding Ltd Earnings Call 2025829 DN000000003074531761.pdf.pdf"}, "transcripts": {"presentation": ", Director and Chief Executive Officer\n, Head of Investor Relations\n, Chief Financial Officer\nUnidentified Speaker\n, Analyst, J.P. Morgan\n, Analyst, Citigroup\n, analyst, Morgan Stanley\n, Analyst, Bank of America\n, Analyst, UBS\n, Analyst, Jefferies\n, Analyst, CITIC\nQ1 2026 Earnings Call\nCompany Participants\nEddie Wu\nLydia Liu\nToby Xu\nOther Participants\nAlex Yao\nAlicia Yap\nGary Yu\nJoyce Ju\nKenneth Fong\nThomas Chong\nYuan Liao\nPresentation\nOperator\nGood day, ladies and gentlemen. Thank you for standing by. Welcome to Alibaba Group's June\nQuarter 2025 Results Conference Call. At this time, all participants are on listen-only mode. After\nmanagement's prepared remarks, there will be a Q&A session. I would now like to turn the call\nover to Lydia Liu, Head of Investor Relations of Alibaba Group. Please go ahead.\nLydia Liu {BIO 24394330 <GO>}\nGood day, everyone. Welcome to Alibaba Group's June Quarter 2025 Earnings Conference Call.\nWith us today are Joe Tsai, Chairman; Eddie Wu, Chief Executive Officer; Toby Xu, Chief Financial\nOfficer; Jiang Fan, Chief Executive Officer of Alibaba E Commerce Business Group. This call is\nalso being webcast from the IR section of our corporate website. A replay of the call will be\navailable on our website later today.\nNow I will quickly cover the safe harbor. Today's discussions may contain forward-looking\nstatements, particularly statements about our business and financial results that are subject to\nrisks and uncertainties, which could cause actual results to differ materially from those contained\nin the forward-looking statements. Please refer to the safe harbor statements that appear in our\npress release and investor presentation provided today. Please note that certain financial\nmeasures that we use on this call are expressed on a non-GAAP basis. Our GAAP results and\nreconciliations of GAAP to non-GAAP measures can be found in our earnings press release.\nAnd now I will turn the call over to Eddie.\nEddie Wu {BIO 18952978 <GO>}\n(Foreign Language) Hello everybody, and welcome to this quarter's earnings call. This quarter, we\ndelivered solid growth. Excluding revenue from Sun Art and Intime, our total revenue on a like-for-\nlike basis grew 10% year-over-year. Revenue growth of our core businesses remains strong.\nCustomer management revenue from our China E-commerce business rose 10% year-over-year.\nCloud Intelligence Group revenue growth accelerated to 26% year-over-year. With AI-related\nFINAL TRANSCRIPT\n2025-08-29\nAlibaba Group Holding Ltd (BABA US Equity)\n© COPYRIGHT 2024, BLOOMBERG LP. All rights reserved. Any reproduction, redistribution or retransm ission is expressly prohibited.\nPrinted on 08-29-2025 Page 1 of 14\nproduct revenue maintaining triple-digit growth for the eighth consecutive quarter, revenue from\nAIDC grew by 19% year-over-year. And AI + Cloud, the accelerated development of AI\napplications and increasing AI product adoption by customers drove a 26% year-over-year\nrevenue increase from external customers.\nDuring the quarter, AI-related revenue accounted for over 20% of revenue from external\ncustomers. As AI demand continued to grow rapidly, we're also seeing AI applications driving\ngreat growth momentum of traditional products, including compute and storage. SAP and Alibaba\nentered a strategic partnership focused on cloud and AI. As SAP's global cloud computing\npartner, Alibaba Cloud will support SAP customers to run and manage their core software\nsystems on Alibaba's platform. Leveraging our Q1 models, SAP will also provide AI transformation\nservices for its enterprise customers. This partnership signifies the recognition of our cloud\ninfrastructure and AI capabilities by the global leading enterprises in the SAP ecosystem.\nWe've continued to advance the capabilities of our AI foundation models. Since July, Alibaba has\nreleased upgraded Qwen3, including a non-thinking model, reasoning model, and AI coding\nmodel, which are recognized as global top performers in their respective categories. Notably, our\nQwen3 coder model has rapidly increased Qwen's user adoption in overseas markets. We also\nopen-sourced several models, such as the video generation model Wan2.2 and the text-to-image\nmodel Qwen-Image. By continuously upgrading our open-source models, we're empowering our\ncustomers to develop their own AI applications.\nMeanwhile, Alibaba's own AI native applications continue to advance. Amap has undertaken a\ncomprehensive AI transformation with the launch of Amap 2025, the world's first AI native\nlocation based application. The upgrade brings spatial intelligence into dynamic real-world\nscenarios and Amap is well-positioned to become a new gateway for future lifestyle services.\nDingTalk has also completed its latest AI upgrade of creating the world's first agent-driven\nworkfeeds to explore next-generation workplace application paradigms.\nOn our Taobao platform, we see immense AI-powered opportunities emerging, such as AI\nsearch and AI advertising platform. In consumption, we undertook a strategic combination of\nTaobao and Tmall Group, Ele.me and Fliggy into Alibaba China E-commerce Group. This\norganizational change creates a comprehensive consumption platform and upgrades our\nconsumer experience. We have consolidated supply chains, user bases, and membership\nbenefits across our businesses and launched a tiered loyalty program that connects Ele.me,\nFliggy, and Amap. The newly integrated benefits enhance our members' experience across a full\nspectrum of consumption scenarios.\nSince May, our investments in Quick Commerce have rapidly surpassed key milestones and\ncreated synergies. In August, monthly active consumers on our Quick Commerce business are\napproaching 300 million, contributing to a 25% increase in monthly active consumers on the\nTaobao app. Daily order volume of our China E-commerce Group continued to achieve new\nrecords. Looking ahead, Alibaba Group has two historic opportunities to build a technology\nplatform centered on AI + Cloud and to create a comprehensive shopping and daily life services\nconsumption platform. We will invest at scale to capture the opportunities. This also marks a new\nentrepreneurial chapter for the company after 26 years.\nIn line with this, in February, we announced an investment of RMB380 billion over the next three\nyears to build our cloud and AI infrastructure. In July, we announced plans to invest RMB50 billion\nin consumption. The transformative impact of AI on all industries, combined with a deep\nintegration of AI and cloud, will present the most significant opportunity in the technology sector\nover the next decade. For Alibaba, we have the world's fourth largest and Asia's leading cloud\nFINAL TRANSCRIPT\n2025-08-29\nAlibaba Group Holding Ltd (BABA US Equity)\n© COPYRIGHT 2024, BLOOMBERG LP. All rights reserved. Any reproduction, redistribution or retransm ission is expressly prohibited.\nPrinted on 08-29-2025 Page 2 of 14\ninfrastructure along with full-stack technology capabilities spanning AI computing power, AI cloud\nplatforms, AI models and open-source ecosystem and AI applications. This quarter, our CapEx\ninvestment in AI and cloud infrastructure reached RMB38.6 billion. Over the past four quarters, we\nhave cumulatively invested over RMB100 billion in AI infrastructure and AI product R&D. Our\ninvestments in AI have begun to yield tangible results. This is evidenced by Alibaba's -- Alibaba\nCloud's return to rapid growth driven by AI demand and our AI-enhanced experiences across\nconsumer and enterprise-facing scenarios. So we're seeing an increasingly clear path for AI to\ndrive Alibaba's robust growth.\nWe're also well-positioned in China, the world's largest e-commerce market and the most\npromising service consumption market. China has a well-developed e-commerce infrastructure,\nhigh population density, and strong demand for service consumption, providing a solid foundation\nfor the integration of our Quick Commerce business and the Taobao app. We believe this\nconvergence will fulfill consumer needs for a one-stop consumption experience and meet\nmerchants' desire to serve consumers across multiple scenarios. It will enhance commerce\nefficiency and pave the way for an all-in-one AI assistant for consumption.\nAlibaba's strategic positioning in Quick Commerce has ambitions beyond competing in a single\ncategory. We aim to meet the one-stop consumption needs of our 1 billion consumers and shape\nbusiness models of a comprehensive consumption platform in the AI era. In consumption, our\nlong-term goal is to create a comprehensive consumption platform catering to our 1 billion\nconsumers' full spectrum of shopping and daily life needs. We aim to offer the best experience\nto the largest consumer base with the highest purchase frequency, ultimately leading in an\nRMB30 trillion addressable market. Over the next three years, Alibaba will embark on a new\njourney with an entrepreneurial mindset to drive robust business growth through sustained\ninvestments centered on the strategic areas of consumption and AI + Cloud. We're confident that\nthese investments in the core business will sharpen our competitive edge and fuel long-term\ngrowth. Thank you.\nToby Xu {BIO 23337401 <GO>}\nThank you, Eddie. As Eddie said, we are embarking on a new chapter of entrepreneurship by\ninvesting in two strategic pillars of consumption in the AI + Cloud. These represent the two\nbiggest long-term opportunities we are systematically pursuing. To reflect this sharpened focus,\nwe have also adjusted our financial reporting accordingly. Starting from this quarter, we undertook\na strategic combination of Taobao and Tmall Group, Ele.me and Fliggy into Alibaba China E-\ncommerce Group, transforming our value proposition into a comprehensive consumption\nplatform. This is not simply an organizational change, it's a major strategic investment aimed at\nredefining the consumer experience and unlock long-term value across our ecosystem.\nThis quarter marked meaningful progress on this front as we deepened investment in Quick\nCommerce, an increasingly essential use case for capturing new demand and shaping future\nconsumer experience. Our Quick Commerce business achieved key milestones while contributing\nto the 25% year-over-year growth in the Taobao app monthly active consumers in the first three\nweeks of August. In tandem, we are building the AI + Cloud infrastructure to support the next\nwave of technological transformation, positioning Alibaba as a key enabler of enterprise AI\nadoption across industries. Our cloud business delivered accelerated growth as segment\nrevenue and revenue from external customers both grew 26% driven by a surge in AI demand\nand increased customer adoption of public cloud services to support AI workloads. At the same\ntime, we remain focused on improving operating efficiency and profitability. In the quarter, AIDC\ndelivered solid progress approaching breakeven while sustaining strong growth momentum.fi\nFINAL TRANSCRIPT\n2025-08-29\nAlibaba Group Holding Ltd (BABA US Equity)\n© COPYRIGHT 2024, BLOOMBERG LP. All rights reserved. Any reproduction, redistribution or retransm ission is expressly prohibited.\nPrinted on 08-29-2025 Page 3 of 14\nNow let's look at the financial results on a consolidated basis. Total revenue was RMB247.7 billion.\nExcluding revenue from Sun Art and Intime, revenue on a like-for-like basis would have grown by\n10% year-over-year. The adjusted EBITA decreased 14% primarily due to our strategic focus on\nscaling Quick Commerce to capture new consumption patterns and drive future monetization\nopportunities, partly offset by margin improvements across several businesses, including AIDC\nand other units that made continued progress in operating efficiency. Our GAAP net income\nincreased 76% primarily due to the mark-to-market changes from our equity investments and the\ngain arising from the disposal of local consumer service business of Trendyol.\nOperating cash flow was RMB20.7 billion. Free cash flow was an outflow of RMB18.8 billion. This\nwas mainly attributed to our accelerated pace on expanding AI + Cloud infrastructure as CapEx\nramped up to approximately RMB39 billion and investment in Taobao Instant Commerce. Backed\nby nearly $50 billion in net cash, a healthy and low-leveraged balance sheet, and our strong\naccess to capital markets, we have ample flexibility to support long-term strategic investments\nwhile maintaining financial resilience. This quarter, we bought back approximately 7 million ADSs\nfor a total of $815 million under our share repurchase program. We remain committed to\nshareholders' return through a mix of share buybacks, dividends, and investment for growth, and\nwe will continue to adjust the pace and form of returns based on market conditions and strategic\npriorities.\nNow let's look at the segment results, starting with Alibaba China E-commerce Group. Revenue\nfrom Alibaba China E-commerce Group was RMB140.1 billion, an increase of 10%. Customer\nmanagement revenue of our E-commerce business increased by 10% primarily driven by the\nimprovement of take rate. We had a successful June 18 Shopping Festival, which delivered strong\nconsumer growth on the Taobao app as we implemented the user-friendly promotion\nmechanisms and increased the support for merchants that provide high-quality products and the\ncustomer services. The number of 88VIP members, our high spending consumers group,\ncontinue to increase by double digits year-over-year, surpassing 53 million. Revenue from our\nQuick Commerce business increased 12% mainly due to order growth as a result of rollout of\nTaobao Instant Commerce at the end of April.\nSince its launch, we have seen encouraging business progress reflecting strong user adoption\nand growing order momentum. In the meantime, we have expanded our product offerings and\nfront warehouse coverage for non-food categories as part of our efforts to improve user\nexperience and enhance operating efficiency. We executed our plan to generate synergies\nbetween Quick Commerce and the rest of Alibaba's ecosystem by leveraging supply chains,\nusers, and membership benefits across our businesses. In August, Taobao app launched a tiered\nloyalty program that connects Alibaba Group's China E-commerce, Quick Commerce and Taobao\nplatforms.\nThe adjusted EBITA from Alibaba China E-commerce Group decreased by 21%. Excluding the\ninvestments in our Quick Commerce business, our Alibaba China E-commerce Group EBITA has\ngrown year-over-year. Revenue from AIDC grew 19% primarily driven by strong performance in\ncross-border businesses. AIDC's adjusted EBITA loss narrowed significantly, approaching\nbreakeven. As we continue to improve our operating efficiency, the UE of Choice and Trendyol's\ninternational business improved significantly on a sequential basis. Looking ahead, we are\ncommitted to enhancing operating and investment efficiency. As a result, our profitability will\ncontinue to improve.\nCloud segment revenue grew by 26% primarily driven by public cloud revenue growth. AI revenue\ncontinued its triple-digit growth. As AI demand continues to grow rapidly, we are also seeing\nincreasing demand of compute, storage, and other public cloud services to support AI adoption.\nFINAL TRANSCRIPT\n2025-08-29\nAlibaba Group Holding Ltd (BABA US Equity)\n© COPYRIGHT 2024, BLOOMBERG LP. All rights reserved. Any reproduction, redistribution or retransm ission is expressly prohibited.\nPrinted on 08-29-2025 Page 4 of 14\nThe adjusted EBITA margin remained relatively stable year-over-year at 8.8%. We will continue to\ninvest in customer growth and the technological innovation, including AI products and services to\ninclude -- to increase cloud adoption for AI and maintain our market leadership.\nAs previously mentioned, we have updated our segment reporting to better reflect our focus.\nWe simplified the financial reporting structure by reclassifying Cainiao, Amap, and Hujing DME into\nAll others. All other segment revenue decreased by 28% primarily due to the disposal of Sun Art\nand Intime. All others adjusted EBITA was a loss of RMB1.4 billion, primarily due to the increased\ninvestment in technology businesses, partly offset by the improved results of businesses,\nincluding Freshippo. The All other segment comprises a set of innovative initiatives, including\nseveral strategic AI-driven technology infrastructure and businesses. While we continue to drive\nefficiency improvements across business lines, we are also investing in AI opportunities to\nmaintain our competitive edge and to drive future growth.\nIn closing, this quarter marked meaningful progress in our strategic investment on two pillars that\nwill power Alibaba's next phase of growth, our comprehensive consumption platform and AI +\nCloud infrastructure. In Commerce, the integration of multiple businesses under Alibaba China E-\ncommerce Group is driving stronger synergy across supply chains, user networks and\nmembership programs, enabling us to better serve evolving consumer needs and capture long-\nterm growth potential. In Cloud, revenue growth accelerated on the back of robust AI-driven\ndemand. As we expand infrastructure capacity, we are helping more customers deploy and scale\ntheir AI workloads. We are investing with clarity and conviction on the two historical opportunities\nahead, AI and domestic consumption. Our commitment of RMB380 billion technology investment\nreflects our long-term ambition to build infrastructure essential for AI proliferation, while our\nfocused expansion in Quick Commerce is designed to unlock new demand and long-term\nconsumption potential in China. With strong balance sheet, operating cash flow, and business\nmomentum, we are well-positioned to support these investments, drive sustainable growth, and\nstrengthen core capabilities that would define Alibaba's future.\nThank you. That's the end of our prepared remarks. We can open up for Q&A.\nLydia Liu {BIO 24394330 <GO>}\nHi, everyone. For today's call, you are welcome to ask questions in Chinese or English. A third-\nparty translator will provide consecutive interpretation for the Q&A session. Please note that the\ntranslation is for convenience purpose only. In the case of any discrepancy, our management\nstatement in the original language will prevail. If you are unable to hear the Chinese translation,\nbilingual transcripts of this call will be available on our website within one week after the end of\nthe meeting.\n(Foreign Language) Operator, please start the Q&A session. Thank you.", "q_a": "Questions And Answers\nOperator\nThank you. (Operator Instructions) Your first question comes from Alicia Yap at Citigroup. Please\ngo ahead.\nQ - Alicia Yap {BIO 15274658 <GO>}\nHi. Thank you. Good evening, management. Thanks for taking my questions. Congrats on your\nsolid Cloud revenue growth. I have a question related to your recent step-up investment in the\nQuick Commerce and also the food delivery business. So, can management share with us what is\nFINAL TRANSCRIPT\n2025-08-29\nAlibaba Group Holding Ltd (BABA US Equity)\n© COPYRIGHT 2024, BLOOMBERG LP. All rights reserved. Any reproduction, redistribution or retransm ission is expressly prohibited.\nPrinted on 08-29-2025 Page 5 of 14\nyour vision for the Quick Commerce growth opportunity in China and what is your investment plan\nfor the Quick Commerce? How long will the heavy investment last, and how will the investment\nbring the long-term value for overall Taobao and your China E-commerce platform?\nCan management share a bit of the latest progress of the Sangao, which is the Quick Commerce\nbusiness? What are the synergies you have realized so far, and how should we expect the\ninvestment to impact our GMV and also the CMR growth in the coming quarters? Thank you.\n(Foreign Language).\nA - Unidentified Speaker\n(Foreign Language) Thanks for your question. Let me begin by reviewing some of the progress\nwe've made so far in our Instant Commerce business and then share our expectations for Instant\nCommerce going forward. Since we launched Taobao Instant Commerce four months ago, we\nbelieve that we've been highly successful in engaging users and merchants, building logistics\ncapabilities, and marketing. From July onwards, in particular, the growth of order volume, user\nscale, merchant supplies, and delivery capacity have all exceeded expectations. In fact, if you just\nlook at the food delivery to home category, we are now already the market leader in terms of\norders.\nLet me share some figures. First, our peak daily order volume reached 120 million, and weekly\naverage daily orders reached 80 million in August. Second, user scale, Quick Commerce Monthly\nActive Consumers, MAC, reached 300 million in August, representing 200% growth compared to\nbefore April. Third, merchant supply, the rapid growth in business scale has also attracted new\nmerchants to join Taobao Instant Commerce. High-quality merchant supply, in particular, has\nreached industry-leading levels. Fourth, fulfillment capacity, daily active riders have exceeded 2\nmillion. That is a 3 times increase from April, and that also means that we've created over 1 million\nnew jobs. As I stated last quarter, the first stage goals for our Quick Commerce business were to\nscale up user growth and build consumer mindshare. With these developments over the past few\nmonths, we have already achieved our first stage goals beyond our own expectations.\n(Foreign Language) Next, let me talk about the synergies between Quick Commerce and our E-\ncommerce business. First, Quick Commerce is a significant driver of overall user scale and\nengagement. In August, Quick Commerce drove 20% growth in the Taobao app's DAUs. The\nhigh-frequency pattern of Quick Commerce has also contributed to a significant increase in\naverage purchase days per user. With the increase in user engagement, we are seeing a clear\ntrend of Quick Commerce driving incremental income for our E-commerce business. Specifically,\nfirst, the growth in traffic drives advertising and CMR growth. Second, as a result of heightened\nuser engagement, incremental new user acquisition, and customer re-engagement, we can\nreduce sales and marketing expenses. We expect this trend to continue and to expand in our\nongoing operations, and are confident that it will drive significant incremental income on the E-\ncommerce side.\n(Foreign Language) Next, let me share my views on the operating efficiency and unit economics,\nUE, of Quick Commerce, because I know these are aspects to which you pay special attention.\nFirst, when talking about operating efficiency, you cannot disregard scale. In the past, our scale\nwas just one-third of our peers, and in many cities and provinces, our market share was even\nlower than 20%. With such a huge gap in market share, it's meaningless to talk about efficiency.\nNow, however, our Quick Commerce business is leading in scale, and we can quickly improve our\noperating efficiency.\nFINAL TRANSCRIPT\n2025-08-29\nAlibaba Group Holding Ltd (BABA US Equity)\n© COPYRIGHT 2024, BLOOMBERG LP. All rights reserved. Any reproduction, redistribution or retransm ission is expressly prohibited.\nPrinted on 08-29-2025 Page 6 of 14\nOur peers have achieved excellent performance in the food delivery industry, especially in terms\nof efficiency, and we are now actively working to narrow that gap. Our scope to improve\nefficiency is substantial. Let's look at it in the short-term and then in the long-term. In the short\nterm, our losses will narrow primarily driven by the following. Number one is optimization of\ncustomer mix. We have scaled up marketing expenses for user growth nationwide over the past\nfour months and acquired a large number of new customers. New user acquisition requires\nsubstantial upfront investment, but we excel at user retention. And as the proportion of repeat\ncustomers increases, UE will improve.\nNumber two is optimization of order mix. In the next stage, we aim to increase the proportion of\nhigh-value orders, including high-value meal orders, and increase the proportion of non-food\ncategory orders. UE will, therefore, improve as a result of higher Average Order Value, AOV. And\nthe third is optimization of fulfillment efficiency and costs. In the initial phase, as order volume\nramped up by 4 times, the number one priority for us as a platform was to ensure the user\nexperience. In July and August, therefore, we made an additional large investment to address\nthe severe short-term lack of delivery capacity. Going forward, as order scale stabilizes, our\nlogistics costs will decline significantly, contributing to further UE improvement.\n(Foreign Language) So in the short term, we expect that while continuing to maintain investment\nin consumer benefit, through logistics and subsidy efficiency improvements and order structure\noptimization, our UE losses can be reduced by half. In the long term, as order density increases,\nthere is considerable scope to optimize our logistics costs compared to four months ago. In\naddition, there is also considerable scope to improve our targeted engagement of offline\nmerchants.\nIn my view, scale is the primary factor in achieving efficiency. With our newly achieved scale and\nmarket share, we are confident that we can achieve industry-leading efficiency in the long term.\nAt the same time, we will not look at the standalone profitability of Quick Commerce delivery. If\ncombined with the incremental benefits to our E-commerce business, we believe Quick\nCommerce will bring sustained positive economic value to the overall platform while maintaining\nprice competitiveness.\n(Foreign Language) Next, let me talk about development of the non-food category. In Quick\nCommerce, we divide non-food deliveries into two parts. One is the original hyperlocal quick\ncommerce -- e-commerce model, and the other is e-commerce -- a hybrid model, quick\ncommerce plus e-commerce. On the hyperlocal side, we have leveraged our abundant supplies\nand strong supply chain to develop a lightning warehouse model. Over the past few months,\nsupply in these warehouses has rapidly expanded. We now have over 50,000 lightning\nwarehouses with order growth of over 360% year-on-year. 25% of the supply in these lightning\nwarehouses comes from supply chains within the Alibaba ecosystem. Secondly, we have\nfulfillment capacity from front warehouses that have been developed by Freshippo for its fresh\ngroceries category. Following Freshippo's supply connection into Taobao Instant Commerce,\norder volume has already exceeded 2 million, up by 70% year-on-year. In terms of the hybrid\nmodel, Tmall supermarket is upgrading from a traditional B2C fulfillment model to a quick\ncommerce model. This maintains its price competitiveness while achieving much faster shipping\nspeeds.\n(Foreign Language) We are also actively onboarding Tmall brands' offline stores into Taobao\nInstant Commerce, enabling unified online, offline O2O operations for Tmall brands. We expect\nup to 1 million branded offline stores to join Taobao Instant Commerce over time. The integration\nof Tmall and Taobao Instant Commerce will open up new growth drivers for brands and offer\nconsumers a new shopping experience. Overall, we expect Taobao Instant Commerce and Quick\nFINAL TRANSCRIPT\n2025-08-29\nAlibaba Group Holding Ltd (BABA US Equity)\n© COPYRIGHT 2024, BLOOMBERG LP. All rights reserved. Any reproduction, redistribution or retransm ission is expressly prohibited.\nPrinted on 08-29-2025 Page 7 of 14\nCommerce to add RMB1 trillion in annualized incremental GMV to the platform within the next\nthree years. We also believe the food delivery market's shift from a single dominant player to\nmulti-platform competition gives merchants and consumers more choice, which benefits the\nindustry long-term. Throughout this transition, we as a platform are committing real financial\nresources and investing to create over 1 million direct jobs, drive industry transformation, and\nstimulate consumption and the broader economy. Thank you.\nA - Lydia Liu {BIO 24394330 <GO>}\nNext question, please.\nOperator\nThank you. Your next question comes from Thomas Chong at Jefferies. Please go ahead.\nQ - Thomas Chong {BIO 21155199 <GO>}\nHi, good evening. Thanks, management, for taking my question, and congratulations on a very\nsolid set of results. My question is about Alibaba Cloud. We have seen our Cloud business is\ndoing very well and accelerate to 26% year-on-year this quarter. My first question is, how should\nwe think about this acceleration? Should we expect acceleration continues for coming quarters as\nwell as our expectation for FY26? Because when I look into our acceleration and look into\noverseas peers, how should we think about the pace of monetization versus the US?\nAnd on the other hand, we also see our Cloud margin reaching 8.8%. How should we think about\nthe margin outlook into the future? And on that front, given our acceleration is very impressive,\ncan we talk about how different industry sectors actually performed in this quarter? I remember\nlast quarter we talked about multiple sectors, including traditional sectors also embrace the cloud\nopportunities. Are we seeing something different or making a lot more progress for this quarter?\nAnd on that CapEx, how should we think about our CapEx outlook, given we have seen our\nCapEx is (inaudible) during this quarter? Thank you.\n(Foreign Language).\nA - Unidentified Speaker\n(Foreign Language) Okay, thank you very much for those questions. And in noting them down, I\nsaw there were quite a few questions, but let me start with the first one regarding the outlook for\nour growth rate. So we certainly see a very clear trend among our customers in terms of utilizing\nAI products, and they're developing AI products, and this represents very strong demand. First of\nall, as AI model capabilities continue to strengthen, more and more new AI applications are being\ndeveloped and applied into more and more new use cases. At the same time, many vendors that\nhad original use cases where they were running workloads on traditional CPUs are now beginning\nto leverage large models and using AI to run those original functions. So for all these reasons,\ndemand is very strong and continues to grow robustly.\nIn recent quarters, we've seen fast growth in inference workloads as well as continued growth in\ntraining and in inferencing. Over the past few quarters, apart from that rapid growth in\ninferencing, we've also observed some new industry trends. On the training side, apart from the\nlarge fundamental models that continue to be upgraded in the market, there is also a lot of\ntraining that is taking place and creating new opportunities. For example, automobile vendors, for\nexample companies in the education sector, or companies in the multimedia application space,\nthey all have training requirements. They're leveraging their own proprietary data to train\nFINAL TRANSCRIPT\n2025-08-29\nAlibaba Group Holding Ltd (BABA US Equity)\n© COPYRIGHT 2024, BLOOMBERG LP. All rights reserved. Any reproduction, redistribution or retransm ission is expressly prohibited.\nPrinted on 08-29-2025 Page 8 of 14\nproprietary models to meet their demands, and that in turn is driving higher utilization of our\noverall AI infrastructure. So this is a very strong boost to infrastructure use.\nAt the same time, we also see new opportunities around training whereby companies are\nleveraging our open-source models, and they have a lot of training demands in doing so. For\nexample, we mentioned education companies as well as companies in the healthcare sector, and\ncompanies that are creating development tools, platform companies. So we see a lot of\nexcellent opportunities with these proprietary models where they're leveraging their own data\nand their own -- to meet their own use cases by performing post-training or fine-tuning of our\nQwen models. And on that basis, they're making use of our Alibaba Cloud Computing platform.\nAnd at the same time, on that basis, we can also begin gradually to develop commercialized\nservices, post-training services for our open-source models.\n(Foreign Language) Your other question had to do with gross margin and benchmarking against\nwhat we see overseas. So perhaps I can share with you my judgment overall as to the Chinese\ncloud market. And what I see as the trend is for there to be a higher level of market\nconcentration in China as compared to what we see in overseas markets, because developers\nhere require full-stack comprehensive capabilities for what they're developing. And we have that\nfull stack with complete capabilities across traditional cloud computing, compute storage, AI\ncompute or AI models. And of course, we have a very developer-friendly open ecosystem as\nwell. So our goal is to maintain a growth rate above the average rate of market growth to -- at\nthe same time increase our market share. And in terms of our strategic objectives, the priority is\non growing the number of users, expanding into new use cases, and not in the short term on\nincreasing gross margin.\n(Foreign Language) So turning now to the question about our CapEx, capital expenditures on AI.\nWe will continue to implement our three-year plan to invest RMB380 billion in Cloud and AI.\nHowever, based on the supply chain situation in different quarters, there may be quarter-to-\nquarter fluctuation. At the same time, based on changes in policies around AI chips and supply,\nwe have backup plans in place to work with various, different partners to be able to respond to\ndifferent situations in respect of supply chains. So I'm confident that no matter what changes may\ncrop up in the industry, we will continue as planned and as expected to move forward with that\nplanned CapEx investment of RMB380 billion.\nA - Lydia Liu {BIO 24394330 <GO>}\nNext question, please.\nOperator\nThank you. Your next question comes from Kenneth Fong at UBS. Please go ahead.\nQ - Kenneth Fong {BIO 15114038 <GO>}\nHi, good evening management, and thank you for taking my question. Given the cross-sellings\nthat we have seen already achieved in our food delivery part, do we plan to ramp up the in-store\npart of local service, i.e., (Foreign Language)? Because we noticed that Ele.me (Foreign Language)\nin-store coupons have been stepping up promotion in certain regions. So, how should we think\nabout any further investment that expands in this in-store part of the business in the coming\nmonths on top of the food delivery? Thank you.\n(Foreign Language).\nFINAL TRANSCRIPT\n2025-08-29\nAlibaba Group Holding Ltd (BABA US Equity)\n© COPYRIGHT 2024, BLOOMBERG LP. All rights reserved. Any reproduction, redistribution or retransm ission is expressly prohibited.\nPrinted on 08-29-2025 Page 9 of 14\nA - Unidentified Speaker\n(Foreign Language) Yes, thank you. Let me take this question. So the first thing I would say is that\nthis is very much connected to the scale that we have achieved in Quick Commerce that I just\nshared with you. We have a massive scale now of users on our Quick Commerce channel every\nday. Basically, we're talking about 150 million active users on a daily basis. And within those users,\nthere are some who go to the store themselves to do self-pickup and that also includes group\npurchase using coupons. So, from the perspective of satisfying the needs of our users and in\nparticular those who go offline in-store, there's a lot of synergy there. And so we will also\nconsider providing more diverse services to these users. And in fact, we're already doing some\ntesting and piloting in certain selected cities.\nA - Lydia Liu {BIO 24394330 <GO>}\nNext question, please.\nOperator\nThank you. Your next question comes from Joyce Ju at Bank of America. Please go ahead.\nQ - Joyce Ju {BIO 20718580 <GO>}\n(Foreign Language) Thank you, management, for taking my question. My first question has to do\nwith the pace of investments going forward. You mentioned your commitment to the three-year\nplan to invest RMB380 billion in Cloud and AI. I'm wondering if you could also tell us about your\ninvestment plans going forward on the commerce side, on the consumption side, what will the\npace of those investments look like? Apart from investing in Quick Commerce, what other\ninvestments are you contemplating, for example, in supply chains or in users? And what will the\npace of those investments look like?\nAnd then secondly, I'd like to ask about CMR. So we saw strong growth in CMR this quarter, up\n10% year-on-year. But we know that heading into September, the positive impact of the software\nservice fee that you started implementing last year will diminish. So looking forward, how much\npositive impact will QZT penetration have on CMR growth? And beyond that, the incremental\ntraffic and GMV being driven by Quick Commerce, how much positive impact will that have on\nCMR? Thank you.\nA - Unidentified Speaker\n(Foreign Language) Thank you. Let me take this question. So, given the historic opportunity to\ninvest in the consumer market today, we're certainly grasping that. But our investments in the\nconsumption market are not just starting now. We've always been making investments in the user\nside. Certainly, the Taobao and Tmall Group had been investing in users on the supply chain side.\nNot just the Taobao and Tmall Group, but also Freshippo and other of our businesses were\ninvesting in the supply chains as well.\nSo when we talk about this large investment that we're now making in the consumption market of\nRMB50 billion for developing Quick Commerce, this is incremental. This is a new investment on\ntop of those investments that we were making. We will pace the investment cadence and rhythm\nin line with the market circumstances and market developments to ensure that it makes sense.\nThank you.\nA - Toby Xu {BIO 23337401 <GO>}\nFINAL TRANSCRIPT\n2025-08-29\nAlibaba Group Holding Ltd (BABA US Equity)\n© COPYRIGHT 2024, BLOOMBERG LP. All rights reserved. Any reproduction, redistribution or retransm ission is expressly prohibited.\nPrinted on 08-29-2025 Page 10 of 14\n(Foreign Language) Thank you. So your second question had to do with CMR. And I think that the\nkey point there was the impact of take rate. So in this quarter, as we said, CMR growth was\npositive and robust. And this was mainly because of a large increase in take rate. And there were\na few -- basically two major reasons for that. One was the 0.6% software service fee, and the\nother is QZT, which is itself powered by AI, continuing to achieve deeper penetration. And I think\nthat in the coming quarters we can expect to see also positive impacts on CMR from these\naspects.\nAt the same time, there will be positive impact on CMR from Quick Commerce as well, where\nwe're driving user growth as well as higher user frequency, which will result in a higher take rate.\nSo we would expect that in the coming couple of quarters, you can expect to see relatively rapid\ngrowth in CMR as you are now seeing.\nA - Lydia Liu {BIO 24394330 <GO>}\nNext question, please.\nOperator\nThank you. The next question comes from Yuan Liao from CITIC. Please go ahead.\nQ - Yuan Liao {BIO 20396899 <GO>}\n(Foreign Language) Thanks. Good evening, management. So we've been following very closely\nthe developments of your models and looking at the Qwen3 block, what we see is that it marks a\ntransition from an era where the focus is on training to one where it's all about agents, an agent-\ncentered era. So my question is, what additional capabilities and resources or investments do we\nneed in this transition period? And can you tell us a bit about some of your latest developments\naround agent products and agent applications?\nA - Unidentified Speaker\n(Foreign Language) Thank you. Let me take that question. So indeed, we do see the overall\nevolution path when it comes to models going from simple chatbots toward agents. And there\nare several trends that we can see in the era of agents. One, certainly, is that models require\nlarger context windows to be able to undertake more complex tasks with longer chains of\nthought. They need to be able to utilize multiple different tools or chains of tools. And the agents\nneed to be able to access different systems, call on different internal systems within the\nenterprise. So these developments also create new opportunities for us as an infrastructure\nprovider. Many of these agents will need virtual servers, or they'll need to have many browser\nwindows open simultaneously, or they'll need many mobile virtual machines and sandbox\nenvironments. So, for a cloud vendor like Alibaba Cloud, these are all very positive developments.\nWe're supporting numerous clients in numerous different sectors, and we can provide all of these\nwith a new product called AgentBay, which is a -- it provides a sandbox environment specifically\nfor agents. So this is very much an agent-driven era in AI and cloud development. And for us, this\nis an excellent opportunity.\n(Foreign Language) Let me add to that by sharing some more of our thinking about models as\nthey relate to agent-driven AI. I think that coding capabilities will become very important because\nmodels with strong coding capabilities can be connected to lots of different tools and lots of\ndifferent enterprise internal systems. And in that way, they'll be able to solve for many tasks\nwithin the enterprise or even to solve for some more sophisticated tasks on the consumer side.\nFINAL TRANSCRIPT\n2025-08-29\nAlibaba Group Holding Ltd (BABA US Equity)\n© COPYRIGHT 2024, BLOOMBERG LP. All rights reserved. Any reproduction, redistribution or retransm ission is expressly prohibited.\nPrinted on 08-29-2025 Page 11 of 14\nAnother point I should add with respect to agentic products is that we have quite a few products\nthat can tie into that. They're excellent within the Alibaba ecosystem. For example, a lot of\nenterprises, especially e-commerce enterprises, need a client service product within Alibaba\nCloud. Apart from providing compute and infrastructure, we're also able to synergize with\nTaobao, with DingTalk, with Amap, and even with Alipay in order to be able to provide more kinds\nof automated solutions at the business level. So through these tools, these enterprises can\ndevelop AI agents that are better able to solve for these various tasks within the enterprise.\nA - Lydia Liu {BIO 24394330 <GO>}\nNext question, please.\nOperator\nThank you. Your next question comes from Alex Yao at J.P. Morgan. Please go ahead.\nQ - Alex Yao {BIO 16818860 <GO>}\n(Foreign Language) Thanks, management, and good evening. I have a question coming back to\nQuick Commerce or Instant Commerce. Because you know, it's not the first time that Alibaba has\ntried to enter this market. Back in -- from the acquisition of Ele.me back in 2018, lots of time,\nenergy, resources were spent on trying to grow our market share in that space. But it seems that\nover a period of two to three years, that original strategic intent really wasn't realized. So I asked\nDeepSeek why it is that Ele.me under Alibaba still couldn't beat Meituan and be bigger than\nMeituan. And what DeepSeek told me was that the son of the rich merchant can't beat the\nentrepreneurial wolf who was raised by a poor family.\nSo anyway, it doesn't matter whether DeepSeek is right or wrong, but I'm sure that we've done a\nlot of reflection and thinking going into this new round in the battle. So I'm sure that you will be\ntaking some different strategies or approaches to maximize success. But if you could tell us,\nsimply what's different this time, and what are the different tactics that we're taking?\nA - Unidentified Speaker\n(Foreign Language) Thanks. Well, I guess you could ask DeepSeek again, but I'll take a stab at\nanswering that. It's true that we invested -- we acquired Ele.me and have been investing in it for\nmany years. But I think I would begin by saying that Ele.me has actually made a lot of progress\nover these years. And that may not be reflected in market share, because market share is related\nto our investment as well as our strategy, as well as traffic.\nBut I would say that over these years, Ele.me has made tremendous improvement in terms of\ninfrastructure development and capabilities development. And if that weren't the case, then it\nsimply wouldn't have been possible for Taobao Instant Commerce to have achieved such rapid\ndevelopment in such a short period of time. You know, we couldn't start from zero and build this\nbusiness from scratch, and in just two to four months be able to service 120 million orders. And\nnot just 120 million orders, but to do so with an excellent user experience. I think that all of that\ncredit goes to Ele.me, and the experience and capabilities that we built up following that\nacquisition.\n(Foreign Language) To get this business right, you need to have enough merchants, you need to\nhave enough fulfillment capacity or delivery capacity, and you need to have enough consumers --\nusers on the consumer end. And if you're lacking in any one of those things, then your investment\nefficiency is going to be poor. So in terms of where we are today, following the integration of\nFINAL TRANSCRIPT\n2025-08-29\nAlibaba Group Holding Ltd (BABA US Equity)\n© COPYRIGHT 2024, BLOOMBERG LP. All rights reserved. Any reproduction, redistribution or retransm ission is expressly prohibited.\nPrinted on 08-29-2025 Page 12 of 14\nEle.me into the Taobao app, we have a vast number of users on Taobao, and these are highly\nactive users. We also have the merchant base that has been built up on Ele.me, and at the same\ntime, we also have the fulfillment capacity, the logistics system that we have built up. So that's the\nfoundation on which we're making this investment.\nAnd then the second thing I would say relates to our investment logic, the way we think about\nthis, because we're not simply looking at the Quick Commerce business on a standalone basis.\nWe're really looking at what it can do, the overall incremental positive benefit it can provide for\nour overall E-commerce business in the short term, in the medium term, and in the long term. So\nthe logic and the way we're thinking about this is different from the past. And of course, for us to\nget this business right and succeed in all those goals, there's still a lot of work that we need to\ndo.\nA - Lydia Liu {BIO 24394330 <GO>}\nOperator, let's take the last question.\nOperator\nThank you. Your next question comes from Gary Yu at Morgan Stanley. Please go ahead.\nQ - Gary Yu {BIO 16275161 <GO>}\nHi. Thank you, management, for the opportunity. I have a question regarding return on invested\ncapital. Given that we are now spending close to RMB50 billion in probably a couple of months on\nQuick Commerce, how should we look at the rate of return of invested capital from these\ninvestments? Because I would imagine if the same amount were to be spent on something on AI,\nmaybe with much bigger TAM and much bigger -- faster growth in Cloud, we may be able to see\na much better return on investment. So, how should we think about how we allocate capital\ninternally between retail and AI investment going forward? Thank you.\n(Foreign Language).\nA - Toby Xu {BIO 23337401 <GO>}\n(Foreign Language) Thank you. Well, as Eddie and I have both mentioned already on the call, we\nare faced with two huge historic opportunities today. The first of these is AI, which we've been\ndiscussing, but the second is consumption. And the opportunity is to transform consumption from\n-- on that journey from E-commerce to local -- hyper local E-commerce to instant commerce. And\nwe absolutely need to firmly grasp both of those opportunities. They're both crucial.\n(Foreign Language) So, in terms of our investment in both of those areas, of course, we're talking\nabout very substantial, very large investments. And from our own point of view, these are historic\ninvestments that we're making. As I said in my prepared remarks, be it from the perspective of\nour capabilities or our resources, and when I talk about resources, that could include our cash\nreserves as well as our cash flows as well as resources across our entire balance sheet, we have\nsufficient resources to be able to make these very substantial investments, as Eddie said,\ninvestments at scale in both of these huge opportunities.\nSo, the key for us really is how to balance the short-term versus long-term returns and where the\npriority should lie. And we can look at that in the context of our AI investments that we've been\nmaking. And I think you will also have seen very clearly already that these investments have\nalready driven an increase in the growth rate of our cloud business. As was just said earlier, that's\nFINAL TRANSCRIPT\n2025-08-29\nAlibaba Group Holding Ltd (BABA US Equity)\n© COPYRIGHT 2024, BLOOMBERG LP. All rights reserved. Any reproduction, redistribution or retransm ission is expressly prohibited.\nPrinted on 08-29-2025 Page 13 of 14\nnot just for this quarter, but we expect the following few quarters to also see increase in the\ngrowth rate in cloud.\nSo, of course, we will also look at the business from the point of view of EBITA margin. But our\nfirst priority at this point is on making these investments and not making the profit rate the higher\nof those two priorities. That doesn't mean that we're not looking at and we don't care about\nprofit rates, of course.\nSo, in terms of AI investments and the investments in Quick Commerce, as Jiang Fan just said,\nwe're not yet making any money from those investments in instant commerce, but we can\nalready see very clearly that with the integration of instant commerce into the Taobao app, that's\ndriving increased traffic. It's driving increased frequency. And as a result of that, that's also driving\nincreased advertising as well on the platform.\nSo, with the progression from E-commerce to instant commerce, all of these investments are\ngoing to drive good returns going forward. And I'm confident that we have sufficient resources to\nbe able to do this and to remain focused on what is truly critical. I think it's important to note that\nwe should not simply focus on short-term returns, and by doing so, lose out on the opportunity to\nmake those long-term returns. So this does require the proper balance.\nA - Lydia Liu {BIO 24394330 <GO>}\nThank you, everyone, for joining us today. We appreciate your time and we look forward to\nspeaking with you again soon.\nOperator\nThank you. That concludes our conference for today. You may now disconnect your lines.\nThis transcript may not be 100 percent accurate and may contain misspellings and other inaccuracies. This transcript is \nprovided \"as is\", without express or implied warranties of any kind. Bloomberg retains all rights to this transcript and \nprovides it solely for your personal, non-commercial use. Bloomberg, its suppliers and third-party agents shall have no \nliability for errors in this transcript or for lost profits, losses, or direct, indirect, incidental, consequential, special or \npunitive damages in connection with the furnishing, performance or use of such transcript. Neither the information nor \nany opinion expressed in this transcript constitutes a solicitation of the purchase or sale of securities or commodities. \nAny opinion expressed in the transcript does not necessarily reflect the views of Bloomberg LP. © COPYRIGHT 2025, \nBLOOMBERG LP. All rights reserved. Any reproduction, redistribution or retransmission is expressly prohibited.\nFINAL TRANSCRIPT\n2025-08-29\nAlibaba Group Holding Ltd (BABA US Equity)\n© COPYRIGHT 2024, BLOOMBERG LP. All rights reserved. Any reproduction, redistribution or retransm ission is expressly prohibited.\nPrinted on 08-29-2025 Page 14 of 14"}, "content_hash": "0f02e48fcbc313db812f1e545ea5013fb036c66c045146bf797fca611c15830b", "transcript_name": "Alibaba Group Holding Ltd Earnings Call 2025829 DN000000003074531761.pdf.json"}