{"validated_at": "2025-12-02T07:59:45.270683", "input": {"call_type": "earnings", "summary_length": "long", "answer_format": "bullet", "filename": "AMZN-Q2-2025-Earnings-Release.pdf"}, "transcripts": {"presentation": "AMAZON.COM ANNOUNCES SECOND QUARTER RESULTS\nSEATTLE—(BUSINESS WIRE) July 31, 2025—Amazon.com, Inc. (NASDAQ: AMZN) today announced financial results for \nits second quarter ended June 30, 2025. \n•\nNet sales increased 13% to $167.7 billion in the second quarter, compared with $148.0 billion in second quarter 2024.\nExcluding the $1.5 billion favorable impact from year-over-year changes in foreign exchange rates throughout the\nquarter, net sales increased 12% compared with second quarter 2024.\n•\nNorth America segment sales increased 11% year-over-year to $100.1 billion.\n•\nInternational segment sales increased 16% year-over-year to $36.8 billion, or increased 11% excluding\nchanges in foreign exchange rates.\n•\nAWS segment sales increased 17.5% year-over-year to $30.9 billion.\n•\nOperating income increased to $19.2 billion in the second quarter, compared with $14.7 billion in second quarter\n2024.\n•\nNorth America segment operating income was $7.5 billion, compared with $5.1 billion in second quarter\n2024.\n•\nInternational segment operating income was $1.5 billion, compared with $0.3 billion in second quarter 2024.\n•\nAWS segment operating income was $10.2 billion, compared with $9.3 billion in second quarter 2024.\n•\nNet income increased to $18.2 billion in the second quarter, or $1.68 per diluted share, compared with $13.5 billion,\nor $1.26 per diluted share, in second quarter 2024.\n•\nOperating cash flow increased 12% to $121.1 billion for the trailing twelve months, compared with $108.0 billion for\nthe trailing twelve months ended June 30, 2024.\n•\nFree cash flow decreased to $18.2 billion for the trailing twelve months, compared with $53.0 billion for the trailing\ntwelve months ended June 30, 2024.\n“Our conviction that AI will change every customer experience is starting to play out as we’ve expanded Alexa+ to millions of \ncustomers, continue to see our shopping agent used by many millions of customers, launched AI models like DeepFleet that \noptimize productivity paths for our 1M+ robots, made it much easier for software developers to write code with Kiro (our new \nagentic IDE), launched Strands to make it easier to build AI agents, and released Bedrock AgentCore to enable agents to be \noperated securely and scalably,” said Andy Jassy, President and CEO, Amazon. “Our AI progress across the board continues to \nimprove our customer experiences, speed of innovation, operational efficiency, and business growth, and I’m excited for what \nlies ahead.”\nSome other highlights since the company’s last earnings announcement include that Amazon:\n•\nHeld its biggest Prime Day event ever, with customers saving billions of dollars and independent sellers achieving\nrecord sales.\n•\nAnnounced expansion of Same-Day and Next-Day Delivery to tens of millions of U.S. customers in 4,000+ smaller\ncities, towns, and rural communities by end of 2025.\n•\nExpanded selection with brands like Away, Aveda, Marc Jacobs Fragrances, Milk Makeup, and Origins.\n•\nAnnounced a Nike storefront on Amazon.com where U.S. customers will be able to shop a range of footwear, apparel,\nand accessories.\n•\nLaunched generative AI tools to enhance shopping experience, including “Hear the highlights” to turn product \nsummaries and reviews into audio clips, and “Enhance My Listing” to keep listings current and compelling.\n•\nExpanded Alexa+ Early Access to millions of customers.\n•\nIncreased Project Kuiper’s satellite internet fleet in low earth orbit with two successful launches.\n•\nAnnounced Prime Video’s NBA broadcast team, including Stan Van Gundy, Kevin Harlan, Dwyane Wade, Taylor \nRooks, Blake Griffin, Dirk Nowitzki, Steve Nash, and Candace Parker.\n•\nDrew approximately 2 million viewers per race and youngest audience among NASCAR broadcasters in more than a \ndecade to Prime Video’s NASCAR Cup Series coverage.\n•\nAnnounced Denis Villeneuve as director of next James Bond film.\n•\nAnnounced integration with Roku that gives advertisers access to largest authenticated Connected TV footprint in the \nU.S., reaching an estimated 80 million households.\n•\nInnovated across Amazon Nova, including:\n•\nThe most comprehensive suite of model customization capabilities.\n•\nLaunched Nova Act, which makes it much easier for customers to build agents that can take automated \nactions across websites.\n•\nExpanded languages for Nova Sonic voice AI to include Spanish, French, Italian, and German.\n•\nSigned new AWS agreements with PepsiCo, Airbnb, Peloton, London Stock Exchange, Nissan Motor Co., GitLab \nInc., SAP, Warner Bros. Discovery Sports, TwelveLabs, FICO, Iberia Airlines, SK Telecom, and NatWest Group.\n•\nAnnounced “AI Zones” in the Kingdom of Saudi Arabia (with HUMAIN) and Korea (with SK Group).\n•\nAnnounced multi-billion dollar investments to expand cloud infrastructure and advance AI innovation in North \nCarolina, Pennsylvania, and Australia.\n•\nAnnounced new AWS offerings, including:\n•\nKiro, an agentic integrated development environment that transforms software development through \ninnovations like spec-driven development, intelligent agent hooks, and a purpose-built interface for developer \nworkflows.\n•\nBedrock AgentCore for deploying and operating highly capable agents securely at enterprise scale.\n•\nGeneral availability of AWS Transform, an AWS agent that cuts mainframe modernization timelines from \nyears to months, completes VMware network conversions up to 80x faster, and reduces operating costs \nfor .NET applications by up to 40%.\n•\nStrands Agents, an open source tool that enables developers to more easily build new agents, offering support \nfor popular open source frameworks like A2A and MCP.\n•\nAI agents and tools in AWS Marketplace, with listings from leading providers including Anthropic, \nAccenture, PwC, Salesforce, and IBM, so customers can easily discover and deploy agents.\n•\nNew foundation models in Amazon Bedrock, including Anthropic’s Claude 4 and TwelveLabs’ Marengo and \nPegasus.\n•\nGeneral availability of Amazon EC2 instances powered by NVIDIA Grace Blackwell Superchips, AWS’s \nmost powerful GPU-accelerated instance for training and deploying the largest, most sophisticated AI models.\n•\nGeneral availability of Oracle Database@AWS for seamless migration of Oracle Exadata and RAC \nworkloads, zero-ETL integration with Amazon Redshift, and ability to build powerful ML and AI \napplications.\n•\nAmazon S3 Vectors, which delivers vector storage for AI agents, AI inference, and semantic search, reducing \nthe cost of uploading, storing, and querying vectors by up to 90%.\n•\nIntroduced DeepFleet, an AI model that makes Amazon’s one million+ robots work smarter by coordinating \nmovements to find optimal paths and reduce bottlenecks, improving robot travel efficiency by 10%.\n•\nEnhanced inventory management with AI-powered demand forecasting, improving regional accuracy by 20%, and \noptimizing inventory placement and delivery speeds for millions of popular items.\n•\nIntroduced Vulcan, Amazon’s first robot to combine sight and touch to navigate cluttered spaces like humans do, \nmaking jobs safer and easier.\n•\nAnnounced 700,000+ employees participated in upskilling programs to date.\n•\nLaunched new robotics and engineering apprenticeships for U.S. employees.\n•\nAnnounced 134,000+ employees in 55 countries participated in Amazon’s Global Month of Volunteering, supporting \n2,500+ organizations and communities.\n•\nAnnounced expansion of water recycling to 120+ AWS U.S. data centers by 2030, expected to preserve over 530 \nmillion gallons of drinking water annually.\n•\nSupported communities impacted by flooding in central Texas by donating 68,000+ relief items.\nFinancial Guidance\nThe following forward-looking statements reflect Amazon.com’s expectations as of July 31, 2025, and are subject to substantial \nuncertainty. Our results are inherently unpredictable and may be materially affected by many factors, such as fluctuations in \nforeign exchange rates, changes in global economic and geopolitical conditions, tariff and trade policies, and customer demand \nand spending (including the impact of recessionary fears), inflation, interest rates, regional labor market constraints, world \nevents, the rate of growth of the internet, online commerce, cloud services, and new and emerging technologies, and the various \nfactors detailed below. \nThird Quarter 2025 Guidance\n•\nNet sales are expected to be between $174.0 billion and $179.5 billion, or to grow between 10% and 13% compared \nwith third quarter 2024. This guidance anticipates a favorable impact of approximately 130 basis points from foreign \nexchange rates.  \n•\nOperating income is expected to be between $15.5 billion and $20.5 billion, compared with $17.4 billion in third \nquarter 2024.  \n•\nThis guidance assumes, among other things, that no additional business acquisitions, restructurings, or legal \nsettlements are concluded.\nConference Call Information\nA conference call will be webcast live today at 2:00 p.m. PT/5:00 p.m. ET, and will be available for at least three months at \namazon.com/ir. This call will contain forward-looking statements and other material information regarding the Company’s \nfinancial and operating results.\nForward-Looking Statements\nThese forward-looking statements are inherently difficult to predict. Actual results and outcomes could differ materially for a \nvariety of reasons, including, in addition to the factors discussed above, the amount that Amazon.com invests in new business \nopportunities and the timing of those investments, the mix of products and services sold to customers, the mix of net sales \nderived from products as compared with services, the extent to which we owe income or other taxes, competition, management \nof growth, potential fluctuations in operating results, international growth and expansion, the outcomes of claims, litigation, \ngovernment investigations, and other proceedings, fulfillment, sortation, delivery, and data center optimization, risks of \ninventory management, variability in demand, the degree to which the Company enters into, maintains, and develops \ncommercial agreements, proposed and completed acquisitions and strategic transactions, payments risks, and risks of \nfulfillment throughput and productivity. Other risks and uncertainties include, among others, risks related to new products, \nservices, and technologies, security incidents, system interruptions, government regulation and taxation, and fraud. In addition, \nglobal economic and geopolitical conditions and additional or unforeseen circumstances, developments, or events may give \nrise to or amplify many of these risks. More information about factors that potentially could affect Amazon.com’s financial \nresults is included in Amazon.com’s filings with the Securities and Exchange Commission (“SEC”), including its most recent \nAnnual Report on Form 10-K and subsequent filings.\nAdditional Information\nOur investor relations website is amazon.com/ir and we encourage investors to use it as a way of easily finding information \nabout us. We promptly make available on this website, free of charge, the reports that we file or furnish with the SEC, corporate \ngovernance information (including our Code of Business Conduct and Ethics), and select press releases, which may contain \nmaterial information about us, and you may subscribe to be notified of new information posted to this site.\nAbout Amazon\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to \noperational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best \nEmployer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, \nFulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, \nJust Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more \ninformation, visit amazon.com/about and follow @AmazonNews.\nAMAZON.COM, INC.\nConsolidated Statements of Cash Flows\n(in millions)\n(unaudited) \n  \nThree Months Ended\nJune 30,\nSix Months Ended\nJune 30,\nTwelve Months Ended\nJune 30,\n \n2024\n2025\n2024\n2025\n2024\n2025\nCASH, CASH EQUIVALENTS, AND RESTRICTED CASH, BEGINNING OF \nPERIOD\n$ \n73,332 \n$ \n69,893 \n$ \n73,890 \n$ \n82,312 \n$ \n50,067 \n$ \n71,673 \nOPERATING ACTIVITIES:\nNet income\n \n13,485 \n \n18,164 \n \n23,916 \n \n35,291 \n \n44,419 \n \n70,623 \nAdjustments to reconcile net income to net cash from operating activities:\nDepreciation and amortization of property and equipment and capitalized \ncontent costs, operating lease assets, and other\n \n12,038 \n \n15,227 \n \n23,722 \n \n29,489 \n \n49,673 \n \n58,562 \nStock-based compensation\n \n6,722 \n \n6,534 \n \n11,683 \n \n10,223 \n \n23,831 \n \n20,551 \nNon-operating expense (income), net\n \n(95)  \n(1,258)  \n2,639 \n \n(4,075)  \n1,310 \n \n(4,702) \nDeferred income taxes\n \n(785)  \n11 \n \n(1,723)  \n518 \n \n(4,383)  \n(2,407) \nChanges in operating assets and liabilities:\nInventories\n \n(3,085)  \n(4,054)  \n(1,309)  \n(5,276)  \n2,142 \n \n(5,851) \nAccounts receivable, net and other\n \n(2,209)  \n(1,125)  \n1,475 \n \n122 \n \n(9,556)  \n(4,602) \nOther assets\n \n(3,055)  \n(2,971)  \n(5,756)  \n(6,373)  \n(11,692)  \n(15,100) \nAccounts payable\n \n6,005 \n \n7,058 \n \n(5,277)  \n(1,985)  \n8,431 \n \n6,264 \nAccrued expenses and other\n \n(4,147)  \n(4,952)  \n(7,075)  \n(9,013)  \n(1,802)  \n(4,842) \nUnearned revenue\n \n407 \n \n(119)  \n1,975 \n \n609 \n \n5,579 \n \n2,641 \nNet cash provided by (used in) operating activities\n \n25,281 \n \n32,515 \n \n44,270 \n \n49,530 \n \n107,952 \n \n121,137 \nINVESTING ACTIVITIES:\nPurchases of property and equipment\n \n(17,620)  \n(32,183)  \n(32,545)  \n(57,202)  \n(59,612)  \n(107,656) \nProceeds from property and equipment sales and incentives\n \n1,227 \n \n815 \n \n2,217 \n \n1,579 \n \n4,633 \n \n4,703 \nAcquisitions, net of cash acquired, non-marketable investments, and other, net\n \n(571)  \n(1,700)  \n(3,925)  \n(1,652)  \n(5,935)  \n(4,809) \nSales and maturities of marketable securities\n \n3,265 \n \n11,441 \n \n4,657 \n \n19,178 \n \n7,618 \n \n30,924 \nPurchases of marketable securities\n \n(8,439)  \n(17,797)  \n(10,404)  \n(31,130)  \n(11,058)  \n(46,731) \nNet cash provided by (used in) investing activities\n \n(22,138)  \n(39,424)  \n(40,000)  \n(69,227)  \n(64,354)  \n(123,569) \nFINANCING ACTIVITIES:\nProceeds from short-term debt, and other\n \n525 \n \n2,093 \n \n863 \n \n3,908 \n \n1,813 \n \n8,187 \nRepayments of short-term debt, and other\n \n(229)  \n(1,392)  \n(633)  \n(3,474)  \n(15,066)  \n(7,901) \nProceeds from long-term debt\n \n— \n \n— \n \n— \n \n746 \n \n— \n \n746 \nRepayments of long-term debt\n \n(4,169)  \n(2,751)  \n(4,499)  \n(2,751)  \n(4,789)  \n(7,434) \nPrincipal repayments of finance leases\n \n(538)  \n(411)  \n(1,308)  \n(821)  \n(3,092)  \n(1,556) \nPrincipal repayments of financing obligations\n \n(79)  \n(78)  \n(169)  \n(194)  \n(306)  \n(694) \nNet cash provided by (used in) financing activities\n \n(4,490)  \n(2,539)  \n(5,746)  \n(2,586)  \n(21,440)  \n(8,652) \nForeign currency effect on cash, cash equivalents, and restricted cash\n \n(312)  \n1,008 \n \n(741)  \n1,424 \n \n(552)  \n864 \nNet increase (decrease) in cash, cash equivalents, and restricted cash\n \n(1,659)  \n(8,440)  \n(2,217)  \n(20,859)  \n21,606 \n \n(10,220) \nCASH, CASH EQUIVALENTS, AND RESTRICTED CASH, END OF PERIOD\n$ \n71,673 \n$ \n61,453 \n$ \n71,673 \n$ \n61,453 \n$ \n71,673 \n$ \n61,453 \nSUPPLEMENTAL CASH FLOW INFORMATION:\nCash paid for interest on debt, net of capitalized interest\n$ \n680 \n$ \n523 \n$ \n949 \n$ \n759 \n$ \n2,201 \n$ \n1,668 \nCash paid for operating leases\n \n2,844 \n \n3,758 \n \n6,176 \n \n7,320 \n \n11,634 \n \n13,485 \nCash paid for interest on finance leases\n \n72 \n \n72 \n \n146 \n \n143 \n \n296 \n \n284 \nCash paid for interest on financing obligations\n \n50 \n \n52 \n \n114 \n \n107 \n \n210 \n \n212 \nCash paid for income taxes, net of refunds\n \n5,700 \n \n4,761 \n \n6,158 \n \n5,638 \n \n12,983 \n \n11,788 \nAssets acquired under operating leases\n \n3,911 \n \n4,621 \n \n7,664 \n \n8,942 \n \n13,986 \n \n16,702 \nProperty and equipment acquired under finance leases, net of remeasurements and \nmodifications\n \n181 \n \n937 \n \n223 \n \n991 \n \n617 \n \n1,622 \nIncrease (decrease) in property and equipment acquired but not yet paid\n \n2,760 \n \n(1,600)  \n3,171 \n \n1,508 \n \n3,791 \n \n5,376 \nAMAZON.COM, INC.\nConsolidated Statements of Operations\n(in millions, except per share data)\n(unaudited)\n  \nThree Months Ended\nJune 30,\nSix Months Ended\nJune 30,\n2024\n2025\n2024\n2025\nNet product sales\n$ \n61,569 $ \n68,246 $ \n122,484 $ \n132,216 \nNet service sales\n \n86,408  \n99,456  \n168,806  \n191,153 \nTotal net sales\n \n147,977  \n167,702  \n291,290  \n323,369 \nOperating expenses:\nCost of sales\n \n73,785  \n80,809  \n146,418  \n157,785 \nFulfillment\n \n23,566  \n25,976  \n45,883  \n50,569 \nTechnology and infrastructure\n \n22,304  \n27,166  \n42,728  \n50,160 \nSales and marketing\n \n10,512  \n11,416  \n20,174  \n21,179 \nGeneral and administrative\n \n3,041  \n2,965  \n5,783  \n5,593 \nOther operating expense (income), net\n \n97  \n199  \n325  \n507 \nTotal operating expenses\n \n133,305  \n148,531  \n261,311  \n285,793 \nOperating income\n \n14,672  \n19,171  \n29,979  \n37,576 \nInterest income\n \n1,180  \n1,085  \n2,173  \n2,151 \nInterest expense\n \n(589)  \n(516)  \n(1,233)  \n(1,057) \nOther income (expense), net\n \n(18)  \n1,117  \n(2,691)  \n3,866 \nTotal non-operating income (expense)\n \n573  \n1,686  \n(1,751)  \n4,960 \nIncome before income taxes\n \n15,245  \n20,857  \n28,228  \n42,536 \nProvision for income taxes\n \n(1,767)  \n(2,678)  \n(4,234)  \n(7,231) \nEquity-method investment activity, net of tax\n \n7  \n(15)  \n(78)  \n(14) \nNet income\n$ \n13,485 $ \n18,164 $ \n23,916 $ \n35,291 \nBasic earnings per share\n$ \n1.29 $ \n1.71 $ \n2.30 $ \n3.32 \nDiluted earnings per share\n$ \n1.26 $ \n1.68 $ \n2.24 $ \n3.27 \nWeighted-average shares used in computation of earnings per \nshare:\nBasic\n \n10,447  \n10,637  \n10,420  \n10,620 \nDiluted\n \n10,708  \n10,806  \n10,689  \n10,800 \nAMAZON.COM, INC.\nConsolidated Statements of Comprehensive Income\n(in millions)\n(unaudited)\n  \nThree Months Ended\nJune 30,\nSix Months Ended\nJune 30,\n \n2024\n2025\n2024\n2025\nNet income\n$ \n13,485 $ \n18,164 $ \n23,916 $ \n35,291 \nOther comprehensive income (loss):\nForeign currency translation adjustments, net of tax of $58, \n$(142), $88, and $(208)\n \n(637)  \n3,314  \n(1,733)  \n4,849 \nAvailable-for-sale debt securities:\nChange in net unrealized gains (losses), net of tax of \n$(69), $(12), $(227), and $(23)\n \n241  \n40  \n777  \n77 \nLess: reclassification adjustment for losses (gains) \nincluded in “Other income (expense), net,” net of tax \nof $(1), $5, $(1), and $814\n \n3  \n(17)  \n4  \n(2,471) \nNet change\n \n244  \n23  \n781  \n(2,394) \nOther, net of tax of $(1), $(1), $(2), and $0\n \n(2)  \n(3)  \n(1)  \n(1) \nTotal other comprehensive income (loss)\n \n(395)  \n3,334  \n(953)  \n2,454 \nComprehensive income\n$ \n13,090 $ \n21,498 $ \n22,963 $ \n37,745 \nAMAZON.COM, INC.\nSegment Information\n(in millions)\n(unaudited) \n  \nThree Months Ended\nJune 30,\nSix Months Ended\nJune 30,\n2024\n2025\n2024\n2025\nNorth America\nNet sales\n$ \n90,033 \n$ 100,068 \n$ 176,374 \n$ 192,955 \nOperating expenses\n \n84,968 \n \n92,551 \n \n166,326 \n \n179,597 \nOperating income\n$ \n5,065 \n$ \n7,517 \n$ \n10,048 \n$ \n13,358 \nInternational\nNet sales\n$ \n31,663 \n$ \n36,761 \n$ \n63,598 \n$ \n70,274 \nOperating expenses\n \n31,390 \n \n35,267 \n \n62,422 \n \n67,763 \nOperating income\n$ \n273 \n$ \n1,494 \n$ \n1,176 \n$ \n2,511 \nAWS\nNet sales\n$ \n26,281 \n$ \n30,873 \n$ \n51,318 \n$ \n60,140 \nOperating expenses\n \n16,947 \n \n20,713 \n \n32,563 \n \n38,433 \nOperating income\n$ \n9,334 \n$ \n10,160 \n$ \n18,755 \n$ \n21,707 \nConsolidated\nNet sales\n$ 147,977 \n$ 167,702 \n$ 291,290 \n$ 323,369 \nOperating expenses\n \n133,305 \n \n148,531 \n \n261,311 \n \n285,793 \nOperating income\n \n14,672 \n \n19,171 \n \n29,979 \n \n37,576 \nTotal non-operating income (expense)\n \n573 \n \n1,686 \n \n(1,751) \n \n4,960 \nProvision for income taxes\n \n(1,767) \n \n(2,678) \n \n(4,234) \n \n(7,231) \nEquity-method investment activity, net of tax\n \n7 \n \n(15) \n \n(78) \n \n(14) \nNet income\n$ \n13,485 \n$ \n18,164 \n$ \n23,916 \n$ \n35,291 \nSegment Highlights:\nY/Y net sales growth:\nNorth America\n 9 %\n 11 %\n 11 %\n 9 %\nInternational\n 7 \n 16 \n 8 \n 10 \nAWS\n 19 \n 17 \n 18 \n 17 \nConsolidated\n 10 \n 13 \n 11 \n 11 \nNet sales mix:\nNorth America\n 61 %\n 60 %\n 60 %\n 60 %\nInternational\n 21 \n 22 \n 22 \n 22 \nAWS\n 18 \n 18 \n 18 \n 18 \nConsolidated\n 100 %\n 100 %\n 100 %\n 100 %\nAMAZON.COM, INC.\nConsolidated Balance Sheets\n(in millions, except per share data)\n (unaudited)\nDecember 31, 2024\nJune 30, 2025\nASSETS\nCurrent assets:\nCash and cash equivalents\n$ \n78,779 $ \n57,741 \nMarketable securities\n \n22,423  \n35,439 \nInventories\n \n34,214  \n40,825 \nAccounts receivable, net and other\n \n55,451  \n57,415 \nTotal current assets\n \n190,867  \n191,420 \nProperty and equipment, net\n \n252,665  \n297,616 \nOperating leases\n \n76,141  \n82,125 \nGoodwill\n \n23,074  \n23,155 \nOther assets\n \n82,147  \n87,854 \nTotal assets\n$ \n624,894 $ \n682,170 \nLIABILITIES AND STOCKHOLDERS’ EQUITY\nCurrent liabilities:\nAccounts payable\n$ \n94,363 $ \n98,285 \nAccrued expenses and other\n \n66,965  \n66,974 \nUnearned revenue\n \n18,103  \n21,662 \nTotal current liabilities\n \n179,431  \n186,921 \nLong-term lease liabilities\n \n78,277  \n83,221 \nLong-term debt\n \n52,623  \n50,718 \nOther long-term liabilities\n \n28,593  \n27,535 \nCommitments and contingencies\nStockholders’ equity:\nPreferred stock ($0.01 par value; 500 shares authorized; no shares issued or \noutstanding)\n \n—  \n— \nCommon stock ($0.01 par value; 100,000 shares authorized; 11,108 and 11,175 \nshares issued; 10,593 and 10,660 shares outstanding)\n \n111  \n112 \nTreasury stock, at cost\n \n(7,837)  \n(7,837) \nAdditional paid-in capital\n \n120,864  \n130,923 \nAccumulated other comprehensive income (loss)\n \n(34)  \n2,420 \nRetained earnings\n \n172,866  \n208,157 \nTotal stockholders’ equity\n \n285,970  \n333,775 \nTotal liabilities and stockholders’ equity\n$ \n624,894 $ \n682,170 \nAMAZON.COM, INC.\nSupplemental Financial Information and Business Metrics\n(in millions, except per share data)\n(unaudited)\nQ1 2024\nQ2 2024\nQ3 2024\nQ4 2024\nQ1 2025\nQ2 2025\nY/Y %\nChange\nCash Flows and Shares\nOperating cash flow -- trailing twelve months (TTM)\n$ \n99,147 \n$ 107,952 \n$ 112,706 \n$ 115,877 \n$ 113,903 \n$ 121,137 \n 12 %\nOperating cash flow -- TTM Y/Y growth\n 82 %\n 75 %\n 57 %\n 36 %\n 15 %\n 12 %\nN/A\nPurchases of property and equipment, net of proceeds from sales and \nincentives -- TTM\n$ \n48,998 \n$ \n54,979 \n$ \n64,959 \n$ \n77,658 \n$ \n87,978 \n$ 102,953 \n 87 %\nFree cash flow -- TTM (1)\n$ \n50,149 \n$ \n52,973 \n$ \n47,747 \n$ \n38,219 \n$ \n25,925 \n$ \n18,184 \n (66) %\nCommon shares and stock-based awards outstanding\n \n10,788 \n \n10,871 \n \n10,872 \n \n10,876 \n \n10,876 \n \n10,952 \n 1 %\nCommon shares outstanding\n \n10,403 \n \n10,490 \n \n10,511 \n \n10,593 \n \n10,613 \n \n10,660 \n 2 %\nStock-based awards outstanding\n \n385 \n \n381 \n \n361 \n \n283 \n \n263 \n \n292 \n (23) %\nStock-based awards outstanding -- % of common shares outstanding\n 3.7 %\n 3.6 %\n 3.4 %\n 2.7 %\n 2.5 %\n 2.7 %\nN/A\nResults of Operations\nWorldwide (WW) net sales\n$ 143,313 \n$ 147,977 \n$ 158,877 \n$ 187,792 \n$ 155,667 \n$ 167,702 \n 13 %\nWW net sales -- Y/Y growth, excluding F/X\n 13 %\n 11 %\n 11 %\n 11 %\n 10 %\n 12 %\nN/A\nWW net sales -- TTM\n$ 590,740 \n$ 604,334 \n$ 620,128 \n$ 637,959 \n$ 650,313 \n$ 670,038 \n 11 %\nWW net sales -- TTM Y/Y growth, excluding F/X\n 12 %\n 12 %\n 12 %\n 11 %\n 11 %\n 11 %\nN/A\nOperating income\n$ \n15,307 \n$ \n14,672 \n$ \n17,411 \n$ \n21,203 \n$ \n18,405 \n$ \n19,171 \n 31 %\nF/X impact -- favorable\n$ \n72 \n$ \n29 \n$ \n16 \n$ \n14 \n$ \n53 \n$ \n153 \nN/A\nOperating income -- Y/Y growth, excluding F/X\n 219 %\n 91 %\n 55 %\n 60 %\n 20 %\n 30 %\nN/A\nOperating margin -- % of WW net sales\n 10.7 %\n 9.9 %\n 11.0 %\n 11.3 %\n 11.8 %\n 11.4 %\nN/A\nOperating income -- TTM\n$ \n47,385 \n$ \n54,376 \n$ \n60,599 \n$ \n68,593 \n$ \n71,691 \n$ \n76,190 \n 40 %\nOperating income -- TTM Y/Y growth, excluding F/X\n 252 %\n 205 %\n 129 %\n 86 %\n 51 %\n 40 %\nN/A\nOperating margin -- TTM % of WW net sales\n 8.0 %\n 9.0 %\n 9.8 %\n 10.8 %\n 11.0 %\n 11.4 %\nN/A\nNet income\n$ \n10,431 \n$ \n13,485 \n$ \n15,328 \n$ \n20,004 \n$ \n17,127 \n$ \n18,164 \n 35 %\nNet income per diluted share\n$ \n0.98 \n$ \n1.26 \n$ \n1.43 \n$ \n1.86 \n$ \n1.59 \n$ \n1.68 \n 33 %\nNet income -- TTM\n$ \n37,684 \n$ \n44,419 \n$ \n49,868 \n$ \n59,248 \n$ \n65,944 \n$ \n70,623 \n 59 %\nNet income per diluted share -- TTM\n$ \n3.56 \n$ \n4.18 \n$ \n4.67 \n$ \n5.53 \n$ \n6.13 \n$ \n6.55 \n 57 %\n______________________________\n(1)\nFree cash flow is cash flow from operations reduced by “Purchases of property and equipment, net of proceeds from sales and incentives.” \nAMAZON.COM, INC.\nSupplemental Financial Information and Business Metrics\n(in millions)\n(unaudited)\nQ1 2024\nQ2 2024\nQ3 2024\nQ4 2024\nQ1 2025\nQ2 2025\nY/Y %\nChange\nSegments\nNorth America Segment:\n  Net sales\n$ 86,341 \n$ 90,033 \n$ 95,537 \n$ 115,586 \n$ 92,887 \n$ 100,068 \n 11 %\n  Net sales -- Y/Y growth, excluding F/X\n 12 %\n 9 %\n 9 %\n 10 %\n 8 %\n 11 %\nN/A\n  Net sales -- TTM\n$ 362,288 \n$ 369,775 \n$ 377,425 \n$ 387,497 \n$ 394,043 \n$ 404,078 \n 9 %\n  Operating income\n$ 4,983 \n$ 5,065 \n$ 5,663 \n$ 9,256 \n$ 5,841 \n$ 7,517 \n 48 %\n  F/X impact -- favorable (unfavorable)\n$ \n8 \n$ \n8 \n$ \n(28) \n$ \n(49) \n$ \n(32) \n$ \n(46) \nN/A\n  Operating income -- Y/Y growth, excluding F/X\n 454 %\n 58 %\n 32 %\n 44 %\n 18 %\n 49 %\nN/A\n  Operating margin -- % of North America net sales\n 5.8 %\n 5.6 %\n 5.9 %\n 8.0 %\n 6.3 %\n 7.5 %\nN/A\n  Operating income -- TTM\n$ 18,962 \n$ 20,816 \n$ 22,172 \n$ 24,967 \n$ 25,825 \n$ 28,277 \n 36 %\n  Operating margin -- TTM % of North America net sales\n 5.2 %\n 5.6 %\n 5.9 %\n 6.4 %\n 6.6 %\n 7.0 %\nN/A\nInternational Segment:\n  Net sales\n$ 31,935 \n$ 31,663 \n$ 35,888 \n$ 43,420 \n$ 33,513 \n$ 36,761 \n 16 %\n  Net sales -- Y/Y growth, excluding F/X\n 11 %\n 10 %\n 12 %\n 9 %\n 8 %\n 11 %\nN/A\n  Net sales -- TTM\n$ 134,012 \n$ 135,978 \n$ 139,729 \n$ 142,906 \n$ 144,484 \n$ 149,582 \n 10 %\n  Operating income\n$ \n903 \n$ \n273 \n$ 1,301 \n$ 1,315 \n$ 1,017 \n$ 1,494 \n 448 %\n  F/X impact -- favorable (unfavorable)\n$ \n(3) \n$ \n(94) \n$ \n43 \n$ \n6 \n$ \n(56) \n$ \n338 \nN/A\n  Operating income -- Y/Y growth, excluding F/X\nN/A\nN/A\nN/A\nN/A\n 19 %\n 324 %\nN/A\n  Operating margin -- % of International net sales\n 2.8 %\n 0.9 %\n 3.6 %\n 3.0 %\n 3.0 %\n 4.1 %\nN/A\n  Operating income (loss) -- TTM\n$ \n(506) \n$ \n662 \n$ 2,058 \n$ 3,792 \n$ 3,906 \n$ 5,127 \n 674 %\n  Operating margin -- TTM % of International net sales\n (0.4) %\n 0.5 %\n 1.5 %\n 2.7 %\n 2.7 %\n 3.4 %\nN/A\nAWS Segment:\n  Net sales\n$ 25,037 \n$ 26,281 \n$ 27,452 \n$ 28,786 \n$ 29,267 \n$ 30,873 \n 17 %\n  Net sales -- Y/Y growth, excluding F/X\n 17 %\n 19 %\n 19 %\n 19 %\n 17 %\n 17 %\nN/A\n  Net sales -- TTM\n$ 94,440 \n$ 98,581 \n$ 102,974 \n$ 107,556 \n$ 111,786 \n$ 116,378 \n 18 %\n  Operating income\n$ 9,421 \n$ 9,334 \n$ 10,447 \n$ 10,632 \n$ 11,547 \n$ 10,160 \n 9 %\n  F/X impact -- favorable (unfavorable)\n$ \n67 \n$ \n115 \n$ \n1 \n$ \n57 \n$ \n141 \n$ \n(139) \nN/A\n  Operating income -- Y/Y growth, excluding F/X\n 83 %\n 72 %\n 50 %\n 48 %\n 21 %\n 10 %\nN/A\n  Operating margin -- % of AWS net sales\n 37.6 %\n 35.5 %\n 38.1 %\n 36.9 %\n 39.5 %\n 32.9 %\nN/A\n  Operating income -- TTM\n$ 28,929 \n$ 32,898 \n$ 36,369 \n$ 39,834 \n$ 41,960 \n$ 42,786 \n 30 %\n  Operating margin -- TTM % of AWS net sales\n 30.6 %\n 33.4 %\n 35.3 %\n 37.0 %\n 37.5 %\n 36.8 %\nN/A\nAMAZON.COM, INC.\nSupplemental Financial Information and Business Metrics\n(in millions, except employee data)\n(unaudited)\nQ1 2024\nQ2 2024\nQ3 2024\nQ4 2024\nQ1 2025\nQ2 2025\nY/Y %\nChange\nNet Sales\nOnline stores (1)\n$ 54,670 \n$ 55,392 \n$ 61,411 \n$ 75,556 \n$ 57,407 \n$ 61,485 \n 11 %\nOnline stores -- Y/Y growth, excluding F/X\n 7 %\n 6 %\n 8 %\n 8 %\n 6 %\n 10 %\nN/A\nPhysical stores (2)\n$ 5,202 \n$ 5,206 \n$ 5,228 \n$ 5,579 \n$ 5,533 \n$ 5,595 \n 7 %\nPhysical stores -- Y/Y growth, excluding F/X\n 6 %\n 4 %\n 5 %\n 8 %\n 6 %\n 7 %\nN/A\nThird-party seller services (3)\n$ 34,596 \n$ 36,201 \n$ 37,864 \n$ 47,485 \n$ 36,512 \n$ 40,348 \n 11 %\nThird-party seller services -- Y/Y growth, excluding F/X\n 16 %\n 13 %\n 10 %\n 9 %\n 7 %\n 10 %\nN/A\nAdvertising services (4)\n$ 11,824 \n$ 12,771 \n$ 14,331 \n$ 17,288 \n$ 13,921 \n$ 15,694 \n 23 %\nAdvertising services -- Y/Y growth, excluding F/X\n 24 %\n 20 %\n 19 %\n 18 %\n 19 %\n 22 %\nN/A\nSubscription services (5)\n$ 10,722 \n$ 10,866 \n$ 11,278 \n$ 11,508 \n$ 11,715 \n$ 12,208 \n 12 %\nSubscription services -- Y/Y growth, excluding F/X\n 11 %\n 11 %\n 11 %\n 10 %\n 11 %\n 11 %\nN/A\nAWS\n$ 25,037 \n$ 26,281 \n$ 27,452 \n$ 28,786 \n$ 29,267 \n$ 30,873 \n 17 %\nAWS -- Y/Y growth, excluding F/X\n 17 %\n 19 %\n 19 %\n 19 %\n 17 %\n 17 %\nN/A\nOther (6)\n$ 1,262 \n$ 1,260 \n$ 1,313 \n$ 1,590 \n$ 1,312 \n$ 1,499 \n 19 %\nOther -- Y/Y growth (decline), excluding F/X\n 23 %\n (6) %\n 5 %\n 17 %\n 4 %\n 18 %\nN/A\nStock-based Compensation Expense\nCost of sales\n$ \n174 \n$ \n266 \n$ \n193 \n$ \n205 \n$ \n148 \n$ \n250 \n (6) %\nFulfillment\n$ \n636 \n$ \n944 \n$ \n696 \n$ \n697 \n$ \n497 \n$ \n880 \n (7) %\nTechnology and infrastructure\n$ 2,772 \n$ 3,670 \n$ 2,961 \n$ 2,747 \n$ 2,060 \n$ 3,655 \n — %\nSales and marketing\n$ \n932 \n$ 1,224 \n$ 1,012 \n$ \n916 \n$ \n653 \n$ 1,207 \n (1) %\nGeneral and administrative\n$ \n447 \n$ \n618 \n$ \n471 \n$ \n430 \n$ \n331 \n$ \n542 \n (12) %\nTotal stock-based compensation expense\n$ 4,961 \n$ 6,722 \n$ 5,333 \n$ 4,995 \n$ 3,689 \n$ 6,534 \n (3) %\nOther\nWW shipping costs\n$ 21,834 \n$ 21,965 \n$ 23,501 \n$ 28,549 \n$ 22,495 \n$ 23,370 \n 6 %\nWW shipping costs -- Y/Y growth\n 10 %\n 8 %\n 8 %\n 4 %\n 3 %\n 6 %\nN/A\nWW paid units -- Y/Y growth (7)\n 12 %\n 11 %\n 12 %\n 11 %\n 8 %\n 12 %\nN/A\nWW seller unit mix -- % of WW paid units (7)\n 61 %\n 61 %\n 60 %\n 62 %\n 61 %\n 62 %\nN/A\nEmployees (full-time and part-time; excludes contractors & temporary personnel)\n 1,521,000 \n 1,532,000 \n 1,551,000 \n 1,556,000 \n 1,560,000 \n 1,546,000 \n 1 %\nEmployees (full-time and part-time; excludes contractors & temporary personnel) -- Y/Y \ngrowth\n 4 %\n 5 %\n 3 %\n 2 %\n 3 %\n 1 %\nN/A\n________________________\n(1)\nIncludes product sales and digital media content where we record revenue gross. We leverage our retail infrastructure to offer a wide selection of consumable and durable \ngoods that includes media products available in both a physical and digital format, such as books, videos, games, music, and software. These product sales include digital \nproducts sold on a transactional basis. Digital media content subscriptions that provide unlimited viewing or usage rights are included in “Subscription services.” \n(2)\nIncludes product sales where our customers physically select items in a store. Sales to customers who order goods online for delivery or pickup at our physical stores are \nincluded in “Online stores.” \n(3)\nIncludes commissions and any related fulfillment and shipping fees, and other third-party seller services. \n(4)\nIncludes sales of advertising services to sellers, vendors, publishers, authors, and others, through programs such as sponsored ads, display, and video advertising.\n(5)\nIncludes annual and monthly fees associated with Amazon Prime memberships, as well as digital video, audiobook, digital music, e-book, and other non-AWS subscription \nservices. \n(6)\nIncludes sales related to various other offerings (such as shipping services, healthcare services, and certain licensing and distribution of video content) and our co-branded \ncredit card agreements.\n(7)\nExcludes the impact of Whole Foods Market.\nAmazon.com, Inc.\nCertain Definitions\nCustomer Accounts\n•\nReferences to customers mean customer accounts established when a customer places an order through one of our \nstores. Customer accounts exclude certain customers, including customers associated with certain of our acquisitions, \nAmazon Payments customers, AWS customers, and the customers of select companies with whom we have a \ntechnology alliance or marketing and promotional relationship. Customers are considered active when they have \nplaced an order during the preceding twelve-month period.\nSeller Accounts\n•\nReferences to sellers means seller accounts, which are established when a seller receives an order from a customer \naccount. Sellers are considered active when they have received an order from a customer during the preceding twelve-\nmonth period.\nAWS Customers\n•\nReferences to AWS customers mean unique AWS customer accounts, which are unique customer account IDs that are \neligible to use AWS services. This includes AWS accounts in the AWS free tier. Multiple users accessing AWS \nservices via one account ID are counted as a single account. Customers are considered active when they have had \nAWS usage activity during the preceding one-month period.\nUnits\n•\nReferences to units mean physical and digital units sold (net of returns and cancellations) by us and sellers in our \nstores as well as Amazon-owned items sold in other stores. Units sold are paid units and do not include units \nassociated with AWS, certain acquisitions, certain subscriptions, rental businesses, or advertising businesses, or \nAmazon gift cards.\nContacts:\nAmazon Investor Relations\n \nAmazon Public Relations\namazon-ir@amazon.com\n \namazon-pr@amazon.com\namazon.com/ir\n \namazon.com/pr", "q_a": ""}, "content_hash": "bf6dca91994146318d6b694492c743467d7926cb3504aff476167b4693e05eb2", "transcript_name": "AMZN-Q2-2025-Earnings-Release.json"}