{"validated_at": "2025-12-02T07:59:07.735588", "input": {"call_type": "earnings", "summary_length": "long", "answer_format": "bullet", "filename": "AMZN-Q1-2025-Earnings-Release.pdf"}, "transcripts": {"presentation": "AMAZON.COM ANNOUNCES FIRST QUARTER RESULTS\nSEATTLE—(BUSINESS WIRE) May 1, 2025—Amazon.com, Inc. (NASDAQ: AMZN) today announced financial results for \nits first quarter ended March 31, 2025. \n•\nNet sales increased 9% to $155.7 billion in the first quarter, compared with $143.3 billion in first quarter 2024.\nExcluding the $1.4 billion unfavorable impact from year-over-year changes in foreign exchange rates throughout the\nquarter, net sales increased 10% compared with first quarter 2024.\n•\nNorth America segment sales increased 8% year-over-year to $92.9 billion.\n•\nInternational segment sales increased 5% year-over-year to $33.5 billion, or increased 8% excluding changes\nin foreign exchange rates.\n•\nAWS segment sales increased 17% year-over-year to $29.3 billion.\n•\nOperating income increased to $18.4 billion in the first quarter, compared with $15.3 billion in first quarter 2024.\n•\nNorth America segment operating income was $5.8 billion, compared with $5.0 billion in first quarter 2024.\n•\nInternational segment operating income was $1.0 billion, compared with $0.9 billion in first quarter 2024.\n•\nAWS segment operating income was $11.5 billion, compared with $9.4 billion in first quarter 2024.\n•\nNet income increased to $17.1 billion in the first quarter, or $1.59 per diluted share, compared with $10.4 billion, or\n$0.98 per diluted share, in first quarter 2024.\n•\nOperating cash flow increased 15% to $113.9 billion for the trailing twelve months, compared with $99.1 billion for\nthe trailing twelve months ended March 31, 2024.\n•\nFree cash flow decreased to $25.9 billion for the trailing twelve months, compared with $50.1 billion for the trailing\ntwelve months ended March 31, 2024.\n“We’re pleased with the start to 2025, especially our pace of innovation and progress in continuing to improve customer \nexperiences,” said Andy Jassy, President and CEO, Amazon. “From Alexa+ (our next generation of Alexa that’s meaningfully \nsmarter, more capable, and takes actions for customers), to another delivery speed record for our Prime members, to our new \nTrainium2 chips and Bedrock model expansion that make it easier for AWS customers to train models and run inference more \nflexibly and cost-effectively, to our first Project Kuiper satellites successfully launching into low earth orbit in our quest to \nprovide broadband access to hundreds of millions of households in rural areas without it today—we’re continuing to find \nmeaningful ways to make customers’ lives easier and better every day.”\nSome other highlights since the company’s last earnings announcement include that Amazon:\n•\nIntroduced Alexa+, our next-generation Alexa personal assistant who’s meaningfully smarter and more capable than\nher prior self, can both answer virtually any question and take actions, and is free with Prime.\n•\nHeld deal events worldwide to help customers save over $500 million across Big Spring Sale in the U.S. and Canada,\nSpring Deal Days in Europe, and Ramadan/Eid Sale events in Egypt, Saudi Arabia, Türkiye, and UAE.\n•\nAnnounced Amazon’s 11th Prime Day will be in July, when customers can expect millions of deals globally on vast\nselection.\n•\nAnnounced $4 billion investment through 2026 to expand Amazon’s rural delivery network to bring even faster\ndelivery to customers in less densely populated areas across the U.S.\n•\nLaunched Amazon.ie in Ireland, offering over 200 million products with low prices, fast delivery, and local Prime \nmembership.\n•\nExpanded selection with Michael Kors, GAME 7, The Ordinary, Laura Mercier, and tarte.\n•\nIntroduced Saks on Amazon, where customers can shop a refined luxury assortment of fashion and beauty items from \nbrands like Dolce&Gabbana, Balmain, Giambattista Valli, Erdem, and Fear of God. \n•\nLaunched ‘Interests’ to find products for customers’ passions and hobbies using generative AI.\n•\nIntroduced new ways to shop in the Amazon Shopping app to help customers discover and buy products from other \nbrands’ websites even when Amazon doesn’t carry the items directly. Amazon now shows customers select products \nfrom other brands in search results and either links to their websites so customers can purchase the items there or \nenables customers to seamlessly purchase the products using Amazon’s new ‘Buy for Me’ feature.\n•\nBegan full-scale deployment of Project Kuiper’s satellite internet network with launch and activation of first satellites. \n•\nBegan testing Zoox in Los Angeles, the sixth location for Amazon’s self-driving technology. \n•\nAnnounced a joint venture to create the next generation of the esteemed James Bond film franchise, including naming \nproducers Amy Pascal and David Heyman to produce the next film.\n•\nDrew 54.6 million viewers for Reacher’s Season 3 debut in first 19 days, Amazon’s biggest returning season ever. \n•\nPremiered Season 2 of LeBron James’s Mind the Game podcast, co-hosted by NBA Hall-of-Famer Steve Nash and \ndistributed by Wondery. \n•\nContinued to grow Amazon Nova rapidly with customers such as Slack, Siemens, Coinbase, Sumo Logic, FanDuel, \nBlue Origin, Glean, Domo, Stats Perform, Bynder, PDI Technologies, Gradial, ASAPP, ezCater, NinjaTech AI, \nJobcase, Rubbrband, Data Kinetic, Avahi, GuardianGamer, and Lennar, all starting to use Nova. Also introduced new \nNova capabilities, including:\n•\nAmazon Nova Sonic: Speech-to-speech foundation model for developers to build human-like voice-based AI \napplications, such as customer service call automation, AI agents, and more (available in Amazon Bedrock).\n•\nAmazon Nova Act SDK: New AI model trained to perform actions within a web browser, enabling \ndevelopers to build action-oriented agents by breaking down complex workflows into reliable atomic \ncommands (like “search,” or “checkout”).\n•\nAmazon Nova Premier: Most capable of Amazon’s multimodal models for complex tasks like coding, \nbuilding multi-step agents, and long-form document and video understanding.\n•\nGeneral availability of Amazon Nova models in Europe and Asia Pacific. \n•\nSigned new AWS agreements with Adobe, Uber, Nasdaq, Ericsson, Fujitsu, Cisco, Cargill, Mitsubishi Electric \nCorporation, General Dynamics Information Technology, GE Vernova, Booz Allen Hamilton, NextEra Energy, \nPublicis Sapient, Elastic, KPN, and Netsmart. \n•\nAnnounced new AWS offerings, including: \n•\nAWS Outposts racks (for high throughput, network-intensive workloads) and servers (for Cloud Radio \nAccess Network workloads) to help telecom customers build future-proof cloud infrastructure that supports \n5G and beyond.\n•\nNew foundation models in Amazon Bedrock, including Anthropic’s Claude 3.7 Sonnet, DeepSeek’s R1, \nMeta’s Llama 4 family of models, and Mistral AI’s Pixtral Large. \n•\nGeneral availability of Amazon SageMaker Unified Studio for data engineers to easily find and access data to \ncollaborate and build faster. \n•\nGeneral availability of the scenarios capability of Amazon Q in QuickSight, with an advanced AI agent to \nhelp customers leverage natural language to perform expert-level data analysis. \n•\nAnnounced Ocelot, Amazon’s first quantum computing chip prototype that reduces resources needed for quantum \nerror correction by up to 90%.\n•\nRanked No. 2 on LinkedIn’s U.S. Top Companies list of the best workplaces for career growth.\n•\nContinued making significant progress on safety—improving Amazon’s recordable incident rate by 34% and lost-time \nincident rate by 65% across operations over past five years. \nVisit aboutamazon.com/news/company-news/amazon-earnings-q1-2025-report.\nFinancial Guidance\nThe following forward-looking statements reflect Amazon.com’s expectations as of May 1, 2025, and are subject to substantial \nuncertainty. Our results are inherently unpredictable and may be materially affected by many factors, such as fluctuations in \nforeign exchange rates, changes in global economic and geopolitical conditions, tariff and trade policies, and customer demand \nand spending (including the impact of recessionary fears), inflation, interest rates, regional labor market constraints, world \nevents, the rate of growth of the internet, online commerce, cloud services, and new and emerging technologies, and the various \nfactors detailed below. \nSecond Quarter 2025 Guidance\n•\nNet sales are expected to be between $159.0 billion and $164.0 billion, or to grow between 7% and 11% compared \nwith second quarter 2024. This guidance anticipates an unfavorable impact of approximately 10 basis points from \nforeign exchange rates.  \n•\nOperating income is expected to be between $13.0 billion and $17.5 billion, compared with $14.7 billion in second \nquarter 2024.  \n•\nThis guidance assumes, among other things, that no additional business acquisitions, restructurings, or legal \nsettlements are concluded.\nConference Call Information\nA conference call will be webcast live today at 2:00 p.m. PT/5:00 p.m. ET, and will be available for at least three months at \namazon.com/ir. This call will contain forward-looking statements and other material information regarding the Company’s \nfinancial and operating results.\nForward-Looking Statements\nThese forward-looking statements are inherently difficult to predict. Actual results and outcomes could differ materially for a \nvariety of reasons, including, in addition to the factors discussed above, the amount that Amazon.com invests in new business \nopportunities and the timing of those investments, the mix of products and services sold to customers, the mix of net sales \nderived from products as compared with services, the extent to which we owe income or other taxes, competition, management \nof growth, potential fluctuations in operating results, international growth and expansion, the outcomes of claims, litigation, \ngovernment investigations, and other proceedings, fulfillment, sortation, delivery, and data center optimization, risks of \ninventory management, variability in demand, the degree to which the Company enters into, maintains, and develops \ncommercial agreements, proposed and completed acquisitions and strategic transactions, payments risks, and risks of \nfulfillment throughput and productivity. Other risks and uncertainties include, among others, risks related to new products, \nservices, and technologies, security incidents, system interruptions, government regulation and taxation, and fraud. In addition, \nglobal economic and geopolitical conditions and additional or unforeseen circumstances, developments, or events may give \nrise to or amplify many of these risks. More information about factors that potentially could affect Amazon.com’s financial \nresults is included in Amazon.com’s filings with the Securities and Exchange Commission (“SEC”), including its most recent \nAnnual Report on Form 10-K and subsequent filings.\nAdditional Information\nOur investor relations website is amazon.com/ir and we encourage investors to use it as a way of easily finding information \nabout us. We promptly make available on this website, free of charge, the reports that we file or furnish with the SEC, corporate \ngovernance information (including our Code of Business Conduct and Ethics), and select press releases, which may contain \nmaterial information about us, and you may subscribe to be notified of new information posted to this site.\nAbout Amazon\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to \noperational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best \nEmployer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, \nFulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, \nJust Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more \ninformation, visit amazon.com/about and follow @AmazonNews.\nAMAZON.COM, INC.\nConsolidated Statements of Cash Flows\n(in millions)\n(unaudited) \n  \nThree Months Ended\nMarch 31,\nTwelve Months Ended\nMarch 31,\n \n2024\n2025\n2024\n2025\nCASH, CASH EQUIVALENTS, AND RESTRICTED CASH, BEGINNING OF PERIOD\n$ \n73,890 \n$ \n82,312 \n$ \n49,734 \n$ \n73,332 \nOPERATING ACTIVITIES:\nNet income\n \n10,431 \n \n17,127 \n \n37,684 \n \n65,944 \nAdjustments to reconcile net income to net cash from operating activities:\nDepreciation and amortization of property and equipment and capitalized content costs, operating \nlease assets, and other\n \n11,684 \n \n14,262 \n \n49,224 \n \n55,373 \nStock-based compensation\n \n4,961 \n \n3,689 \n \n24,236 \n \n20,739 \nNon-operating expense (income), net\n \n2,734 \n \n(2,817)  \n1,452 \n \n(3,539) \nDeferred income taxes\n \n(938)  \n507 \n \n(6,342)  \n(3,203) \nChanges in operating assets and liabilities:\nInventories\n \n1,776 \n \n(1,222)  \n2,854 \n \n(4,882) \nAccounts receivable, net and other\n \n3,684 \n \n1,247 \n \n(9,388)  \n(5,686) \nOther assets\n \n(2,701)  \n(3,402)  \n(11,763)  \n(15,184) \nAccounts payable\n \n(11,282)  \n(9,043)  \n5,455 \n \n5,211 \nAccrued expenses and other\n \n(2,928)  \n(4,061)  \n407 \n \n(4,037) \nUnearned revenue\n \n1,568 \n \n728 \n \n5,328 \n \n3,167 \nNet cash provided by (used in) operating activities\n \n18,989 \n \n17,015 \n \n99,147 \n \n113,903 \nINVESTING ACTIVITIES:\nPurchases of property and equipment\n \n(14,925)  \n(25,019)  \n(53,447)  \n(93,093) \nProceeds from property and equipment sales and incentives\n \n990 \n \n764 \n \n4,449 \n \n5,115 \nAcquisitions, net of cash acquired, non-marketable investments, and other, net\n \n(3,354)  \n48 \n \n(5,680)  \n(3,680) \nSales and maturities of marketable securities\n \n1,392 \n \n7,737 \n \n5,904 \n \n22,748 \nPurchases of marketable securities\n \n(1,965)  \n(13,333)  \n(3,115)  \n(37,373) \nNet cash provided by (used in) investing activities\n \n(17,862)  \n(29,803)  \n(51,889)  \n(106,283) \nFINANCING ACTIVITIES:\nProceeds from short-term debt, and other\n \n338 \n \n1,815 \n \n5,687 \n \n6,619 \nRepayments of short-term debt, and other\n \n(404)  \n(2,082)  \n(22,478)  \n(6,738) \nProceeds from long-term debt\n \n— \n \n746 \n \n— \n \n746 \nRepayments of long-term debt\n \n(330)  \n— \n \n(2,620)  \n(8,852) \nPrincipal repayments of finance leases\n \n(770)  \n(410)  \n(3,774)  \n(1,683) \nPrincipal repayments of financing obligations\n \n(90)  \n(116)  \n(304)  \n(695) \nNet cash provided by (used in) financing activities\n \n(1,256)  \n(47)  \n(23,489)  \n(10,603) \nForeign currency effect on cash, cash equivalents, and restricted cash\n \n(429)  \n416 \n \n(171)  \n(456) \nNet increase (decrease) in cash, cash equivalents, and restricted cash\n \n(558)  \n(12,419)  \n23,598 \n \n(3,439) \nCASH, CASH EQUIVALENTS, AND RESTRICTED CASH, END OF PERIOD\n$ \n73,332 \n$ \n69,893 \n$ \n73,332 \n$ \n69,893 \nSUPPLEMENTAL CASH FLOW INFORMATION:\nCash paid for interest on debt, net of capitalized interest\n$ \n269 \n$ \n236 \n$ \n2,475 \n$ \n1,825 \nCash paid for operating leases\n \n3,332 \n \n3,562 \n \n11,318 \n \n12,571 \nCash paid for interest on finance leases\n \n74 \n \n71 \n \n301 \n \n284 \nCash paid for interest on financing obligations\n \n64 \n \n55 \n \n201 \n \n210 \nCash paid for income taxes, net of refunds\n \n458 \n \n877 \n \n11,018 \n \n12,727 \nAssets acquired under operating leases\n \n3,753 \n \n4,321 \n \n14,179 \n \n15,992 \nProperty and equipment acquired under finance leases, net of remeasurements and modifications\n \n42 \n \n54 \n \n676 \n \n866 \nIncrease (decrease) in property and equipment acquired but not yet paid\n \n411 \n \n3,108 \n \n801 \n \n9,736 \nAMAZON.COM, INC.\nConsolidated Statements of Operations\n(in millions, except per share data)\n(unaudited)\n  \nThree Months Ended\nMarch 31,\n2024\n2025\nNet product sales\n$ \n60,915 $ \n63,970 \nNet service sales\n \n82,398  \n91,697 \nTotal net sales\n \n143,313  \n155,667 \nOperating expenses:\nCost of sales\n \n72,633  \n76,976 \nFulfillment\n \n22,317  \n24,593 \nTechnology and infrastructure\n \n20,424  \n22,994 \nSales and marketing\n \n9,662  \n9,763 \nGeneral and administrative\n \n2,742  \n2,628 \nOther operating expense (income), net\n \n228  \n308 \nTotal operating expenses\n \n128,006  \n137,262 \nOperating income\n \n15,307  \n18,405 \nInterest income\n \n993  \n1,066 \nInterest expense\n \n(644)  \n(541) \nOther income (expense), net\n \n(2,673)  \n2,749 \nTotal non-operating income (expense)\n \n(2,324)  \n3,274 \nIncome before income taxes\n \n12,983  \n21,679 \nProvision for income taxes\n \n(2,467)  \n(4,553) \nEquity-method investment activity, net of tax\n \n(85)  \n1 \nNet income\n$ \n10,431 $ \n17,127 \nBasic earnings per share\n$ \n1.00 $ \n1.62 \nDiluted earnings per share\n$ \n0.98 $ \n1.59 \nWeighted-average shares used in computation of earnings per share:\nBasic\n \n10,393  \n10,603 \nDiluted\n \n10,670  \n10,793 \nAMAZON.COM, INC.\nConsolidated Statements of Comprehensive Income\n(in millions)\n(unaudited)\n  \nThree Months Ended\nMarch 31,\n \n2024\n2025\nNet income\n$ \n10,431 $ \n17,127 \nOther comprehensive income (loss):\nForeign currency translation adjustments, net of tax of $30 and $(66)\n \n(1,096)  \n1,535 \nAvailable-for-sale debt securities:\nChange in net unrealized gains (losses), net of tax of $(158) and $(11)\n \n536  \n37 \nLess: reclassification adjustment for losses (gains) included in “Other income \n(expense), net,” net of tax of $0 and $809\n \n1  \n(2,454) \nNet change\n \n537  \n(2,417) \nOther, net of tax of $(1) and $1\n \n1  \n2 \nTotal other comprehensive income (loss)\n \n(558)  \n(880) \nComprehensive income\n$ \n9,873 $ \n16,247 \nAMAZON.COM, INC.\nSegment Information\n(in millions)\n(unaudited) \n  \nThree Months Ended\nMarch 31,\n2024\n2025\nNorth America\nNet sales\n$ \n86,341 \n$ \n92,887 \nOperating expenses\n \n81,358 \n \n87,046 \nOperating income\n$ \n4,983 \n$ \n5,841 \nInternational\nNet sales\n$ \n31,935 \n$ \n33,513 \nOperating expenses\n \n31,032 \n \n32,496 \nOperating income\n$ \n903 \n$ \n1,017 \nAWS\nNet sales\n$ \n25,037 \n$ \n29,267 \nOperating expenses\n \n15,616 \n \n17,720 \nOperating income\n$ \n9,421 \n$ \n11,547 \nConsolidated\nNet sales\n$ 143,313 \n$ 155,667 \nOperating expenses\n \n128,006 \n \n137,262 \nOperating income\n \n15,307 \n \n18,405 \nTotal non-operating income (expense)\n \n(2,324) \n \n3,274 \nProvision for income taxes\n \n(2,467) \n \n(4,553) \nEquity-method investment activity, net of tax\n \n(85) \n \n1 \nNet income\n$ \n10,431 \n$ \n17,127 \nSegment Highlights:\nY/Y net sales growth:\nNorth America\n 12 %\n 8 %\nInternational\n 10 \n 5 \nAWS\n 17 \n 17 \nConsolidated\n 13 \n 9 \nNet sales mix:\nNorth America\n 60 %\n 60 %\nInternational\n 22 \n 21 \nAWS\n 18 \n 19 \nConsolidated\n 100 %\n 100 %\nAMAZON.COM, INC.\nConsolidated Balance Sheets\n(in millions, except per share data)\n (unaudited)\nDecember 31, 2024\nMarch 31, 2025\nASSETS\nCurrent assets:\nCash and cash equivalents\n$ \n78,779 $ \n66,207 \nMarketable securities\n \n22,423  \n28,358 \nInventories\n \n34,214  \n35,864 \nAccounts receivable, net and other\n \n55,451  \n54,216 \nTotal current assets\n \n190,867  \n184,645 \nProperty and equipment, net\n \n252,665  \n272,781 \nOperating leases\n \n76,141  \n78,495 \nGoodwill\n \n23,074  \n23,089 \nOther assets\n \n82,147  \n84,246 \nTotal assets\n$ \n624,894 $ \n643,256 \nLIABILITIES AND STOCKHOLDERS’ EQUITY\nCurrent liabilities:\nAccounts payable\n$ \n94,363 $ \n89,241 \nAccrued expenses and other\n \n66,965  \n66,331 \nUnearned revenue\n \n18,103  \n20,599 \nTotal current liabilities\n \n179,431  \n176,171 \nLong-term lease liabilities\n \n78,277  \n79,871 \nLong-term debt\n \n52,623  \n53,374 \nOther long-term liabilities\n \n28,593  \n27,973 \nCommitments and contingencies\nStockholders’ equity:\nPreferred stock ($0.01 par value; 500 shares authorized; no shares issued or \noutstanding)\n \n—  \n— \nCommon stock ($0.01 par value; 100,000 shares authorized; 11,108 and 11,128 \nshares issued; 10,593 and 10,613 shares outstanding)\n \n111  \n111 \nTreasury stock, at cost\n \n(7,837)  \n(7,837) \nAdditional paid-in capital\n \n120,864  \n124,514 \nAccumulated other comprehensive income (loss)\n \n(34)  \n(914) \nRetained earnings\n \n172,866  \n189,993 \nTotal stockholders’ equity\n \n285,970  \n305,867 \nTotal liabilities and stockholders’ equity\n$ \n624,894 $ \n643,256 \nAMAZON.COM, INC.\nSupplemental Financial Information and Business Metrics\n(in millions, except per share data)\n(unaudited)\nQ4 2023\nQ1 2024\nQ2 2024\nQ3 2024\nQ4 2024\nQ1 2025\nY/Y %\nChange\nCash Flows and Shares\nOperating cash flow -- trailing twelve months (TTM)\n$ \n84,946 \n$ \n99,147 \n$ 107,952 \n$ 112,706 \n$ 115,877 \n$ 113,903 \n 15 %\nOperating cash flow -- TTM Y/Y growth\n 82 %\n 82 %\n 75 %\n 57 %\n 36 %\n 15 %\nN/A\nPurchases of property and equipment, net of proceeds from sales and \nincentives -- TTM\n$ \n48,133 \n$ \n48,998 \n$ \n54,979 \n$ \n64,959 \n$ \n77,658 \n$ \n87,978 \n 80 %\nFree cash flow -- TTM (1)\n$ \n36,813 \n$ \n50,149 \n$ \n52,973 \n$ \n47,747 \n$ \n38,219 \n$ \n25,925 \n (48) %\nCommon shares and stock-based awards outstanding\n \n10,788 \n \n10,788 \n \n10,871 \n \n10,872 \n \n10,876 \n \n10,876 \n 1 %\nCommon shares outstanding\n \n10,383 \n \n10,403 \n \n10,490 \n \n10,511 \n \n10,593 \n \n10,613 \n 2 %\nStock-based awards outstanding\n \n406 \n \n385 \n \n381 \n \n361 \n \n283 \n \n263 \n (32) %\nStock-based awards outstanding -- % of common shares outstanding\n 3.9 %\n 3.7 %\n 3.6 %\n 3.4 %\n 2.7 %\n 2.5 %\nN/A\nResults of Operations\nWorldwide (WW) net sales\n$ 169,961 \n$ 143,313 \n$ 147,977 \n$ 158,877 \n$ 187,792 \n$ 155,667 \n 9 %\nWW net sales -- Y/Y growth, excluding F/X\n 13 %\n 13 %\n 11 %\n 11 %\n 11 %\n 10 %\nN/A\nWW net sales -- TTM\n$ 574,785 \n$ 590,740 \n$ 604,334 \n$ 620,128 \n$ 637,959 \n$ 650,313 \n 10 %\nWW net sales -- TTM Y/Y growth, excluding F/X\n 12 %\n 12 %\n 12 %\n 12 %\n 11 %\n 11 %\nN/A\nOperating income\n$ \n13,209 \n$ \n15,307 \n$ \n14,672 \n$ \n17,411 \n$ \n21,203 \n$ \n18,405 \n 20 %\nF/X impact -- favorable\n$ \n85 \n$ \n72 \n$ \n29 \n$ \n16 \n$ \n14 \n$ \n53 \nN/A\nOperating income -- Y/Y growth, excluding F/X\n 379 %\n 219 %\n 91 %\n 55 %\n 60 %\n 20 %\nN/A\nOperating margin -- % of WW net sales\n 7.8 %\n 10.7 %\n 9.9 %\n 11.0 %\n 11.3 %\n 11.8 %\nN/A\nOperating income -- TTM\n$ \n36,852 \n$ \n47,385 \n$ \n54,376 \n$ \n60,599 \n$ \n68,593 \n$ \n71,691 \n 51 %\nOperating income -- TTM Y/Y growth, excluding F/X\n 197 %\n 252 %\n 205 %\n 129 %\n 86 %\n 51 %\nN/A\nOperating margin -- TTM % of WW net sales\n 6.4 %\n 8.0 %\n 9.0 %\n 9.8 %\n 10.8 %\n 11.0 %\nN/A\nNet income\n$ \n10,624 \n$ \n10,431 \n$ \n13,485 \n$ \n15,328 \n$ \n20,004 \n$ \n17,127 \n 64 %\nNet income per diluted share\n$ \n1.00 \n$ \n0.98 \n$ \n1.26 \n$ \n1.43 \n$ \n1.86 \n$ \n1.59 \n 62 %\nNet income -- TTM\n$ \n30,425 \n$ \n37,684 \n$ \n44,419 \n$ \n49,868 \n$ \n59,248 \n$ \n65,944 \n 75 %\nNet income per diluted share -- TTM\n$ \n2.90 \n$ \n3.56 \n$ \n4.18 \n$ \n4.67 \n$ \n5.53 \n$ \n6.13 \n 72 %\n______________________________\n(1)\nFree cash flow is cash flow from operations reduced by “Purchases of property and equipment, net of proceeds from sales and incentives.” \nAMAZON.COM, INC.\nSupplemental Financial Information and Business Metrics\n(in millions)\n(unaudited)\nQ4 2023\nQ1 2024\nQ2 2024\nQ3 2024\nQ4 2024\nQ1 2025\nY/Y %\nChange\nSegments\nNorth America Segment:\n  Net sales\n$ 105,514 \n$ 86,341 \n$ 90,033 \n$ 95,537 \n$ 115,586 \n$ 92,887 \n 8 %\n  Net sales -- Y/Y growth, excluding F/X\n 13 %\n 12 %\n 9 %\n 9 %\n 10 %\n 8 %\nN/A\n  Net sales -- TTM\n$ 352,828 \n$ 362,288 \n$ 369,775 \n$ 377,425 \n$ 387,497 \n$ 394,043 \n 9 %\n  Operating income\n$ 6,461 \n$ 4,983 \n$ 5,065 \n$ 5,663 \n$ 9,256 \n$ 5,841 \n 17 %\n  F/X impact -- favorable (unfavorable)\n$ \n(13) \n$ \n8 \n$ \n8 \n$ \n(28) \n$ \n(49) \n$ \n(32) \nN/A\n  Operating income -- Y/Y growth, excluding F/X\nN/A\n 454 %\n 58 %\n 32 %\n 44 %\n 18 %\nN/A\n  Operating margin -- % of North America net sales\n 6.1 %\n 5.8 %\n 5.6 %\n 5.9 %\n 8.0 %\n 6.3 %\nN/A\n  Operating income -- TTM\n$ 14,877 \n$ 18,962 \n$ 20,816 \n$ 22,172 \n$ 24,967 \n$ 25,825 \n 36 %\n  Operating margin -- TTM % of North America net sales\n 4.2 %\n 5.2 %\n 5.6 %\n 5.9 %\n 6.4 %\n 6.6 %\nN/A\nInternational Segment:\n  Net sales\n$ 40,243 \n$ 31,935 \n$ 31,663 \n$ 35,888 \n$ 43,420 \n$ 33,513 \n 5 %\n  Net sales -- Y/Y growth, excluding F/X\n 13 %\n 11 %\n 10 %\n 12 %\n 9 %\n 8 %\nN/A\n  Net sales -- TTM\n$ 131,200 \n$ 134,012 \n$ 135,978 \n$ 139,729 \n$ 142,906 \n$ 144,484 \n 8 %\n  Operating income (loss)\n$ \n(419) \n$ \n903 \n$ \n273 \n$ 1,301 \n$ 1,315 \n$ 1,017 \n 13 %\n  F/X impact -- favorable (unfavorable)\n$ \n160 \n$ \n(3) \n$ \n(94) \n$ \n43 \n$ \n6 \n$ \n(56) \nN/A\n  Operating income (loss) -- Y/Y growth (decline), excluding F/X\n (74) %\nN/A\nN/A\nN/A\nN/A\n 19 %\nN/A\n  Operating margin -- % of International net sales\n (1.0) %\n 2.8 %\n 0.9 %\n 3.6 %\n 3.0 %\n 3.0 %\nN/A\n  Operating income (loss) -- TTM\n$ (2,656) \n$ \n(506) \n$ \n662 \n$ 2,058 \n$ 3,792 \n$ 3,906 \nN/A\n  Operating margin -- TTM % of International net sales\n (2.0) %\n (0.4) %\n 0.5 %\n 1.5 %\n 2.7 %\n 2.7 %\nN/A\nAWS Segment:\n  Net sales\n$ 24,204 \n$ 25,037 \n$ 26,281 \n$ 27,452 \n$ 28,786 \n$ 29,267 \n 17 %\n  Net sales -- Y/Y growth, excluding F/X\n 13 %\n 17 %\n 19 %\n 19 %\n 19 %\n 17 %\nN/A\n  Net sales -- TTM\n$ 90,757 \n$ 94,440 \n$ 98,581 \n$ 102,974 \n$ 107,556 \n$ 111,786 \n 18 %\n  Operating income\n$ 7,167 \n$ 9,421 \n$ 9,334 \n$ 10,447 \n$ 10,632 \n$ 11,547 \n 23 %\n  F/X impact -- favorable (unfavorable)\n$ \n(62) \n$ \n67 \n$ \n115 \n$ \n1 \n$ \n57 \n$ \n141 \nN/A\n  Operating income -- Y/Y growth, excluding F/X\n 39 %\n 83 %\n 72 %\n 50 %\n 48 %\n 21 %\nN/A\n  Operating margin -- % of AWS net sales\n 29.6 %\n 37.6 %\n 35.5 %\n 38.1 %\n 36.9 %\n 39.5 %\nN/A\n  Operating income -- TTM\n$ 24,631 \n$ 28,929 \n$ 32,898 \n$ 36,369 \n$ 39,834 \n$ 41,960 \n 45 %\n  Operating margin -- TTM % of AWS net sales\n 27.1 %\n 30.6 %\n 33.4 %\n 35.3 %\n 37.0 %\n 37.5 %\nN/A\nAMAZON.COM, INC.\nSupplemental Financial Information and Business Metrics\n(in millions, except employee data)\n(unaudited)\nQ4 2023\nQ1 2024\nQ2 2024\nQ3 2024\nQ4 2024\nQ1 2025\nY/Y %\nChange\nNet Sales\nOnline stores (1)\n$ 70,543 \n$ 54,670 \n$ 55,392 \n$ 61,411 \n$ 75,556 \n$ 57,407 \n 5 %\nOnline stores -- Y/Y growth, excluding F/X\n 8 %\n 7 %\n 6 %\n 8 %\n 8 %\n 6 %\nN/A\nPhysical stores (2)\n$ 5,152 \n$ 5,202 \n$ 5,206 \n$ 5,228 \n$ 5,579 \n$ 5,533 \n 6 %\nPhysical stores -- Y/Y growth, excluding F/X\n 4 %\n 6 %\n 4 %\n 5 %\n 8 %\n 6 %\nN/A\nThird-party seller services (3)\n$ 43,559 \n$ 34,596 \n$ 36,201 \n$ 37,864 \n$ 47,485 \n$ 36,512 \n 6 %\nThird-party seller services -- Y/Y growth, excluding F/X\n 19 %\n 16 %\n 13 %\n 10 %\n 9 %\n 7 %\nN/A\nAdvertising services (4)\n$ 14,654 \n$ 11,824 \n$ 12,771 \n$ 14,331 \n$ 17,288 \n$ 13,921 \n 18 %\nAdvertising services -- Y/Y growth, excluding F/X\n 26 %\n 24 %\n 20 %\n 19 %\n 18 %\n 19 %\nN/A\nSubscription services (5)\n$ 10,488 \n$ 10,722 \n$ 10,866 \n$ 11,278 \n$ 11,508 \n$ 11,715 \n 9 %\nSubscription services -- Y/Y growth, excluding F/X\n 13 %\n 11 %\n 11 %\n 11 %\n 10 %\n 11 %\nN/A\nAWS\n$ 24,204 \n$ 25,037 \n$ 26,281 \n$ 27,452 \n$ 28,786 \n$ 29,267 \n 17 %\nAWS -- Y/Y growth, excluding F/X\n 13 %\n 17 %\n 19 %\n 19 %\n 19 %\n 17 %\nN/A\nOther (6)\n$ 1,361 \n$ 1,262 \n$ 1,260 \n$ 1,313 \n$ 1,590 \n$ 1,312 \n 4 %\nOther -- Y/Y growth (decline), excluding F/X\n 8 %\n 23 %\n (6) %\n 5 %\n 17 %\n 4 %\nN/A\nStock-based Compensation Expense\nCost of sales\n$ \n227 \n$ \n174 \n$ \n266 \n$ \n193 \n$ \n205 \n$ \n148 \n (15) %\nFulfillment\n$ \n823 \n$ \n636 \n$ \n944 \n$ \n696 \n$ \n697 \n$ \n497 \n (22) %\nTechnology and infrastructure\n$ 3,533 \n$ 2,772 \n$ 3,670 \n$ 2,961 \n$ 2,747 \n$ 2,060 \n (26) %\nSales and marketing\n$ 1,216 \n$ \n932 \n$ 1,224 \n$ 1,012 \n$ \n916 \n$ \n653 \n (30) %\nGeneral and administrative\n$ \n520 \n$ \n447 \n$ \n618 \n$ \n471 \n$ \n430 \n$ \n331 \n (26) %\nTotal stock-based compensation expense\n$ 6,319 \n$ 4,961 \n$ 6,722 \n$ 5,333 \n$ 4,995 \n$ 3,689 \n (26) %\nOther\nWW shipping costs\n$ 27,326 \n$ 21,834 \n$ 21,965 \n$ 23,501 \n$ 28,549 \n$ 22,495 \n 3 %\nWW shipping costs -- Y/Y growth\n 11 %\n 10 %\n 8 %\n 8 %\n 4 %\n 3 %\nN/A\nWW paid units -- Y/Y growth (7)\n 12 %\n 12 %\n 11 %\n 12 %\n 11 %\n 8 %\nN/A\nWW seller unit mix -- % of WW paid units (7)\n 61 %\n 61 %\n 61 %\n 60 %\n 62 %\n 61 %\nN/A\nEmployees (full-time and part-time; excludes contractors & temporary personnel)\n 1,525,000 \n 1,521,000 \n 1,532,000 \n 1,551,000 \n 1,556,000 \n 1,560,000 \n 3 %\nEmployees (full-time and part-time; excludes contractors & temporary personnel) -- Y/Y \ngrowth (decline)\n (1) %\n 4 %\n 5 %\n 3 %\n 2 %\n 3 %\nN/A\n________________________\n(1)\nIncludes product sales and digital media content where we record revenue gross. We leverage our retail infrastructure to offer a wide selection of consumable and durable \ngoods that includes media products available in both a physical and digital format, such as books, videos, games, music, and software. These product sales include digital \nproducts sold on a transactional basis. Digital media content subscriptions that provide unlimited viewing or usage rights are included in “Subscription services.” \n(2)\nIncludes product sales where our customers physically select items in a store. Sales to customers who order goods online for delivery or pickup at our physical stores are \nincluded in “Online stores.” \n(3)\nIncludes commissions and any related fulfillment and shipping fees, and other third-party seller services. \n(4)\nIncludes sales of advertising services to sellers, vendors, publishers, authors, and others, through programs such as sponsored ads, display, and video advertising.\n(5)\nIncludes annual and monthly fees associated with Amazon Prime memberships, as well as digital video, audiobook, digital music, e-book, and other non-AWS subscription \nservices. \n(6)\nIncludes sales related to various other offerings (such as shipping services, healthcare services, and certain licensing and distribution of video content) and our co-branded \ncredit card agreements.\n(7)\nExcludes the impact of Whole Foods Market.\nAmazon.com, Inc.\nCertain Definitions\nCustomer Accounts\n•\nReferences to customers mean customer accounts established when a customer places an order through one of our \nstores. Customer accounts exclude certain customers, including customers associated with certain of our acquisitions, \nAmazon Payments customers, AWS customers, and the customers of select companies with whom we have a \ntechnology alliance or marketing and promotional relationship. Customers are considered active when they have \nplaced an order during the preceding twelve-month period.\nSeller Accounts\n•\nReferences to sellers means seller accounts, which are established when a seller receives an order from a customer \naccount. Sellers are considered active when they have received an order from a customer during the preceding twelve-\nmonth period.\nAWS Customers\n•\nReferences to AWS customers mean unique AWS customer accounts, which are unique customer account IDs that are \neligible to use AWS services. This includes AWS accounts in the AWS free tier. Multiple users accessing AWS \nservices via one account ID are counted as a single account. Customers are considered active when they have had \nAWS usage activity during the preceding one-month period.\nUnits\n•\nReferences to units mean physical and digital units sold (net of returns and cancellations) by us and sellers in our \nstores as well as Amazon-owned items sold in other stores. Units sold are paid units and do not include units \nassociated with AWS, certain acquisitions, certain subscriptions, rental businesses, or advertising businesses, or \nAmazon gift cards.\nContacts:\nAmazon Investor Relations\n \nAmazon Public Relations\namazon-ir@amazon.com\n \namazon-pr@amazon.com\namazon.com/ir\n \namazon.com/pr", "q_a": ""}, "content_hash": "e4854243bc5408db452c319d12aa2cad3c359ddacae4af64cc617cb9c92229cb", "transcript_name": "AMZN-Q1-2025-Earnings-Release.json"}