{"validated_at": "2025-08-30T14:22:20.529356", "input": {"call_type": "earnings", "summary_length": "long", "filename": "Atlassian Corporation, Q4 2025 Earnings Call, Aug 07, 2025 – Atlassian Corporation – BamSEC.pdf"}, "transcripts": {"presentation": "Atlassian Corporation, Q4 2025 Earnings Call,\nAug 07, 2025\nEdited Transcript of Atlassian Corporation Earnings Call Thursday, August 07, 2025 at 09:00:00PM GMT\nCorporate Participants\nJoseph L. Binz Atlassian Corporation – CFO & Principal Financial Officer\nMartin Lam Atlassian Corporation – Head of Investor Relations\nMichael Cannon-Brookes Atlassian Corporation – Co-Founder, CEO & Director\nConference Call Participants\nArjun Rohit Bhatia William Blair & Company L.L.C., Research Division – Partner, Co-Group Head of the\nTechnology, Media, and Communications Sector & Analyst\nArsenije Edward Matovic Wolfe Research, LLC – Research Analyst\nDavid E. Hynes Canaccord Genuity Corp., Research Division – Analyst\nGregg Steven Moskowitz Mizuho Securities USA LLC, Research Division – Managing Director of Americas\nResearch\nJason Vincent Celino KeyBanc Capital Markets Inc., Research Division – Director & Equity Research Analyst\nKarl Emil Keirstead UBS Investment Bank, Research Division – Analyst\nKasthuri Gopalan Rangan Goldman Sachs Group, Inc., Research Division – Head of Software Coverage\nKeith Weiss Morgan Stanley, Research Division – Equity Analyst\nMichael James Turrin Wells Fargo Securities, LLC, Research Division – Senior Equity Analyst\nUnknown Analyst\nPresentation\nOperator\nGood afternoon, and thank you for joining Atlassian's Earnings Conference Call for the Fourth Quarter of Fiscal\nYear 2025. As a reminder, this conference call is being recorded, and will be available for replay on the Investor\nRelations section of Atlassian's website following this call.\nI will now hand the call over to Martin Lam, Atlassian's Head of Investor Relations.\nMartin Lam Atlassian Corporation – Head of Investor Relations\n11/08/2025, 14:24\nAtlassian Corporation, Q4 2025 Earnings Call, Aug 07, 2025 – Atlassian Corporation – BamSEC\nhttps://www.bamsec.com/transcripts/742e1024-2d01-4cad-a575-9cf0abf7906e\n1/15\nWelcome to Atlassian's Fourth Quarter and Fiscal Year 2025 Earnings Call. Thank you for joining us today. On the\ncall today, we have Atlassian's CEO and Co-Founder, Mike Cannon-Brookes; and Chief Financial Officer, Joe Binz.\nEarlier today, we published a shareholder letter and press release with our financial results and commentary for\nour fourth quarter and fiscal year 2025. The shareholder letter is available on the Investor Relations section of\nour website, where you will also find our other earnings-related materials, including the earnings press release\nand supplemental investor data sheet.\nAs always, our shareholder letter contains management's insights and commentary for the quarter. So during the\ncall today, we'll have brief opening remarks and then focus our time on Q&A.\nThis call will include forward-looking statements. Forward-looking statements involve known and unknown risks,\nuncertainties and assumptions. If any such risks or uncertainties materialize or if any of the assumptions prove\nincorrect, our results could differ materially from the results expressed or implied by the forward-looking\nstatements we make. You should not rely upon forward-looking statements as predictions of future events.\nForward-looking statements represent our management's beliefs and assumptions only as of the date such\nstatements are made, and we undertake no obligation to update or revise such statements should they change\nor cease to be current.\nFurther information on these and other factors that could affect our business performance and financial results\nis included in filings we make with the Securities and Exchange Commission from time to time, including the\nsection titled Risk Factors in our most recently filed annual and quarterly reports.\nDuring today's call, we will also discuss non-GAAP financial measures. These non-GAAP financial measures are\nin addition to and are not a substitute for or superior to measures of financial performance prepared in\naccordance with GAAP. A reconciliation between GAAP and non-GAAP financial measures is available in our\nshareholder letter, earnings release and investor data sheet on the Investor Relations section of our website.\nWe'd like to allow as many of you to participate in Q&A as possible. Out of respect for others on the call, we will\ntake one question at a time.\nWith that, I'll turn the call over to Mike for opening remarks.\nMichael Cannon-Brookes Atlassian Corporation – Co-Founder, CEO & Director\nThanks, Martin, and thank you all for joining us today. As you've already read in our shareholder letter, we closed\nout FY '25 with stellar execution from our enterprise sales teams and partner teams. In FY '25, we generated over\n$5.2 billion in revenue and over $1.4 billion in free cash flow, delivering another year of balanced Rule of 40 plus\nperformance. All up, our teamwork platform powers workflows at over 300,000 customers like Infosys, IAG,\nWoolworths, Globant and Honeywell.\nWe see a real sense of momentum coming out of Q4 as we signed a record number of deals greater than $1\nmillion in ACV in the quarter, up over 2x year-on-year. We reached 2.3 million AI now, up 50% from last quarter.\nAnd in less than a full quarter since its launch of Team '25, the Teamwork Collection has seen incredibly strong\nmomentum and is exceeding our expectations.\nWe are making significant progress on our key strategic priorities of serving the enterprise, delivering game\nhedging innovation in AI to our customers and connecting all teams through the Atlassian system of work. These\nbig bets are paying off, resulting in a cloud net revenue retention rate of 120%. To further accelerate our progress,\nwe are partnering with Google Cloud to bring our AI-powered Teamwork platform together with Google Cloud's AI\noptimized infrastructure. This partnership marks a major milestone in Atlassian's multi-cloud strategy,\naccelerating our cloud transformation and delivering advanced AI solutions to millions more users worldwide.\n11/08/2025, 14:24\nAtlassian Corporation, Q4 2025 Earnings Call, Aug 07, 2025 – Atlassian Corporation – BamSEC\nhttps://www.bamsec.com/transcripts/742e1024-2d01-4cad-a575-9cf0abf7906e\n2/15\nIn the AI-era, we believe the need for collaboration increases significantly as more people are able to create and\nmore ideas can be brought to life. This creates a huge opportunity for Atlassian. Our platform powers teamwork,\nbusiness processes and workflows across all types of teams, but now 50% of users of our core apps being\nbusiness users, reinforcing the mission-critical role that our platform plays and helping both businesses and\ntechnology teams collaborate. If you'd like to hear more about how this sets us up to win in the AI-era, check out\nthe Loom that I just posted to our IR website.\nThis quarter, we saw more enterprises realize the power of going wall to wall with the Atlassian system of work,\nwith many of them consolidating from a variety of other tools onto the Atlassian Cloud platform. The result with\ncontinued revenue growth across our core apps of Jira, Confluence, Jira Service Management and Loom, all of\nwhich are growing in line or faster than total company revenue with significant runway ahead of all.\nAs we forge ahead into FY '26, we're bringing a new level of intensity to our pursuit of the massive market\nopportunities in front of us. We're playing offense and relentlessly innovating in order to further strengthen our\ncompetitive position, delivering differentiated customer experiences and value and making Atlassian\nSystem of Work for the Fortune 500,000 and beyond.\nAlso this quarter, we're announcing that Anu has decided to transition away from her role as Atlassian President\nat the end of December after almost 12 years. While we're very saddened to see her leave, we're incredibly\ngrateful for all of her impact, like everything we do, we're long term in our thinking and are thoughtful always in\nour plans. Anu's greatest legacy is the talented team of leaders that she has built and developed and we'll have\nmore updates on leadership transitions soon.\nAnd before anyone on the call asks, I'm not going anywhere, so you're going to have to put up with me for many\nmore years. I love my job, and this is the most exciting time to be at Atlassian. We're creating amazing products\nand capabilities, which are delighting our customers like never before. We have a fantastic tailwind from new AI\ntechnologies, and it's incredible to see our vision resonating with our 3 major transformations of AI, enterprise\nand system of work, all bearing fruit and multiplying together.\nWith that, I'll pass the call to the operator for Q&A.", "q_a": "Questions and Answers\nOperator\n[Operator Instructions] Your first question comes from Keith Weiss from Morgan Stanley.\nKeith Weiss Morgan Stanley, Research Division – Equity Analyst\nCongratulations on a really strong end to the year. Mike, reading the shareholder letter and kind of listening to\nwhat you've been describing going on Atlassian, is a little bit of an odd that we hear in the marketplace, frankly.\nThere's a lot of concern around cogeneration tools and the changing role of a developer, which you seem to see\nas a positive versus the market seeing as more of a negative.\nMaybe you can walk us through what you guys are seeing in the business today in terms of seed expansion with\ndevelopers or more broadly? And what do you think is going to transpire on a go-forward basis in terms of how\nthese innovations are going to affect that core business from Atlassian going forward?\n11/08/2025, 14:24\nAtlassian Corporation, Q4 2025 Earnings Call, Aug 07, 2025 – Atlassian Corporation – BamSEC\nhttps://www.bamsec.com/transcripts/742e1024-2d01-4cad-a575-9cf0abf7906e\n3/15\nMichael Cannon-Brookes Atlassian Corporation – Co-Founder, CEO & Director\nSure, Keith. Good to hear from you. Let me just start by saying we're not seeing any impact from this on any\nnumbers that we have. So expansion rates, growth rates, adoption rates of our technical products. And again, the\ntechnology teams and the software business is a part of our business alongside service strategy and broad\ncollaboration. But we're not seeing any impact from it. So we're being very clear about that. When customers\nintegrate code-generating AI tools, there's no change in their usage of our products, and we continue to see really\nhealthy user growth.\nIn fact, we even have some early data that shows that when people do connect cogeneration tools, the business\nusers in those geo instances is actually growing faster than they are for the customers that don't have those\nconnected, right, demonstrating, we think, Jira continue to be the center gravity in how work gets done.\nI think you kind of have to look at a high level. Let me give you some assumptions that I have or some beliefs. Do\nI think there will be far less developers in the world 5 years from now? No, I don't think so. I think there'll be far\nmore and far more people creating software in other functions, right, whether they're in finance or HR or\nmarketing, there's going to be a lot more people creating software.\nDo I think developers roles change and augment with these tools? Yes. Develops as use of that. This is a big\nchange. It's super productive. We see that internally, but there's still a lot of -- awful lot of work to do, right?\nDo I think more people will be creating software? Yes. Do I think more software will be made in the world? Yes, I\nthink there'll be far more software and technology made that they need to be managed, right? Far more people\ncreating software and far more technology significantly expands our opportunity.\nSoftware creation is becoming more efficient. Cost of software building going down. This is all really good for\nAtlassian and our workflow tools. Again, in that software teams and technology teams world that we sit in. It\nalso shows the moment Jira's criticality to a lot of those workflows and processes. If you look internally, for\nexample, we're pretty world-class at using AI co-generating tools, right? We have Rovo Dev, which sits on top of\nSWE-bench, full bench -- benchmark time at the moment. We use a whole series of other cogeneration tools. We\nhave 3 or 4 in operation with over 1,000 now each work, lets us create software faster, let's just create better\nsoftware and let's just create more software.\nAnd yes, we're still hiring full lot of engineers and developers with the growth of the business. So I just want to be\nclear that we are not seeing that in our numbers. We don't believe in that in terms of our collaboration things --\ncollaboration products. Again, Atlassian is here to solve people problems, not technology problems. There will be\ncollaboration, there will be projects, there will be teamwork, and we see AI as a huge tailwind for the business.\nAnd I think we're putting up a lot of numbers that show that very strongly.\nOperator\nYour next question comes from Alex Mulan from Jefferies.\nUnknown Analyst\nThis is Alex Mulan from Jefferies for Brent Thill. I want to touch on the free cash flow number. So this year, the\nnumber came in broadly flat versus last year around $1.5 billion. How should we think about the trajectory for\nfree cash flow in 2026? And then I have a follow-up.\nJoseph L. Binz Atlassian Corporation – CFO & Principal Financial Officer\n11/08/2025, 14:24\nAtlassian Corporation, Q4 2025 Earnings Call, Aug 07, 2025 – Atlassian Corporation – BamSEC\nhttps://www.bamsec.com/transcripts/742e1024-2d01-4cad-a575-9cf0abf7906e\n4/15\nYes, this is Joe. Thanks for the question. So free cash flow in the quarter was $360 million, that was down 13%\nyear-over-year. And just a reminder for everyone, that was driven primarily by strong collections in the prior year\nrelated to the server and the support dynamics. Overall, free cash flow came in online with our expectations\nentering the quarter. There are some temporal headwinds in the short term as we transition multiyear\nagreements from upfront to annual billing terms, and we have more backloaded sales in the quarter as a natural\nresult of growing our enterprise cloud business. Accounting for those 2 factors, cash flow in the quarter reflected\nthe strong performance we delivered in the quarter.\nIn terms of modeling long term or over the future, we continue to expect our cash flow will correlate to our non-\nGAAP operating income trends. And any such differences in the short term are driven by timing differences\nbetween accounting and cash flow, such as what you typically see with the employee bonus payout we do in Q1.\nIn relation to non-GAAP operating margin, we expect about a 500 basis point difference over time between non-\nGAAP operating margin and free cash flow margin. But again, that may vary plus or minus quarter-to-quarter and\nyear-to-year for various timing reasons, but that remains our expectation for FY '26 and moving forward. Hope\nthat helps.\nOperator\nYour next question comes from Kash Rangan from Goldman Sachs.\nKasthuri Gopalan Rangan Goldman Sachs Group, Inc., Research Division – Head of\nSoftware Coverage\nI will not ask you the AI taking away developer and support jobs question because I've asked and I think we all\nkind of know, but the answer is, it's not happening, but that's what's happening in the market, at least Wall Street.\nI think any reasonable individual will look at these tech cycles and say every time there is a change in the tech\ncycle on-prem to Cloud, Cloud to AI, whatever it is, number of software related jobs just keeps growing\nexponentially.\nSo maybe you'll keep reinforcing the message at some point, the market will believe it. So we're on the same\npage with you. But my question is more to do with the progression of numbers. We really came off a big\ntransition year tough comparisons since admirable that growth rate that you put up is very solid. But going into\nfiscal '26 and looking at '27, it does look like if you are to maintain your longer-term growth guidance, there's a\nsort of implied acceleration setup in fiscal '27.\nSo Mike and Jim, just wanted to have you talk through what are the things that are potential inflection points in\nthe business? How do you go about achieving them? Is it more of a go-to-market tweak, more enterprise flex,\nmore of a transition from the server and data center base to the Cloud. What are the levers that you think you\nhave at your hand that you could help to put forth that accelerating revenue growth that the numbers seem to\nimply in fiscal '27 from fiscal '26?\nJoseph L. Binz Atlassian Corporation – CFO & Principal Financial Officer\nYes. Thanks, Kash. This is Joe. Great question, and I'll start and then pass it to Mike for more detail. So the first\npoint I'd make is we have not changed our approach from last year with respect to our guidance for Q1 and FY\n'26. As we discussed last quarter, our guidance approach for FY '26 is consistent with the approach we took in\nFY '25, which is we are taking what I believe to be a conservative and risk-adjusted approach to account for\nmacroeconomic uncertainty and potential business disruption from the evolution of our enterprise go-to-market\nsales motion because we believe those risks are still very relevant to the current operating environment.\n11/08/2025, 14:24\nAtlassian Corporation, Q4 2025 Earnings Call, Aug 07, 2025 – Atlassian Corporation – BamSEC\nhttps://www.bamsec.com/transcripts/742e1024-2d01-4cad-a575-9cf0abf7906e\n5/15\nIn addition, I'd say there's no change to our outlook that we will be able to deliver 20% compounded annual\ngrowth from FY '24 through FY '27. And we believe with 20% growth in FY '25, we have laid a strong foundation\nfor achieving that and are on track to that goal. Our confidence in that remains rooted in the significant market\nopportunities we have in front of us. Our strategy to capture them through our investments in Enterprise AI and\nSystem of Work. And the strong momentum we've built around those strategies, as Mike laid out in the\nshareholder letter and in his opening comments.\nWe have multiple levers of growth from paid seat expansion to cross-sell, upsell, pricing and new customer\ngrowth. And AI opens the aperture for even more opportunity given the structural position we have with our cloud\nplatform and Teamwork Graph and deep investment in R&D. So taken together, the guidance approach and the\nopportunity for growth that we have, there's no change to the 3-year outlook we provided at our Investor Day last\nyear, and we remain very optimistic about our ability to grow at a very healthy rate over a sustained period of\ntime.\nMichael Cannon-Brookes Atlassian Corporation – Co-Founder, CEO & Director\nYes. Kash, just to follow on from what Joe said. Firstly, I agree with you on the first part of your comment. Thank\nyou for saying that. Look, I just want to reiterate from my point of view, firstly, the commitment to those long-term\ntargets, double down on what Joe said. We feel incredibly confident in them. Hopefully, our FY '25 gives\ncredibility to the fact that we can achieve those, and we feel increasingly confident in our ability to deliver on\nwhat we've laid out, both on the revenue growth side and on the margins side. I will say one of the things I want\nto point out, Teamwork Collection was very strong. So as Joe pointed out, we have a whole multitude of different\ngrowth vectors that are going strongly. We've long had a portfolio of different growth happening.\nOne of the new elements there is obviously, Teamwork Collection. It's been in the market for 3 months, and we\nhad a very strong first 3 months given where we landed. We feel incredibly strongly about that, that it's almost at\nthe apex of our 3 different transformations. So both the Enterprise AI and that System of Work shows great\nstrength, right? We had one of the world's largest automotive manufacturers, bought Teamwork Collection in the\nquarter, high tens of thousands of users in combination with strategy collection and going wall-to-wall and\nTeamwork Collection to standardize on Atlassian for all teamwork delivery goals.\nAnd they mentioned AI being deeply integrated as one of their core reasons for moving. So it's showing all 3 of\nthose working together. We had another in the world's -- one of the world's leading chip companies, the\ncompanies that are powering the AI revolution that we're all benefiting for, again, in the tens of thousands of\nusers migrating to improve scalability, collaboration and governance from on-prem in that case to -- from Data\nCenter to the Cloud. That was a big consolidation story for us moving off a bunch of different tools onto the\nAtlassian Cloud platform. Lots of work needed to be done there. But again, mentioning AI and integrations with\nall of the third parties and Rovo search and Rovo chat specifically as large-scale reasons for moving.\nSo we have endless customer examples of this in the first quarter already. And a real deep belief at all 3 of the\ntransformations that we're investing deeply and are really driving that durable growth that we can deliver on.\nOperator\nYour next question comes from Michael Turrin from Wells Fargo.\nMichael James Turrin Wells Fargo Securities, LLC, Research Division – Senior\nEquity Analyst\n11/08/2025, 14:24\nAtlassian Corporation, Q4 2025 Earnings Call, Aug 07, 2025 – Atlassian Corporation – BamSEC\nhttps://www.bamsec.com/transcripts/742e1024-2d01-4cad-a575-9cf0abf7906e\n6/15\nCongrats on the end of the fiscal year. Joe, just building on some of those prior comments. I was hoping you\ncould expand a bit more around the framework you're using in fiscal '26 in the Enterprise go-to-market language.\nAnd really what I'm wondering is -- maybe you could compare and contrast how fiscal '25 closed for us relative to\nsome of the execution risk you're embedding? It looks like the RPO and bookings numbers we're looking at are\ncertainly supportive of some of the large deal commentary throughout the letter, but it would be just useful to get\nyour perspective there just in how the year closed maybe relative to what you're forecasting and compare that\nwith the initial guide for '26?\nJoseph L. Binz Atlassian Corporation – CFO & Principal Financial Officer\nYes. Great question. Thanks for the question. So overall, we had great execution from our sales team and\npartners, which drove a very strong underlying bookings and billings results this quarter, as you pointed out. Mike\nhighlighted a lot of these things in his opening remarks from the record number of deals with over $1 million to\nData Center to Cloud migrations being up 60% year-over-year to the strong momentum we had in Teamwork\nCollection.\nAll of that culminated in the RPO balance increasing to $3.3 billion. That's up 38% year-over-year. Roughly 74% of\nthat balance will be recognized in revenue in the next 12 months, and that's up 29% year-over-year. And the\nremaining portion is increased 71%, and that's on the strength of large cloud multiyear agreements signed in the\nquarter, which is a great sign of customer commitment and confidence in our platform and our road map.\nSo overall, a very strong quarter of progress and execution in the enterprise portion of our business, which drove\nthe bookings and billings performance you see in the results.\nNow if you go down to revenue, that was also better than our expectations. As you saw in the numbers, we had\noutperformance on Cloud and marketplace and in-line performance on Data Center. On Cloud revenue guidance\ncoming into the quarter, we'd assume some negative impact on paid seat expansion rates and cloud migrations\nfrom macro uncertainty and our Enterprise go-to-market evolution. And to your point, neither one of those were\nfully materialized. We continue to benefit from relatively stable macro and business trends from the quarter. In\nterms of our Cloud performance in Q4, paid seat expansion, cross-sell and migrations were the primary drivers of\nthe better-than-expected results with in-line performance across the other Cloud drivers.\nNotably, the rate of paid seat expansion in SMB and enterprise continued to demonstrate quarter-to-quarter\nstability. In Data Center revenue was in line with our guidance with growth driven by pricing, and that was\npartially offset by strong migrations to cloud. Data Center growth also benefited from the renewal of several\nlarge customer agreements in the quarter.\nAnd then in marketplace, just to wrap it up. The outperformance was driven primarily by third-party app sales\nfrom Data Center.\nAnd then finally, I'd also highlight that we saw steady performance broadly across products, customer segments\nand regions. So all in all, Michael, really solid quarter overall, and we feel really good about how we ended the\nfiscal year.\nOperator\nYour next question comes from Alex Zukin from Wolfe Research.\nArsenije Edward Matovic Wolfe Research, LLC – Research Analyst\n11/08/2025, 14:24\nAtlassian Corporation, Q4 2025 Earnings Call, Aug 07, 2025 – Atlassian Corporation – BamSEC\nhttps://www.bamsec.com/transcripts/742e1024-2d01-4cad-a575-9cf0abf7906e\n7/15\nThis is Arsenije on for Alex Zukin. Mike, it's great to see the strong early traction with the Teamwork Collection.\nGiven that momentum and the increased velocity shown this year in continued R&D focus next year, can we\nexpect to see more AI capabilities or new feature launches within the collection this year to further kind of drive\nthat momentum there? And then, Joe, could you just help us understand the mid-single-digit migration\ncontribution in the Cloud guidance? You had the same expectation set last year despite the go-to-market\ntransition starting into the year. How did that migration growth contribution to the full year Cloud growth this year\npan out? And just help us understand the conservatism on the mid-single-digit migration contribution and\nguidance for FY '26?\nMichael Cannon-Brookes Atlassian Corporation – Co-Founder, CEO & Director\nI can take the first half of that. Look, I'll say very clearly, I think AI is one of the best things that ever happened to\nAtlassian, right? We're in the knowledge work business, we're in the teamwork business. The System of Work is\nall about connecting business and technology teams, helping our customers achieve their missions, and it cuts a\nhuge tailwind for Atlassian, right? It's really, really fantastic.\nYou asked if you'll see new capabilities? I hope if you look over the last 12 and then 24 months, you've seen us\ncontinuing to innovate and ship new capabilities. So I think you can probably take that one to the bank, that there\nwill be new capability shipping in the year ahead. I can tell you that those new capabilities are going to be pretty\nfantastic, right? We're building some really amazing stuff, and it's generating results for us.\nSo you can hopefully see that in everything from our net expansion rate of 120%. Teamwork Collection continue\nto exceed expectations in many of the customers purchasing it, mentioning AI is one of the reasons. And not just\nhaving AI features, but fundamentally putting them into the core of our cloud platform, right? Our platform\ninvestment over the last 10 years has enabled us to have that Teamwork Graph at the core, the AI at the core,\nwhich is giving really differentiated capabilities that people are noticing. As I said, we've reached 2.3 million AI\nnow. I think we were 1.5 million last quarter. So strong quarter-on-quarter growth there. So you can certainly see\nthat we are continuing to ship new improvements. You saw everything from the Rovo Dev CLI in the last quarter.\nMCP servers in beta and working with Anthropic. We continue to work with OpenAI on GPT-5 and other things\nthat just launched.\nSo we have some really, really fantastic capabilities continuing to come through that are being demonstrated in\nour results. We have a lot of stats that show that this makes a difference. So for example, in Confluence, users\nwho use our editor AI creates 15% more pages and make 33% more edits than before. So it's showing that AI\ncapabilities drive further collaboration, further creation and further growth, right? And some of those stats are up\nsignificantly.\nSimilarly, you'll know that we always focus on usage. Now it's very important to us. We want our software to be\nused to deliver its value. One of the ways to look at usage in terms of AI is things like token usage, right? And our\ntoken usage is up 5x quarter-on-quarter. So we are really getting customers to use our AI technologies. We talk\nabout not marketing AI but shipping it. I believe it's a huge tailwind to us. Obviously, when we invest a lot in R&D,\nwe have a fantastic world-class engineering team. We have a fantastic platform. Teamwork Graph continues to\ngrow in size as well as breadth and depth.\nSo we feel like we have a real tailwind from AI, and we're really starting to deliver those results. We will certainly\nhave more exciting things ahead.\nI do want to reiterate that it is about AI, the system of work and the enterprise transformation multiplying\ntogether, right, which gives us that confidence in the long-term sustained growth and targets that we've given out.\nJoe, you can answer the second question there.\n11/08/2025, 14:24\nAtlassian Corporation, Q4 2025 Earnings Call, Aug 07, 2025 – Atlassian Corporation – BamSEC\nhttps://www.bamsec.com/transcripts/742e1024-2d01-4cad-a575-9cf0abf7906e\n8/15\nJoseph L. Binz Atlassian Corporation – CFO & Principal Financial Officer\nYou bet. Thanks, Mike. So really no change in terms of our outlook for migrations. We had a great Q4 on the\nmigration front. Thanks to the excellent execution from our sales team that I talked about earlier. Capped off a\ngreat year. I mentioned the very strong Data Center to Cloud migrations that we saw. So FY '25, a really excellent\noutcome. We believe there are 2 primary drivers behind these results. First are the investments we've been\nmaking to drive deployment and usage such as in our customer success team and in forward deployed\nengineering programs like Fast shift. And second, investments in R&D that continue to add differentiated value to\nour Cloud platform and apps through things like automation, analytics and AI, which makes the move to cloud\nmore and more compelling over time.\nAltogether, that resulted in a contribution to Cloud revenue growth for FY '25 in the mid- to high single-digit range,\nwhich was also driven in part by the benefit of migrations related to server and to support in the prior year.\nNow going forward, we continue to believe the remaining customers on data center will take time to migrate to\ncloud and so that's some of the conservatism in our estimate. And the reason for that is the complexity of these\nmigrations. Our remaining Data Center customers are some of our largest customers with the most complex\nenvironments to migrate, very different from the one to 2-day migrations for our smaller customers.\nFurther, many of these customers when they do migrate do so taking a hybrid approach over time. So there's\ngoing to be variability in the pace of these migrations quarter-to-quarter, and they will take time to move. Overall,\nhowever, our customers have been clear that their ultimate destination is in the cloud because it is the best and\nmost secure experience, and it's where all of our R&D and product innovation is pointed.\nSo as I mentioned, for FY '25, migrations made a mid- to high single-digit contribution to cloud revenue growth.\nYou mentioned appropriately our guidance for FY '26 assumes a sequentially lower contribution to cloud revenue\ngrowth from migrations in the mid- to single-digit range. Some of that is the overall macro and go-to-market\nevolution risk that I highlighted in my first answer. Some of that is the dynamics that I just walked through in\nterms of migration -- the complexity around Data Center migrations.\nI would point out longer term, given the size of the Data Center installed base, the growing value of our Cloud\noffering and customer intentions to migrate to the Cloud. We continue to expect migrations to make a mid- to\nhigh single-digit contribution to Cloud revenue growth over the next 2 to 3 years. So I hope that guidance helps.\nOperator\nYour next question comes from Arjun Bhatia from William Blair.\nArjun Rohit Bhatia William Blair & Company L.L.C., Research Division – Partner, Co-\nGroup Head of the Technology, Media, and Communications Sector & Analyst\nI have a question on Enterprise. Obviously, it seems like Q4 was very strong. You called out a $1 million plus ACV\ndeals. As you look at 2026, I know you have Brian on board, but I'm curious how you are thinking about go-to-\nmarket and what you're changing to continue in Enterprise acceleration? Is that something that we should expect\nto be sort of done in '26? Or is this more of a multiyear journey that maybe leads into fiscal '27 as well?\nMichael Cannon-Brookes Atlassian Corporation – Co-Founder, CEO & Director\nArjun, I can take that one. Look, we have a really great enterprise business already. I'd like to start there.\nEnterprise is a little bit one of those things that we're always going to do next year. We have hundreds of\n11/08/2025, 14:24\nAtlassian Corporation, Q4 2025 Earnings Call, Aug 07, 2025 – Atlassian Corporation – BamSEC\nhttps://www.bamsec.com/transcripts/742e1024-2d01-4cad-a575-9cf0abf7906e\n9/15\ncustomers north of $1 million in run rate. As you saw, we had a fantastic quarter for million-dollar deals. So we\nhave a really robust enterprise business already, and I think it will continue to improve as we go ahead. It is a big\npart, and again, one of our three major transmissions.\nThere's no doubt, Brian has been on board 6 months. It's better than the last year we had at the end of last\ncalendar year. No offense he does a far better job than I do, and we're really, really excited to have him here. He's\nbringing like a huge amount of experience across all manner of the history of his to our sales transformation and\ncontinue to improve things.\nIt's worth explaining, we still have like a $14 billion addressable market revenue opportunity within our existing\ncustomer base alone without any pricing changes, et cetera. Over 80% of the Fortune 500 are our customers\ntoday. But they represent around 10% of our business. So again, lots of growth that you've seen on the back of as\nwell, Joe mentioning Data Center to Cloud migration is up 60%. They tend to be oriented in the largest segment\nof the customers, year-on-year that is. And our Google Cloud partnership that we announced today, which is a\nreally great milestone in terms of our multi-cloud strategy, gives us resilience gives us a lot of different\nadvantages there.\nAnd I would say, in the quarter also, we had some fantastic Teamwork Collection wins that were ahead of our\nexpectation for the speed of those types of deals happening in this size of customer base. So it shows a lot of\nthe faith that our customers have and the desire and like they have for our products.\nThere are a series of areas that Brian and the sales and success team continue to work on improving and I would\nexpect them to keep improving over the next year, 2 years, 3 years, right? Every quarter, these are not things that\nare done. We continue to try to get more customer-centric in our processes, build deeper and stronger\npartnerships with our customers, the biggest. Brian and myself have both been all over the world in the last 3 and\n6 months, meeting customers from all manner of geographies that we have and helping them on that partnership\njourney.\nWe continue to work on improving our customer success operation. There's a lot of things that we can keep\ndoing there. Again, it's going from good to great kind of progress movement. We did a great job on sales\nexecution and sales operations in the last quarter. That is something that we keep working on, building better\nsystems as we're doing at ever increasing scale to be able to deliver that deal velocity.\nPlenty of changes in the partner ecosystem and strengthening that to make sure that we have the win-win-win\ntriangle between ourselves, the partners and the customers. Larger numbers of GSIs coming on board and really\nbuilding big practices around Atlassian. And fundamentally improving our -- the culture in sales is really\nimportant, right? There's a talent equation about people? Yes, but it's really about the culture, right, making people\nfeel like we are a place that they can do fantastic work and build those partnerships with customers. So we're\npretty bullish on our Enterprise transformation as it continues to pick up speed and a lot of work ahead, but we\nbelieve we can do it all.\nOperator\nYour next question comes from Karl Keirstead from UBS.\nKarl Emil Keirstead UBS Investment Bank, Research Division – Analyst\nThis one is for Joe. Joe, a couple of questions ago. You mentioned that you will get quarterly variability in the\ndata center segment growth, but maybe you could just unpack the Q1 guide. It's a reasonably large step down in\ngrowth. Is there anything unique about the September quarter that might be in your head where you're being a\nlittle more cautious?\n11/08/2025, 14:24\nAtlassian Corporation, Q4 2025 Earnings Call, Aug 07, 2025 – Atlassian Corporation – BamSEC\nhttps://www.bamsec.com/transcripts/742e1024-2d01-4cad-a575-9cf0abf7906e\n10/15\nJoseph L. Binz Atlassian Corporation – CFO & Principal Financial Officer\nKarl, thanks for the question. As you mentioned, our Q1 Data Center guidance is approximately 8%. That's quite a\nstep down from what we delivered in Q4. Part of that is related to Q4 and that we benefited from several large\nrenewals that happened in the quarter. We have a much bigger expiration base in Q4 than we do have in Q1.\nThat's a seasonally weaker quarter. So we're going to have less opportunity for expansion and price increases off\nof that. .\nIn the quarter, Q4 growth was driven primarily by pricing and partially offset by Cloud migrations as we continue\nto deliver significant improvements in the enterprise-grade capabilities and value to our cloud platform, and we\nare helping data center customers migrate to the Cloud, as I mentioned earlier.\nThe guidance so for Q1 reflects not only the smaller expiration base, but also the fact that we have some\nheadwinds related to the 1-year deal terms from a programmatic change that we made a year ago. And we're\nfinally starting to slowly lap the benefit of the migration from server and support. So there's some modest\nincremental headwinds there in Q1 that are part of this as well. So -- that's basically the drivers. I think the\nprimary one is it comes down to we just have a smaller expiration base in Q1 and therefore, less opportunity to\ndrive growth off of it.\nOperator\nYour next question comes from Gregg Moskowitz from Mizuho.\nGregg Steven Moskowitz Mizuho Securities USA LLC, Research Division –\nManaging Director of Americas Research\nSo Mike, you're actually not the first software company reporting earnings today to articulate a goal to drive more\nwall-to-wall deployments going forward. It is easier said than done though. In Atlassian's case, I know that about\nhalf of your licensees are in nontechnical roles, and that's great. But your penetration rate of nontechnical\nemployees at a typical enterprise surely must be a lot lower than it is for technical employees. And so I guess --\nthe question is, how do you convince a lot more Global 2000 organizations to equipped every salesperson in\nevery finance, HR, marketing and legal professional with an Atlassian license?\nMichael Cannon-Brookes Atlassian Corporation – Co-Founder, CEO & Director\nThanks, Gregg. It's a really fair and interesting question. I would say, firstly, we are doing it on a daily basis. We\nhave had significant momentum in consolidation over the last year that's only picked up in the last quarter, only\ncontinued to grow in the last quarter. When we look at the other applications that customers are using,\nconsolidation has become a real weapon for us, and we're really happy with where that's going. .\nSecondly, we see continued progress in the business user segment. You're right at calling out there are many\nmore business users out there. We see that as a huge opportunity for us. We've grown that almost every quarter\nfor the last few years, but it's certainly accelerating.\nWhy is that? Lots of things. So for example, the Teamwork Collection is a broader offering separating out our\nsoftware pieces from our broad collaboration pieces really helps with that. Secondly, we spent a lot of time\ninvesting in design, speed, performance, all sorts of things that really make a difference as well as usability of\nthings like Jira for broad business teams, and we're seeing some really great take-up with that.\n11/08/2025, 14:24\nAtlassian Corporation, Q4 2025 Earnings Call, Aug 07, 2025 – Atlassian Corporation – BamSEC\nhttps://www.bamsec.com/transcripts/742e1024-2d01-4cad-a575-9cf0abf7906e\n11/15\nThirdly, Loom makes a huge difference in business teams. Again, Loom does very well in sales teams and other\nareas, especially with outbound customer communication. It gets the Atlassian Stack, used and understood by\nbroader swaths of customer population. Obviously, we have Trello, which has long done extremely well in the\nbroad set of users.\nSo I would say collectively, when it looks at the products and the apps that we have as well as the platform, we\ncontinue to make great progress in those areas. And of course, Rovo continues that momentum in a big way. The\nconnectors we have in Rovo search enabling sales teams to connect, enabling marketing teams to connect and\nto chat, connect and build agents that run across all their data and those business workflows.\nWhether that's in service management, whether that's in broad business workflows in Jira or whether that's\ncoming Confluence and a wholesale of our applications together with all of these third-party tools. We just see\nthat we have great momentum in continuing to attack that market. The business team usage continues to grow\nfor Atlassian.\nI will say that the technology team usage always continues to grow as well. So it's not one at the expense of the\nother, which is really important because that's where you often get this proportionality problem right. Our\nsoftware business is doing really well. And so it's not necessarily one for the other, but we're trying to do both\nsimultaneously.\nOperator\nYour next question comes from DJ Hynes from Canaccord.\nDavid E. Hynes Canaccord Genuity Corp., Research Division – Analyst\nSo Joe, how should we think about the bridge from MAU growth in Rovo to eventual more robust monetization?\nLike how do you think about that time line? And do you think it shows up first in consumption and usage or more\neffective cross-sell?\nJoseph L. Binz Atlassian Corporation – CFO & Principal Financial Officer\nYes. Thanks, DJ for the question. I'll start, and then Mike, feel free to chime in on top. As Mike articulated in the\nshareholder letter and in his comments, we are very excited about the strategic opportunity AI and Rovo present\nfor us. In terms of the revenue impact, you asked about, we've mentioned in the past that the big focus for Rovo\nfrom the very beginning was around deployment, usage and engagement, and that revenue and monetization\nwere secondary, longer-term considerations.\nWhile we have some consumption-based revenue from Rovo in our FY '26 plan, our guidance assumes very\nnominal amounts just given the limits we set to incent adoption and usage of our AI services. From there, we do\nbelieve some of the broader benefits from Rovo to our overall apps and collection portfolio, such as seed\nexpansion, upgrade to higher additions and migrations will play out over time. So -- and in addition to that, we are\nseeing, as Mike pointed out, very strong uptake on premium and enterprise addition already. And some of that is\na function of the AI and Rovo value that we put in the product.\nSo we're super pleased with the reception of Rovo's launch. It's been exciting to see the reaction from customers\nand the increasing usage and adoption. And our big focus continues to be around deployment, usage and\nengagement, and monetization later. And since the launch, all 3 of those things are tracking along really nicely.\nMike, anything else you want to add on that one?\n11/08/2025, 14:24\nAtlassian Corporation, Q4 2025 Earnings Call, Aug 07, 2025 – Atlassian Corporation – BamSEC\nhttps://www.bamsec.com/transcripts/742e1024-2d01-4cad-a575-9cf0abf7906e\n12/15\nMichael Cannon-Brookes Atlassian Corporation – Co-Founder, CEO & Director\nYes, I can add a few things, DJ. Firstly, Look, we should talk about the Teamwork Collection. Again, I've\nmentioned a Series of Customer examples. We could keep going on with customer examples, to be honest. We\nhad a very large gaming company, iconic gaming company choosing Teamwork Collection, again for AI and the\nthings that come with it so. The Teamwork Collection uplift for customers moving to that across their seats is\npartially AI-driven for sure, right? We're seeing that. We're putting it at the core of the platform. So that's one\nreally important vector to make sure to understand.\nSecondly, on the Rovo specifically, we do have skew for non-Atlassian users to get access to Rovo in terms of\nsearch and chat and other things. But we think in the medium term, that will be another growth vector possible.\nWe'd rather those users to be on the Teamwork Collection to be actually collaborating, but it's a good stepping\nstone point to actually get to that.\nWe are increasingly seeing and deploying consumption-based pricing aspects in a whole series of different\nplaces. You can see that with Forge and Forge usage for extensibility. We've done a lot in Bitbucket pipelines and\nJSM virtual service agents and assets and then in AI itself and AI credits.\nOne of the built-in pricing and packaging things that I know a few people have commented on is when you buy\nthe Teamwork Collection, you get a much larger set of AI credits on purpose. So again, it drives that usage, and\nwe are doing a very good job, I think, at managing margin while investing heavily in AI and doing those things\nsimultaneously.\nWe do have a lot of different growth vectors that also are driven by AI that leads to monetization in the long term.\nI mentioned also virtual service agents with Jira Service Management. The service management business is\ndoing very well. It had a great quarter, and we had a lot of great wins and migrations off some legacy vendors at\nlarge scale. So that is really driving it. And then, of course, in software, we have Rovo Dev -- Rovo Dev CLI.\nIt's unmonetized at this point because, again, to Joe's point, we want to drive usage first and then understand\nwe're early in the AI wave. But I think we can see a lot of examples of where it's already working for us in terms of\nusage, in terms of driving adoption. Again, I mentioned that we had 5x token usage growth quarter-on-quarter.\nWe have a 50%-ish now growth rate of AI tools. So that's all really heading in that direction of usage first, and we\nwill -- we're very good at monetizing in the long term.\nI will say that premium and enterprise additions again, had a growth rate of about 40% year-on-year for those\ncore offerings. So that's another reason where you're seeing AI monetization. So we are thinking about it. We're\nspending time on it. It's coming in a lot different places.\nOperator\nYour next question comes from Jason Celino from KeyBanc Capital Markets.\nJason Vincent Celino KeyBanc Capital Markets Inc., Research Division – Director &\nEquity Research Analyst\nMaybe just one for Joe. When I look at the operating margin guidance, it looks like it's 24%, very modest\ncompression over 2025. I know you're awfully close to your mid-20s -- 2027 number, so you're not too far. But\nwhen we think about some of the investment priorities this year, maybe can you just outline a few of them? I\nknow one of Brian Duffy's priorities was to expand sales count for the service management side. Curious if that's\none, how that might ramp and if there's anything else.\n11/08/2025, 14:24\nAtlassian Corporation, Q4 2025 Earnings Call, Aug 07, 2025 – Atlassian Corporation – BamSEC\nhttps://www.bamsec.com/transcripts/742e1024-2d01-4cad-a575-9cf0abf7906e\n13/15\nJoseph L. Binz Atlassian Corporation – CFO & Principal Financial Officer\nYes. Thanks for the question, Jason. I'll start with the big investment areas and I'll talk about operating margin\nspecifically. So in terms of operating expenses, we expect to maintain largely consistent growth rates FY '25 to\nFY '26 on operating expenses. Within that, we'll continue to invest primarily in sales and marketing and R&D,\nagainst the core strategic priorities Mike laid out earlier around Enterprise Cloud AI and our System of Work,\nwhere we have tremendous opportunity. And we have great signal and momentum coming out of fiscal year '25\nacross all of these.\nAnd we believe these investments have compelling return profiles and lay the foundation for sustained healthy\nrevenue growth in FY '27 and beyond. In terms of operating margin, you're right, our operating margin guide for\nnext year is 24%. That's slightly lower than FY '25. In terms of the drivers of that, I'd start by saying we took what I\nbelieve to be the same conservative risk-adjusted approach to our revenue guidance for FY '26 that we took last\nyear for FY '25. From there, we expect gross margins to be relatively stable year-to-year as we expect the work\ndone to optimize our cloud infrastructure and support costs will offset the impact of greater cloud revenue mix\nand expected costs related to increasing AI usage.\nI talked about the investments that we're making. So given all these factors, you land at a 24% operating margin\nguide to start the year in FY '26. And just to reiterate, you made the point, we remain confident in our ability to\nachieve the FY '27 non-GAAP operating target in excess of 25%.\nAnd then just one final comment in terms of how we think about margin and managing it. I would expect us to do\nwhat we've done over the last 2 years, which is to manage costs carefully, to invest in a super disciplined way\naround the highest return opportunities we have and to ensure we meet our profitability commitments.\nAnd at times, that will mean taking upside from outperformance on revenue and investing it to accelerate\nprogress or go after new things. And at other times, as you've seen us do in the past, it will be in blending\nrevenue and gross margin outperformance dropped to the bottom line. That's the framework we use to make\nthose decisions going forward, and we'll continue to maintain a focus, as I mentioned earlier, on meeting our\nprofitability commitments.\nMichael Cannon-Brookes Atlassian Corporation – Co-Founder, CEO & Director\nAnything I wanted to follow on just briefly, Jason, to Joe's comment. He covered most things. Firstly, a small one.\nAgain, we were ahead of target for sales hiring in the quarter shows our talent acquisition pipeline continue to be\nvery strong and also have execution. But those are the types of opportunities that we want to take.\nWe believe in the strength of the Enterprise opportunity, and the momentum we're seeing across all the 3\ntransformations, but specifically in the enterprise. So sales hiring being ahead of forecast is a good thing for us\nin the medium term.\nI do want to reiterate the commitments that we've made. The 25% margin target for FY '27 is very important to all\nof us. We are spending a lot of time making sure that we target those numbers, while at the same time, doing all\nthe investing that you can see. It's important that we are investing in AI. We are investing to win in that space,\nand we're trying to balance this on a continual basis. And I think we've shown a really good job in FY '25, and we\nexpect that to continue in FY '26.\nOperator\nThat's all the questions we have time for today. I will now turn the call over to Mike for closing remarks.\n11/08/2025, 14:24\nAtlassian Corporation, Q4 2025 Earnings Call, Aug 07, 2025 – Atlassian Corporation – BamSEC\nhttps://www.bamsec.com/transcripts/742e1024-2d01-4cad-a575-9cf0abf7906e\n14/15\nMichael Cannon-Brookes Atlassian Corporation – Co-Founder, CEO & Director\nThank you, everyone, for listening. I just want to extend my thanks to all of the Atlassians that worked incredibly\nhard over the last quarter to deliver some fantastic results across the board, and we maintain incredible\nbullishness on the future. Thank you all for listening, and I hope you have a kick-ass weekend.\n11/08/2025, 14:24\nAtlassian Corporation, Q4 2025 Earnings Call, Aug 07, 2025 – Atlassian Corporation – BamSEC\nhttps://www.bamsec.com/transcripts/742e1024-2d01-4cad-a575-9cf0abf7906e\n15/15"}, "content_hash": "5861adb52edbf1ff27be9f974c6794e1411195a1472e18985079344e9da98737", "transcript_name": "Atlassian Corporation, Q4 2025 Earnings Call, Aug 07, 2025 – Atlassian Corporation – BamSEC.json"}