{"validated_at": "2025-08-29T12:12:12.930524", "input": {"call_type": "earnings", "summary_length": "short", "filename": "BIDU - ET_E_document_dated_20-08-2025 (1).pdf"}, "transcripts": {"presentation": "Baidu, Inc., Q2 2025 Earnings Call, Aug 20, 2025    (Spellchecked version)\nCall Participants\nEXECUTIVES\nDou Shen\nExecutive VP & President of Baidu AI Cloud Group\nHaijian He\nChief Financial Officer\nJuan Lin\nDirector of Investor Relations\nRong Luo\nExecutive Vice President of Baidu Mobile Ecosystem Group\nUnknown Executive\nYanhong Li\nCo-Founder, Chairman & CEO\nANALYSTS\nAlex C. Yao\nJPMorgan Chase & Co, Research Division\nAlicia Yap\nCitigroup Inc., Research Division\nGary Yu\nMorgan Stanley, Research Division\nLincoln Kong\nGoldman Sachs Group, Inc., Research Division\nThomas Chong\nJefferies LLC, Research Division\nWei Xiong\nUBS Investment Bank, Research Division\nXiaomeng Zhuang\nBofA Securities, Research Division\nPresentation\nOperator\nHello, and thank you for standing by for Baidu's Second Quarter 2025 Earnings Conference Call. [Operator\nInstructions]. Today's conference is being recorded. [Operator Instructions]\nI now like to turn the meeting over to your host for today's conference, Juan Lin, Baidu's Director of Investor\nRelations. .\nPage 1 of 12\nJuan Lin\nDirector of Investor Relations\nHello, everyone, and welcome to Baidu's Second Quarter 2025 Earnings Conference Call. Baidu's earnings\nrelease was distributed earlier today, and you can find a copy on our website as well as our Newswire\nservices. On the call today, we have Robin Li, our Co-Founder and CEO, Julius Rong Luo, our EVP in charge of\nBaidu Mobile Ecosystem Group MEG , Dou Shen, our EVP in charge of Baidu AI Cloud Group ACG; and Henry\nHaijian He our CFO. After our prepared remarks, we will hold a Q&A session.\nPlease note that the discussion today will contain forward-looking statements made under the Safe Harbor\nprovisions of the U.S. Credit Securities Litigation Reform Act of 1995. Forward-looking statements are subject\nto risks and uncertainties that may cause actual results to differ materially from our current expectations. For\ndetailed discussions of these risks and uncertainties, please refer to our latest annual report and other filings\nwith SEC and Hong Kong Stock Exchange. Baidu does not undertake any obligation to update any forward-\nlooking statements except as required under applicable law.\nOur earnings press release and this call include discussions of certain unaudited non-GAAP financial\nmeasures. Our press release contains a reconciliation of the unaudited non-GAAP measures to the unaudited\nmost directly comparable GAAP measures and is available on our IR website at ir.baidu.com. As a reminder,\nthis conference is being recorded. In addition, a webcast of this conference call will be available on Baidu's IR\nwebsite.\nI will now turn the call over to our CEO, Robin. .\nYanhong Li\nCo-Founder, Chairman & CEO\nHello, everyone. In Q2, Baidu Core's total revenue was RMB 26.3 billion. Our AI cloud continued to gain\nmomentum, growing 27% year-over-year to RMB 6.5 billion. Notably, Baidu Core's non-online marketing\nrevenue exceeded RMB 10 billion for the first time. That's up 34% year-over-year. This performance helped\noffset the near-term headwinds in our online marketing business. This year marked Baidu's 20th anniversary\nas a public company. Over the past 2 decades, we remain grounded in our belief in technology and\ninnovation. Today, technological advancement is unfolding at an unprecedented pace. We've embraced the\nmega trend with open mind, experimenting boldly adapting quickly and engaging deeply with AI frontiers.\nAmid rapid evolution, we've identified and doubled down on a few directions, we believe holds the greatest\nlong-term value and are deepening our efforts with increasing clarity and confidence. Foundation model\ndevelopment remains a key focus area where we are actively exploring the frontier of foundation model\nresearch and pushing the boundaries of AI capabilities. With an application-driven approach, we see earnings\nintuition towards areas with real world application value. such as the fundamental AI transformation of Baidu\nSearch and our industry-leading digital human technology.\nTake digital human as a prime example, which represents 1 of the best applications of our earning models.\nThis quarter, powered by ERNIE, our digital human technology reached new levels of rareness and\ncapabilities, matching or even exceeding human performance in certain scenarios. Standout case was a live\nstream featuring the digital human of volume car, a top influencer in China. The 7-hour live stream generated\ntens of millions in GMV fully powered by ERNIE series models. ERNIE 4.5 Turbo generated a complete script,\nincluding dialogue, tone and action queues. closely mirroring the real person communication style.\nOur multi-model capabilities delivered industry-leading visual realism with nuanced facial expressions,\ngestures and body movements that responded naturally to conversation flow in real time, achieving next\nlevel of performance that sets new standards in digital human technology. Beyond this flagship case, digital\nhumans are empowering our broader merchant base with performance that already surpasses human live\nstreaming hosts in many scenarios. Going forward, we will continue accelerating foundation model\nintegration, strategically focusing our efforts on areas with application value where we can maintain our\nmost competitive capabilities.\nPage 2 of 12\nBeyond the model capabilities, our unique 4-layer end-to-end AI architecture has become a core competitive\nadvantage and represents a key focus in our AI cloud business where our full stack AI capabilities are driving\nhealthy growth. As the infrastructure layer, we achieved a critical system engineering breakthrough this\nquarter by completing the large-scale stable deployment of prefiled detailed separation architecture. This\nbreakthrough significantly improves inference on currency and resource utilization, while substantially\nreducing inference costs.\nThe achievement was made possible at the end to end optimization enabled by our unique 4-layer AI\narchitecture. spending infrastructure framework models and applications, which allows us to comminate\nimprovements across all layers. At the same time, each layer remains open giving customers flexible choices\nbetween Baidu's proprietary and third-party options. As a result, we continuously improving the cost\neffectiveness of our AI cloud products and solutions reinforcing our position as China's top-tier cloud\nprovider in the AI era. Meanwhile, our industry-leading MaaS platform, Qianfan continue to evolve to better\nsupport enterprise clients in building models and facilitating AI application development.\nChina features a comprehensive model library covering nearly all mainstream foundation models on the\nmarket. This quarter, we further expanded the library with a range of new models, including our newly often\nsourced early 45 series, additional third-party multi-model models and other leading options enabling\ngreater flexibility across enterprise use cases. Leveraging our breakthrough in cloud infrastructure, Shenzhen\ndelivers enhanced stability, higher currency and lower inference costs when running models, meeting our\nsuperior price performance.\nOn the tool chain front, Shipments tool chains are among the most comprehensive with industry-leading\nreinforcement learning and post training tools for our model development. In Q2, [indiscernible] was further\nenhanced to support a wider range of AI tools and functions that can be caused via MCP or API including\nBaidu's proprietary capabilities such as Baidu Search, Baidu Wenku, Baidu Maps as well as selected third-\nparty capabilities like payment services. These enhancements helped simplify AI application development\nand continue to solidify [indiscernible] leadership as 1 of China's top MaaS platforms.\nAutonomous driving remains 1 of the most promising areas with long invested, which represents a critical\nfrontier in physical world AI. Following the successful validation of our urban model at the end of last year,\nApollo Go is now scaling rapidly. In Q2, Apollo Go provided over 2.2 million fully driverless drives to the\npublic. That's up 148% year-over-year, marking our strongest quarterly growth in 2 years. Also, Apollo Go\nglobal expansion has gained solid momentum, highlighted by 2 strategic partnerships with leading global life\nsaving platform. In July, we announced a multiyear strategic partnership with Uber. Under this partnership,\nthousands of Apollo Gos fully autonomous vehicles will be deployed on the Uber platform across multiple\ninternational markets with initial rollouts planned for Asia and the Middle East. This milestone was followed\nby our partnership with Lyft in August, which will also bring thousands of our fully autonomous vehicles to\nkey European markets through the Lyft platform. starting with Germany and United Kingdom and selling\nacross Europe over time.\nOur expansion into international markets is build on a strong foundation. In China, we have already achieved\npositive unit economics in markets where wide fares are much lower than those in major overseas markets.\nThat's why this global partnerships are both logical and strategic positioning us to capture greater value in\nhigher fare markets while scaling efficiently. Our partners, global market presence, leveraging our partners'\nlocal market presence, we can accelerate market entry across different continents and achieve faster\ndeployment. while maintaining a cost-efficient asset-light business model.\nIn markets we've already entered, we continue to make encouraging progress in Hong Kong, 1 of the world's\nmost complex right-hand drive city. We recently expanded our testing coverage to include Tongcheng and\nSouthern District advancing our open node testing into more complex urban scenarios across both\ncommercial and residential areas. Also, we further strengthened our presence in the Middle East in Dubai\nand Abu Dhabi, we started open road testing in designated areas in August. Notably, Apollo Go leads the\nworld in right-hand drive robotaxi market. This is a space where hardly any companies of our kind have\nentered, and we've made by far the most progress. The rapid progress we are making in Hong Kong really\nPage 3 of 12\nshows our global leadership. It's proof of how adept our technology is and how mature our operations have\nbecome across all kinds of environment.\nOur experience there provides us valuable insights for entering other right-hand drive markets,\nstrengthening our confidence in scaling Apollo Go globally. With solid progress quarter by quarter, we are\nmore confident than ever in Apollo Go's international potential. As China's largest autonomous ride\n[indiscernible] service provider and a global leader in this space, Apollo Go continues industry-leading\ntechnology, Apollo Go combines industry-leading technology, extensive operational experience and\nextraordinary safety records to bring safe, comfortable and affordable autonomous ride-hailing services to\nmore markets worldwide than anyone else.\nIn our mobile ecosystem, transforming our products with AI remains a strategic priority, especially our legacy\nconsumer-facing product Baidu Search. Baidu is at the forefront of applying AI to transform search globally\nrather than simply inserting AI summaries into search results we are fundamentally revolutionizing the third\nexperience by completely replacing static actual hyperlink with intelligent, structured and multi-model first\nAI-generated responses. These responses start with relevant multi-model content right at the top. making\ncomplex information more accessible to a broader user base and therefore, creating a more intuitive\nexperience.\nIn Q2, our AI transformation continued to accelerate, with AI-generated content reaching over 50% of mobile\nsearch result pages by the end of June up from 35% in April. By July, 64% of mobile search result pages\ncontained AI-generated content presented in a structured and multi-model first format, marking the broader\nrollout of our innovative AI search experience. This AI transformation reached over 90% of Baidu App's\nmonthly active users in July, with over 60% of such search result pages, starting with rich media elements\nsuch as images or videos. As we advance our AI transformation, the expanding content ecosystem across\nBaidu provides meaningful support leveraging ongoing progress in Gen AI and multi-model capabilities,\nBaidu's AI-generated content has grown significantly in both scale and quality providing more high-quality\ncontent for search result. AI-generated multi-model content, in particular, has been a seen rapid expansion.\nFor example, daily IGC video generation reached millions of units starting from May and daily AI GC video\ndistribution within Baidu App has grown rapidly. We're delighted to see sustained improvements in user\nmetrics. In June, Baidu App MAU reached 735 million representing a 5% year-over-year growth. The daily\naverage time spent per user in Q2 increased by 4% year-over-year.\nBuilding on search ability to satisfy user intent, we are expanding its boundaries from providing smart\nanswers to completing tasks and connecting real-world services. For instance, our agents engaged users in\nmultiround conversations, connect them with relevant service providers when needed. and facilitate end-to-\nend task completion across multiple verticals. We believe this represents a meaningful expansion of what\nsearch can achieve enabling users to seamlessly move from information to action.\nNow let me review the key highlights of each business sector this quarter. AI cloud revenue reached RMB 6.5\nbillion in Q2, up 27% year-over-year with non-GAAP operating profit achieving year-over-year growth. The\ngrowth was primarily driven by the growing demand for our highly cost-effective end-to-end AI products and\nsolutions. Within the enterprise cloud, which contributes the vast majority of AI cloud revenue, subscription-\nbased revenue grew at a solid pace, signaling a healthier and more sustainable revenue structure.\nOn the infrastructure layer, we continuously enhanced our resource management capabilities, achieving\nhigher and higher infrastructure utilization. Through ongoing end-to-end optimization across our 4-layer AI\narchitecture, combined with increasingly refined and efficient GPU resource management capabilities our\nlarge-scale key clusters have achieved over 90% utilization rates recently for key tasks. Our enhanced\ncapabilities allow us to deliver better performance at lower cost and provide more competitive pricing for\nenterprise customers, establishing a virtuous circle, where our growing customer base and diversified\nworkloads further improve resource utilization, reinforcing our sustainable revenue model. In Q2, our\ncustomer portfolio continued to improve. existing clients deepen the collaboration and increased spending,\nwhile mid-tier enterprise clients demonstrated strong growth momentum. Additionally, this quarter marked\nPage 4 of 12\nseveral strategic partnerships with prominent companies across key verticals, including a leading lifestyle\nplatform and top-tier gaming company in China.\nIn the embodied AI industry, we have partnered with 20 companies cumulatively, including changing\nInstitute of artificial intelligence and robotics for society. In autonomous driving, we established a\npartnership with Black System Technologies on AI cloud infrastructure. This partnership reflects the strong\nrecognition of Baidu AI cloud and affirm our competitive positioning in China's AI cloud market. Building on\nour full stack AI capabilities, we are not only serving enterprise clients but also driving internal productivity\nand mass-market AI adoption at the application layer. Internally, we widely adopted [ Comet ] our AI coding\nassistant for developers. Comet capabilities continue to improve, enabling more agentic and efficient\ndevelopment workflow.\nIn July, AI contributed to generating over 45% of our new code with [indiscernible] providing oversight and\napproval. This has significantly boosted our engineering productivity and meaningfully enhanced our internal\nR&D efficiency. Externally, [ Minda ] extends this AI development capabilities to the broader community.\nFollowing Midas official launch last quarter, we are now delivering 2 low-code capabilities that enable users to\ncreate applications from mini games to utility tools and websites through simple natural language\nconversations with AI, no programming expertise required.\nAs of July, users have created around 200,000 applications on [ Milda ] are built completely without writing a\nsingle line of code. We are continuously enhancing low-code capabilities as we work toward our mission to\ndemocratize AI and empower anyone to innovate.\nMoving to intelligent driving. In Q2, Apollo Go provided over 2.2 million fully driverless to the public, up 148%\nyear-over-year. As of August, cumulative rights provided to the public have surpassed 14 million,\nunderscoring the scale and maturity of our fully drivers operations. As of June, Apollo Go's global footprint\nspans 16 cities. To date, our fleet have accumulated over 200 million autonomous kilometers with an\noutstanding safety record, which is a testament to the ability and safety of our autonomous driving\ntechnology.\nBeyond global partnerships like Uber and Lyft, we are accelerating the rollout of asset-light business models\ndomestically. This quarter, we established new partnerships with [indiscernible] and [indiscernible] screen\nmobility, expanding our collaborative network with leading mobility service providers. Additionally, building\non the partnership announced last quarter, Apollo Go's fully autonomous vehicle rental service, officially went\nlive on the Car Inc. app. offering users a new access point to our Apollo Go fleet. These partnerships enable\nus to rapidly scale our services while leveraging partners operational expertise and existing customer bases,\ncreating an efficient path to broader market penetration.\nGoing forward, we are confident to further accelerate our global expansion and capture significant value\nacross multiple markets worldwide. For our mobile ecosystem, we continue accelerating AI transformation of\nsearch in Q2. In today's highly competitive mobile Internet market, where new products and technologies are\nemerging and evolving faster than ever, user needs and behaviors are constantly shifting, making it essential\nfor us to keep waiting at a rapid pace. While our AI transformation is progressing rapidly, it is still in the early\nstages with considerable room for optimization before reaching its full potential. And we are not yet at the\nstage for large-scale monetization. Against this backdrop, we began prudent small-scale monetization testing\nin Q2 with user experience remaining our top priority.\nEarly results have been satisfying for example, some queries that we previously -- difficult to monetize are\nnow showing potential. Agents maintained strong performance in driving better conversion efficiency,\nfurther validating our effectiveness. In Q2, revenue generated by our agents for advertisers grow 50% year\nover -- quarter-over-quarter. contributing 13% of Baidu Core's online marketing revenue. That's up from 9% in\nQ2 than in Q1. In parallel, digital human gained traction as an innovative monetization avenue for our\nadvertising wins, particularly through AI-powered live streaming.\nPage 5 of 12\nWe've seen steady growth in digital human adoption over recent quarters. Beyond serving live streaming\nhosts for merchants, they were being adopted at growing scale in health care legal services, education and\nautomotive sector. More advertisers recognize their value in boosting conversion performance through real-\ntime user interaction and round-the-clock availability, leading to increased ad budget allocation towards\ndigital humans. In Q2, revenue generated by digital human increased by 55% quarter-over-quarter,\ncontributing 3% of Baidu Core's online marketing revenue.\nTo sum up, as we look ahead, Baidu will stay anchored in our long-term mission and move forward with\ngreater focus and resolve as we continue to translate AI innovation into real-world value.\nBefore we move to Q&A, I'd like to take a moment to welcome Henry, Mr. Haijian He, who recently joined us\nas Chief Financial Officer.\nWith that, let me turn the call over to Henry to go through the financial results.\nHaijian He\nChief Financial Officer\nThank you, Robin, and hello, everyone. I'm delighted to join the Baidu team and looking forward to working\nwith all of you. Now let me walk through the details of our second quarter financial results. Total revenues\nwere RMB 22.7 billion, decreasing 4% year-over-year. Revenue from Baidu Core was RMB 26.3 billion,\ndecreasing 2% year-over-year. Baidu Core's online marketing revenue was RMB 16.2 billion, decreasing 15%\nyear-over-year. Baidu Core's non-online marketing revenue was RMB 10 billion, up 34% year-over-year,\nprimarily driven by the boost of AI cloud business. Within Baidu Core's non-online marketing revenue, AI\ncloud revenue was RMB 6.5 billion, increased by 27% year-over-year.\nRevenue from ITE was RMB 6.6 billion, decreasing 11% year-over-year. Cost of revenue was RMB 18.4 billion,\nincreasing 12% year-over-year, primarily due to an increase in costs related to AI cloud business and content\ncosts. Operating expenses were RMB 11.1 billion, decreasing 4% year-over-year, primarily due to a decrease\nin personnel-related expenses, partially offset by the increase in channel spending expenses. Baidu Core's\noperating expenses was RMB 9.7 billion, decreasing 5% year-over-year. Baidu Core's, SG&A expenses were\nRMB 5 billion, increasing 6% year-over-year. SG&A accounted for 19% of Baidu Core's revenue in the quarter\ncompared to 18% in the same period of last year.\nBaidu Core R&D expenses were RMB 4.7 billion, decreasing 14% year-over-year. R&D accounted for 18% of\nBaidu Core's revenue in this quarter compared to 20% in the same period of last year. Operating income was\nRMB 3.3 billion. Baidu Core's operating income was RMB 3.3 billion, and Baidu Core's operating margin was\n13%. non-GAAP operating income was RMB 4.4 billion. Non-GAAP Baidu Core operating income was RMB 4.4\nbillion, and the non-GAAP Baidu Core operating margin was 17%.\nTotal other income net was RMB 4.9 billion, increasing 531% year-over-year, primarily due to an increase in\nthe fair value gain and a pickup of earnings from long-term investments. partially offset by increase in the net\nforeign exchange loss arising from exchange rate fluctuation between RMB and the U.S. dollar. Income tax\nexpenses was RMB 881 million compared to RMB 1.1 billion in the same period of last year. Net income\nattributable to Baidu was RMB 7.3 billion, and the diluted earnings per ADS was RMB 20.35. Net income\nattributed to Baidu Core was RMB 7.4 billion, and the net margin for Baidu Core was 28%.\nNon-GAAP net income attributed to Baidu was RMB 4.8 billion. Non-GAAP diluted earnings per ADS was RMB\n13.58. Non-GAAP net income attributed to Baidu Core was RMB 4.8 billion, and non-GAAP net margin for\nBaidu Core was 18%. As of June 30, 2025, cash, cash equivalents restricted cash and short-term investments\nwere RMB 124.2 billion. And the cash, cash equivalents, research cash and short-term investments, excluding\nIT, were RMB 119.9 billion. As of June 30, 2025, cash, cash equivalents, short-term investments and the long-\nterm time deposits and had to maturity investments for Baidu Core were RMB 229.7 billion.\nFree cash flow was negative RMB 4.7 billion, and free cash flow, excluding iQIYI was negative RMB 4.6 billion,\nprimarily due to the increase of investment in AI business. We define net cash position, as total cash, cash\nPage 6 of 12\nequivalents, restricted cash, short-term investments, net long-term time deposits held to maturity\ninvestments and others. less total loans, convertible senior notes and notes payable.\nAs of June 30, 2025, net cash position for Baidu was RMB 155.1 billion. Baidu Core had approximately 31,000\nemployees as of June 30, 2025.\nWith that, operator, let's now open up the call for the questions. Thank you.", "q_a": "Question And Answer\nOperator\n[Operator Instructions]\nYour first question comes from Alicia Yap, Citigroup.\nAlicia Yap\nCitigroup Inc., Research Division\nAnd also welcome Henry as the new CFO. I have a question on your AI model. with the rev model iteration,\nhow do you view the current landscape? How do you position ERNIE strategically in the market and alignment\nwith Baidu broader business strategy? And we also have heard that you are planning to launch ERNIE 5.0,\ncould management share plans for ERNIE in the second half this year and also the key focus area for this next\nversion.\nYanhong Li\nCo-Founder, Chairman & CEO\nAlicia, this is Robin. Let me first give you our take on the current landscape. The pace of model iteration is\nfaster than ever. We see multiple new models launched almost every week and each new generation is is\nstronger than the last. In recent months, we've seen models grow more capable, reaching the stage where\nthey're deeper logic and greater creativity now enable them to proposed entirely new solutions to never\nsaying before. And I believe this is this kind of innovative ability is getting stronger. Meanwhile, the\nfoundation model landscape is becoming more numbers and clearly not a one-size-fit-all situation, especially\nin China, similar to EVs you always have a lot of choices, different models excel at different tasks. Some are\nstronger in [indiscernible] some are in coding and some in multimodality.\nSo we will continue to see a market where multiple models coexist at very reasonable prices. And the value\ncreation will happen at the application level more than at the model level. Against this backdrop, ERNIE\npositioning is clear. We take an application-driven approach to innovation. In fact, we've taken this approach\nsince the launch of ERNIE -- first launch of ERNIE more than 2 years ago. Rather than spreading efforts across\nevery possible direction, we stay focused on the strategically important areas that's valuable to us. We think\nwe can deliver meaningful impact and sustain our leadership.\nFor example, as we advance AI search transformation, we direct our model capabilities towards generating\nand selecting multi-model search results. And our users love it. Our cloud customers also love it. They're\npaying for our search API for the purpose of RAG in their Gen AI applications. Another example is our hyper\nrealistic digital human technology, which now matches and even exceeds real human performance in the live\nstreaming e-commerce scenario. Our model is just better at convincing people to buy.\nCloud customers are paying for these capabilities, too. As we move into the second half and beyond, we will\ncontinue this acceleration. We're currently working on the next flagship version of ERNIE with significant\nimprovements across key capabilities and expect to launch it as we are ready. In the meantime, we will\ncontinue to roll out iterations and updates on an ongoing basis for our existing model. We also keep\nmonitoring industry developments to ensure our technology road map captures the most promising market\nopportunities. Thank you.\nPage 7 of 12\nOperator\nYour next question comes from Alex Yao from JPMorgan. .\nAlex C. Yao\nJPMorgan Chase & Co, Research Division\nAnd Henry all the best to your new role. So here is my question, how is the AI-powered search upgrade\nprogressing in Q2 and Q3? Could the management share update updated metrics on how user behavior is\nshifting with the new experience, how should we think about the end game of AI search in terms of product\nformat user reach and lastly, commercial potential.\nUnknown Executive\nAlex, thank you so much for your question. This is Luis. I think Q2, we continue to accelerate transformation.\nAnd as Robin has just mentioned, Baidu leads globally in using AI to transfer search and we are maybe were\nthe most aggressive in revolutionized search. And we're probably the only company that has completely\nreplaced the traditional links with intelligent AI answers that start with the multi-model content. This creates\na more efficient, intuitive user experiences and unlike the current AI answers -- travel that remains mostly still\nas a tax base.\nOur focus remains delivering the better user experiences beyond the MAUs and the time spend\nimprovements and the user exposed to AI search now shows higher UV and retention indicating our next\ngeneration, such experience is driving the stronger user satisfaction. As for the end game of AI Search, I think\nstill an open question, but our part is quite clear. We are fundamentally restructuring search. First, instead of\njust indexing or link into information, we are delivering the intelligent AI generating answers that began with\nthe relevant multi-model content. Multi modern content now appears more at the very top of AI answers with\nincreasing portion being AI generating as high-quality AI GC content expensed on our platform directly\nenrich search results and broaden what we can offer to the users.\nAnd meanwhile, the AI is also empowering the people across our ecosystem from users, content creators,\nadvertisers and service providers to produce the more and back to content. This includes enabling those who\nwere not traditional content creators to participate in making our whole ecosystem more vibrant. And for\nexample, in July, we have launched our mill steamer our appropriate trade video generation model to\nfacilitate AI GC video creation at scale. And the latest version of new steamer with significant update will be\nlaunched tomorrow afternoon and [indiscernible], we were moving fast.\nAnd second, we're also evolving from our fight information to completing tasks and connecting users with\nthe real world services. For example, through the MCPs, we have connected search to external capabilities\nlike our British [indiscernible] metropolitan MCPs that can provide ambitious explanations right in search. For\nmore complicated needs, our agents help understand the user's intent and connect them with the services\nproviders when the off-line services are required. What we have done today is only the beginning and search\nwill continue advancing in capabilities and reach over time.\nIn these places, we are also working towards the shift from the general results to personalized -- personalized\npages. While AI search understands the individual contacts, memories and preference could generate the\ntailor-made responses delivering more intelligent and relevant and personalized answers while better\nmatching users with the tools and services they need. And looking ahead, we will continue to accelerate\ntransformation which, in the short term, will wait on our revenue. But over time, we believe that AI search will\nunlock exciting commercial possibilities and upside is substantial. Thank you for your question, Alex.\nOperator\nNext question comes from Gary Yu, Morgan Stanley. .\nGary Yu\nMorgan Stanley, Research Division\nPage 8 of 12\nI have a question regarding the AI cloud revenue. Can management provide a breakdown of the current\nrevenue mix and margin profile. What's the split between subscription based and project-based revenue?\nAnd how do you see them evolving in the coming quarters? And also what's the margin profile looking like in\nthe near term and over the long term?\nDou Shen\nExecutive VP & President of Baidu AI Cloud Group\nThank you, Gary. This is Dou. In Q2, AI cloud revenue grew 27% year-over-year to RMB 6.5 billion. For the first\nhalf of 2025 AI cloud revenue increased 34% year-over-year, accelerating from the low teens growth we saw\nin the first half of 2024. Enterprise Cloud has consistently outgrown our overall AI cloud business and\nremains the main growth driver. Then within the Enterprise Cloud, subscription-based revenue accounts for\nmore than half of the total and continued growing steadily in Q2. The growth was driven by strong\nmomentum in subscription-based AI infrastructure, which grew over 50% year-over-year.\nWe are seeing a good traction with both top-tier and mid-tier customers. Our mid-tier customers, in\nparticular, delivered notable revenue growth as they continue expanding with this. reflecting our broadening\ncustomer base. The other part of the enterprise cloud is project-based revenue. Project-based revenue is\ntypically linked to customer deployments and will inevitably fluctuate from quarter-to-quarter based on\ncontract timing and project schedules. We are currently conducting a careful review of our project portfolio\nand aim to gradually reduce the propulsion of project-based revenue for greater revenue stability.\nTurning to Personal Cloud, which is a smaller part of our overall AI cloud business. Over the recent quarters,\nwe've integrated Baidu with Wenku and launched multiple new AI features. Recently, we opened up select AI\nfeatures for free to encourage wider adoption. While this may involve some near-term trade-offs, we believe\nit helps deepen user engagement and positions us to benefit from a broader AI adoption.\nOn profitability, we achieved year-over-year growth in non-GAAP operating profit and maintained a healthy\nmargin driven by a healthier revenue mix duty towards higher value offerings, while margins can move\naround from quarter-to-quarter due to dynamic market environments, we see clear potential for the future\nimprovement over the long run as we scale and optimize our mix. Thank you Gary.\nOperator\nOur next question comes from Lincoln Kong from Goldman Sachs. .\nLincoln Kong\nGoldman Sachs Group, Inc., Research Division\nSo my question is about the search. So actually, can you management share more color on the reason AI\nsearch monetization testing because the following your earlier comments on AI search opening up new\nmonetization opportunity. Could you elaborate on that? And how are all pricing format and business model\nevolving? What will be the margin look like?\nRong Luo\nExecutive Vice President of Baidu Mobile Ecosystem Group\nThank you Lincoln, the master question is curious. I mentioned the bottom monetization opportunities\nearlier, and let me elaborate over here. And from a product set, while our air transformation already covers a\nlarge portion of search results. We are still in the early stage with substantial room for improvement. We aim\nto further increase the penetration of multi-model content search results and continue building and reaching\nour AI native ecosystem through MCP agents and on the foundation enable a deeper or broader or higher-\nquality connections to the real world services. As the transformation once and the user experience improves\nmonetization opportunities will naturally follow. And also, the AI search brings the native apps that fuels\nintuitive and integrate, enhancing rather than interacting the user experiences. So the vast majority of\nPage 9 of 12\nkeywords that were previously very difficult to monetize now can be monetized under AI search, which\nshould be significantly expand our advertisement inventory over time.\nWhile initially, we will be very conservative with monetization to ensure we get the user experience right and\nby the long-term upside is much higher. And during our transformation, we are moving from safely\ngenerating sales leads to enabling the real world service delivery -- this is a shift made possible by new AI-\nnative commercial products such as agents or digital humans. These innovative products allow us to better\ncapture and serve the user needs through interactive conversations and while connecting the users service\nproviders in verticals like health care, travel and education, where our agents and digital humans have\nalready proven for [indiscernible] capabilities and over the long term, the ability to fulfill the user needs end\nto end position us well to drive a gradual transition from CPC to CPS, which offers a much higher ceiling for\nmonetization.\nAnd in Q2, we have already begun the early testing of the AI search monetization. While it's still in early days,\nwe have seen the more encouraging signals, and we believe this stream will continue over time. that say that\nwe always pull user experiences first. So we do a very deliberate approach to AI search monetization and\nlarge-scale monetization has not started yet. And at the same time, we have been aggressively accelerating\nthe AI search transformation, including changing those queries with the highest monetization capabilities. So\nin the near term, we do expect the revenue margin will remain under significant pressure. But long term, we\nbelieve this positions us well for stronger growth. Thank you.\nOperator\nOur next question comes from the line of Miranda Zhuang with Bank of America Securities.\nXiaomeng Zhuang\nBofA Securities, Research Division\nMy question is about cloud and GPU. So how should we assess the sustainability of the AI patent cloud\ndemand especially against the backdrop of a soft economy and intensifying market competition and also\nwith the easing of the H20 chip restriction, has management seen any meaningful improvement in supply?\nHow do you think about the chip constraint? Will it remain as a limiting factor for growth going forward?\nDou Shen\nExecutive VP & President of Baidu AI Cloud Group\nMiranda, I would do questions. Actually, we were seeing strong and growing demand for AI driven cloud\nservices as the China's cloud market continues its shift towards AI centric computing. The adoption of Gen AI\nand foundation models is accelerating, and AI has become a strategic focus for more and more companies.\nFrom what we've observed, demand is picking up across a wide range of sectors, not only from early\nadopters like [ Tican ] Internet companies, but also from a broader side of the industries like utilities, financial\nservices and the public sector, where interested in AI-driven cloud solution is rising quickly.\nMeanwhile, technological advances or strong new demand from emerging sectors, such as embodied AI. We\nare effectively capturing new opportunities and working with leading players in this field, including 20 of\nChina's promising embodied AI startups and 4 which are China's top humanoid robot companies. The reason\nwe were able to capture opportunities so quickly is our unique competitive positioning. What differentiates\nus is our ability to deliver highly cost-effective end-to-end AI cloud products and solutions, thanks to our full\nstack abilities.\nTaking our AI infra as an example, we keep improving utilization and efficiency through our industry-leading\nresource management capabilities by dynamically allocating computing resources, we can better match\nworkloads with the suitable resources and manage demand fluctuations, delivering better performance at\nlower costs. As a result, we can provide cost-efficient, reliable and scalable cloud services that makes it really\neasy for companies to adopt AI with minimal effort and scale it into real business impact. On your question\nabout chips. Our focus remains on building a flexible AI architecture that maximize GPU utilization and\nPage 10 of 12\nsupports a variety of chips, including domestic chips. This enables us to better serve customers as the supply\nenvironment evolves.\nLooking ahead, we believe that a self-sufficient supply chain together with increasingly major homegrown\nsoftware stacks will form a solid foundation for sustainable innovation in China's ecosystem. And clearly,\nBaidu is well positioned to lead the transition. Thank you.\nOperator\nNext question comes from Wei Xiong, UBS.\nWei Xiong\nUBS Investment Bank, Research Division\nGiven the near-term headwinds on ad revenue, and continued investment in AI. I wonder what are the plans\nfor cost optimization and efficiency improvement that can help protect margins? How should we think about\nthe margin trend in 2026 and beyond.\nHaijian He\nChief Financial Officer\nThank you. This is Henry. First of all, on the AI investment, we remain committed to investing in AI and have\nmade substantial investments throughout this year particularly in AI transformation of search. As Juan\nmentioned earlier, our core legacy product search is ongoing a radical transformation. Over the past several\nquarters, we have ramped up investments to accelerate this transformation, which we believe is critical to\ndrive long-term value. However, since the AI search monetization is still in very early stages and has yet to\nscale, our revenue and margins are on the considerable pressure in the near term with Q3 expected to be\nespecially challenging. To help pushing the near-term impact, we will actively drive internal efficiency gains.\nThis includes strengthening resource coordination efforts across different business groups and improving\noverall resource utilization efficiency.\nBut also on the other hand, while we are remaining committed to long-term AI investment, we'll be very\nprudent in managing the pace to avoid future deterioration of fluctuation in margins. Looking further ahead,\nwe see potential for margin improvement as our core advertising business recovers and stabilized and our\nnon-advertising business both expand their revenue share and improving their own profitability. We believe\nour strategic direction and the disciplined execution should support a gradual recovery in profitability over\ntime. Obviously, on the outlook front, I think before or around end of this year, we expect to have a greater\nvisibility into next year. And at that time, we will have -- we will provide a clear outlook beyond the current\nquarters for the long term.\nIn parallel, we are carefully assessing different approaches to present and to unlock the hidden and unstated\nvalue of our assets. By doing so, we aim to strengthen our portfolio, create significant long-term value for\nshareholders, but also support sustainable growth over the long term of business. Thank you.\nOperator\nThe next question comes from Thomas Chong, Jefferies.\nThomas Chong\nJefferies LLC, Research Division\nMy question is about the global autonomous driving landscape. We see it becomes increasingly competitive -\n- how does Apollo Go assess its long-term differentiation against peers? And how do the recent Uber and its\npartnership fits into your global expansion strategy? And what is the road map for achieving sustainable\nprofitability .\nPage 11 of 12\nYanhong Li\nCo-Founder, Chairman & CEO\nYes. I think autonomous driving is 1 of the most exciting frontiers where AI is transforming the physical\nworld. and success in this field requires cutting-edge technology, massive sustained investment and\ndisciplined execution over many years to achieve commercial operations at scale. One of the earliest\nentrants, we have built an unparalleled foundation across all these areas and become an undisputed global\nleader in this field. With our business model validated, our current focus is on running real-world operations\nat scale. And we have established global leadership in both left-hand and the right-hand drive robotaxi\nmarket. In the left-hand drive market, we were the first to achieve UE breakeven and all of our current\noperations in China, in Mainland China are fully driverless.\nGlobally, we are among the very few capable of scaled fully driverless and commercial operations in a single\ncomplex, large population area. And in the right-hand drive market, we lead the industry globally. In Hong\nKong, we've rapidly expanded our operating of testing and advanced into increasing the complex urban\nscenarios following regulatory approval. Our technology stack and operational expertise are highly\ntransferable across geographies, allowing us to adapt efficiently to new markets and regulatory environment.\nWe also built a major advantage with RT6, the world's first and only production vehicle designed especially\nfor level 4 autonomous driving from day one. Unlike some retrofitted cars, RT6 is a perfect speed from the\nground up is a focus on safety system integration and cost efficiency. It has the lowest unit cost globally for\nLevel 4 and is already running on our commercial operations at scale, giving us a big edge for broader\nrollouts with this strength, we are confident about expanding to more cities worldwide, especially those with\nhigher ride fares.\nHere's the picture. We have the lowest cost level 4 vehicle and most efficient operation. We first achieved UE\nbreakeven in Wuhan where taxi fares over 30% cheaper than the Tier 1 cities in China and far below many\noverseas markets. Yet we still managed to prove [indiscernible] model there. Such operational excellence and\ncost efficiency is unmatched globally. For us, expanding overseas means going from low fare markets to high\nfare markets. opening fare several times higher. Our huge cost advantage can deliver much stronger unit\neconomics in most major cities worldwide.\nTo accelerate our global expansion, we are also taking a proactive approach to global partnerships. As we\nmentioned in our prepared remarks, we announced a partnership with Uber in July and followed by Lyft in\nAugust. Our partnerships with this world's leading mobility platforms will help us enter and scale more\nquickly into global markets like Middle East, like Asia and Europe. Looking ahead, we anticipate accelerating\ngrowth in ride volumes with our global operational fleet size multiply. With that momentum, we are confident\nthat Apollo Go will continue to lead the market and stay at the forefront of autonomous driving worldwide.\nThank you.\nOperator\nThat does conclude our conference for today. Thank you for participating. You may now disconnect.\nCopyright © 2025 by S&P Global Market Intelligence, a division of S&P Global Inc. All rights reserved. These materials have been prepared solely for information purposes based upon information generally available to the public and from sources\nbelieved to be reliable. No content (including index data, ratings, credit-related analyses and data, research, model, software or other application or output therefrom) or any part thereof (Content) may be modified, reverse engineered, reproduced or\ndistributed in any form by any means, or stored in a database or retrieval system, without the prior written permission of S&P Global Market Intelligence or its affiliates (collectively, S&P Global). The Content shall not be used for any unlawful or\nunauthorized purposes. S&P Global and any third-party providers, (collectively S&P Global Parties) do not guarantee the accuracy, completeness, timeliness or availability of the Content. S&P Global Parties are not responsible for any errors or\nomissions, regardless of the cause, for the results obtained from the use of the Content. THE CONTENT IS PROVIDED ON \"AS IS\" BASIS. S&P GLOBAL PARTIES DISCLAIM ANY AND ALL EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,\nANY WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE OR USE, FREEDOM FROM BUGS, SOFTWARE ERRORS OR DEFECTS, THAT THE CONTENT'S FUNCTIONING WILL BE UNINTERRUPTED OR THAT THE CONTENT WILL OPERATE\nWITH ANY SOFTWARE OR HARDWARE CONFIGURATION. In no event shall S&P Global Parties be liable to any party for any direct, indirect, incidental, exemplary, compensatory, punitive, special or consequential damages, costs, expenses, legal fees, or\nlosses (including, without limitation, lost income or lost profits and opportunity costs or losses caused by negligence) in connection with any use of the Content even if advised of the possibility of such damages. S&P Global Market Intelligence's opinions,\nquotes and credit-related and other analyses are statements of opinion as of the date they are expressed and not statements of fact or recommendations to purchase, hold, or sell any securities or to make any investment decisions, and do not address\nthe suitability of any security. S&P Global Market Intelligence may provide index data. Direct investment in an index is not possible. Exposure to an asset class represented by an index is available through investable instruments based on that index. S&P\nGlobal Market Intelligence assumes no obligation to update the Content following publication in any form or format. The Content should not be relied on and is not a substitute for the skill, judgment and experience of the user, its management,\nemployees, advisors and/or clients when making investment and other business decisions. S&P Global Market Intelligence does not act as a fiduciary or an investment advisor except where registered as such. S&P Global keeps certain activities of its\ndivisions separate from each other in order to preserve the independence and objectivity of their respective activities. As a result, certain divisions of S&P Global may have information that is not available to other S&P Global divisions. S&P Global has\nestablished policies and procedures to maintain the confidentiality of certain nonpublic information received in connection with each analytical process. S&P Global may receive compensation for its ratings and certain analyses, normally from issuers\nor underwriters of securities or from obligors. S&P Global reserves the right to disseminate its opinions and analyses. S&P Global's public ratings and analyses are made available on its Web sites, www.standardandpoors.com (free of charge), and\nwww.ratingsdirect.com and www.globalcreditportal.com (subscription), and may be distributed through other means, including via S&P Global publications and third-party redistributors. Additional information about our ratings fees is available at\nwww.standardandpoors.com/usratingsfees.\nPage 12 of 12"}, "content_hash": "e9112a77a22d13eb5aad3400f979a424bb1a894de46d5b345b9fbc0df3965d09", "transcript_name": "BIDU - ET_E_document_dated_20-08-2025 (1).json"}