{"validated_at": "2025-12-02T08:02:28.257030", "input": {"call_type": "earnings", "summary_length": "long", "answer_format": "bullet", "filename": "Fortinet, Inc., Q2 2025 Earnings Call, Aug 06, 2025 – Fortinet Inc. – BamSEC.pdf"}, "transcripts": {"presentation": "Fortinet, Inc., Q2 2025 Earnings Call, Aug 06,\n2025\nEdited Transcript of Fortinet, Inc. Earnings Call Wednesday, August 06, 2025 at 08:30:00PM GMT\nCorporate Participants\nAaron Ovadia Fortinet, Inc. – Senior Director of Investor Relations\nChristiane Ohlgart Fortinet, Inc. – Chief Accounting Officer, CFO and Principal Financial & Accounting Officer\nJohn Whittle Fortinet, Inc. – Chief Operating Officer\nKen Xie Fortinet, Inc. – Co-Founder, Chairman & CEO\nConference Call Participants\nAndrew James Nowinski Wells Fargo Securities, LLC, Research Division – Senior Equity Analyst\nBrian Lee Essex JPMorgan Chase & Co, Research Division – Executive Director of U.S. Software Equity\nResearch\nEric Michael Heath KeyBanc Capital Markets Inc., Research Division – VP & Equity Research Analyst\nGabriela Borges Goldman Sachs Group, Inc., Research Division – Analyst\nJunaid Hamid Siddiqui Truist Securities, Inc., Research Division – Associate\nPatrick Edwin Ronald Colville Scotiabank Global Banking and Markets, Research Division – Director and Equity\nResearch Analyst\nRobbie David Owens Piper Sandler & Co., Research Division – MD & Senior Research Analyst\nSaket Kalia Barclays Bank PLC, Research Division – Senior Analyst\nShaul Eyal TD Cowen, Research Division – MD & Senior Analyst\nShrenik Kothari Robert W. Baird & Co. Incorporated, Research Division – Senior Research Analyst\nTal Liani BofA Securities, Research Division – MD, Head of Technology Supersector & Senior Analyst\nPresentation\nOperator\nHello, and welcome to Fortinet Second Quarter 2025 Earnings Conference Call. [Operator Instructions] Please be\nadvised that this call is being recorded.\nI would now like to hand the call over to Aaron Ovadia, Senior Director of Investor Relations. Please go ahead.\n11/08/2025, 14:23\nFortinet, Inc., Q2 2025 Earnings Call, Aug 06, 2025 – Fortinet Inc. – BamSEC\nhttps://www.bamsec.com/transcripts/53dc461c-2163-4b7b-beed-11b80548f66d\n1/18\nAaron Ovadia Fortinet, Inc. – Senior Director of Investor Relations\nThank you, and good afternoon, everyone. I am pleased to welcome everyone to our call to discuss Fortinet's\nfinancial results for the second quarter of 2025.\nJoining me on today's call are Ken Xie, Fortinet's Founder, Chairman and CEO; Christiane Ohlgart, our CFO; and\nJohn Whittle, our COO. Ken will begin our call today by providing a high-level perspective on our business,\nChristiane will then review our financial results for the second quarter of 2025, before providing guidance for the\nthird quarter and updating the full year. We will then open the call for questions. [Operator Instructions]\nBefore we begin, I'd like to remind everyone that on today's call, we will be making forward-looking statements,\nand these forward-looking statements are subject to risks and uncertainties, which could cause actual results to\ndiffer materially from those projected. Please refer to our SEC filings, in particular, the Risk Factors in our most\nrecent Form 10-K and Form 10-Q for more information. All forward-looking statements reflect our opinions only\nas of the date of this presentation, and we undertake no obligation and specifically disclaim any obligation to\nupdate forward-looking statements.\nAlso, all references to financial metrics that we make on today's call are non-GAAP, unless stated otherwise. Our\nGAAP results and GAAP to non-GAAP reconciliations are located in our earnings press release and in the\npresentation that accompany today's remarks, both of which are posted on our Investor Relations website.\nAs a reminder, this is a live call that will be available for replay via webcast on our Investor Relations website. The\nprepared remarks will also be posted on the quarterly earnings section of our IR website following today's call.\nLastly, all references to growth are on a year-over-year basis, unless noted otherwise.\nI will now turn the call over to Ken.\nKen Xie Fortinet, Inc. – Co-Founder, Chairman & CEO\nThank you, Aaron, and thank you to everyone for joining our call. We are pleased with our strong second quarter\nperformance beating both our billing and operating margin guidance. Building on this business momentum, we\nare reaching our full year billing outlook. In the second quarter, billing grow by 15% and revenue grew by 14%, and\nwe achieved a strong non-GAAP operating margin of 33%.\nOur strong top line results were driven by continued momentum among large enterprise customers with a total\nvalue of deal over $1 million increased by more than 50%. This growth reflects the strength and value of our\ninnovation, the recent global demand of our integrated solution and the impact of go-to-market investment.\nAdditionally, our recent investment in the fast-growing market of unified SASE and AI-driven secure operations\nare continuing to deliver strong return as billing for both grew over 20% to a combined 35% of total billings.\nFortinet's strong momentum in SASE has been recognized by industry analysts as we are recently named a\nleader in the 2025 Gartner Magic Quadrant for SASE platform, while also ranking #1 in a Secure Branch Network\nMonetization case. We are the only vendor in the report that is also recognized in 5 different network security\nMagic Quadrant, which all run on a unified FortiOS.\nWe continue to be the only vendor that has developed all core SASE capability in a single operation system, the\nFortiOS, including New-Gen Firewall, SD-WAN, ZTNA, Secure Web Gateway, CASB and DLP. This native integrate\nof Nex-Gen Firewall, SD-WAN and SASE has become new generation SASE firewall, making it easy for customers\nto adopt an upgrade while reducing capacity and operation cost, enhancing user experience and ensure\nintegrated hybrid secure access across both on-premise and cloud environment.\n11/08/2025, 14:23\nFortinet, Inc., Q2 2025 Earnings Call, Aug 06, 2025 – Fortinet Inc. – BamSEC\nhttps://www.bamsec.com/transcripts/53dc461c-2163-4b7b-beed-11b80548f66d\n2/18\nOur success in Unified SASE reflect the value customer placed in our new generation SASE firewall, beginning\nwith their investment in our industry-leading FortiGate firewall build on our FortiASIC from their most large\nenterprise expanding into a secure SD-WAN capability before advancing to a FortiSASE solution. As a result, 13%\nof large enterprise customers have purchased FortiSASE and increased over 60% year-over-year.\nFurthermore, we have invest around $2 billion to build and operate a global own infrastructure. Spending around\n5 million square feet across data centers, NOC and SOCs customer supporting centers, executive briefing\ncenters and the research and development facility. This large-scale footprint give us a competitive advantage in\ndelivering FortiSASE, FortiCloud and other cloud services by owning and manage our infrastructure we ensure\nbetter customer experience, better cost efficiency, strong data sovereignty and high performance and scale.\nWe also leveraged our Fortistack technology to provide enhanced security and better management across our\nSaaS services. Today, we announced -- we are expanding our FortiCloud offering with 3 new services, the\nFortiIdentity, FortiDrive and FortiConnect. These services natively integrate into the Fortinet Security Fabric\nproviding centralized visibility, consistent policy enforcement and real-time threat protection across users,\ndevices, applications, data and AI agents. In OT security, while we are achieving billing growth of over 20%, we\nhave recently named the overall leader in the Westland Advisor IT and OT Network Protection Platform Navigator\n2025 report.\nFor the third time in a row, earning the highest ranking in both strategic direction and technical capability. We\ncontinue to invest in AI, which we began developing more than 15 years ago and hold over 500 issued and\npending AI patent more than any other competitors. Our latest innovation, including FortiAI-Protect for advanced\nthreat detection, FortiAI-Assist for automating security task and FortiAI-SecureAI for protecting AI infrastructure.\nAs a result of our investment and recent innovations, our AI add-on solution are the fastest growing part of our\nbusiness.\nI would like to thank our employees, customers, partners and suppliers worldwide for the continuous support and\nhard work. I will now turn the call over to Christiane.\nChristiane Ohlgart Fortinet, Inc. – Chief Accounting Officer, CFO and Principal\nFinancial & Accounting Officer\nThank you, Ken. Thank you, Aaron, and good afternoon, everyone. As Ken mentioned, Fortinet's growth and\nmomentum are strong. We beat our billings and operating margin guidance for the second quarter and raised our\nfull year billings outlook. Total billings grew by 15% to $1.78 billion, driven by 21% growth in Unified SASE and\n31% growth in SecOps. Unified SASE and SecOps now account for 24% and 11% of total billings, respectively, up\n1 point each.\nOur strong billings growth was driven by continued momentum in expanding into the large enterprise as the\nnumber of deals greater than $1 million increased by 29%, while their total dollar value grew by 51%. Among our\ntop 5 verticals, financial services, the vertical with arguably the most sophisticated and discerning security\npurchases led the way with billings growth of over 30%.\nIn addition, we continue to expand our customer base. Over 6,900 new organizations chose our unified single\nFortiOS platform to power their cybersecurity strategy. The robust growth in new customers is a clear testament\nto our strong position in the SMB market, driven by the continued commitment and loyalty of our channel\npartners.\nTotal RPO grew by 12% to $6.64 billion, while current RPO grew by 15% to $3.45 billion. With regards to ARR,\nUnified SASE increased by 22% to $1.15 billion and SecOps increased by 35% to $463 million. Within Unified\nSASE, FortiSASE, our SSE solution delivered strong results with ARR growth of over 100%, while the customer\n11/08/2025, 14:23\nFortinet, Inc., Q2 2025 Earnings Call, Aug 06, 2025 – Fortinet Inc. – BamSEC\nhttps://www.bamsec.com/transcripts/53dc461c-2163-4b7b-beed-11b80548f66d\n3/18\nbase expanded by 65%. Furthermore, adoption momentum has remained strong as 13% of our large enterprise\ncustomers have purchased FortiSASE, highlighting our continued expansion of FortiSASE in our customer base.\nAs a reminder, the typical customer journey begins with the purchase of our FortiGate firewall. From there,\ncustomers often expand to our integrated secure SD-WAN solution before adopting our single vendor SASE\noffering, reflecting the growing convergence of security and networking. Over 50% of our FortiSASE customers\nalso leverage our SD-WAN solution, while 90% of our large enterprise FortiSASE customers began their journey\nwith SD-WAN, reflecting the value of our integrated platform approach and the convergence of security and\nnetworking.\nTotal revenue grew by 14% to $1.63 billion, led by EMEA with growth of 18%, while the Americas and APAC both\ngrew 11%. Product revenue increased by 13% to $509 million, benefiting from upgrade buying and strong growth\nin operational technology. We saw growth in all geos as we continue to lead the cybersecurity industry and\nproduct revenue.\nSoftware license revenue grew at a high teens rate and accounted for a high teens percentage of total product\nrevenue. Service revenue grew by 14% to $1.12 billion. Service billings grew by 17%, our highest growth rate in\nthe past 6 quarters, reflecting many enterprise agreement renewals as our loyal customers continue to invest in\nour solutions and benefit from our strong track record of innovation.\nNow I'd like to highlight some 7-figure deals that demonstrate how customers are adopting FortiSASE,\nconsolidating networking and security and expanding their overall footprint with Fortinet. First, an educational\ninstitution in APAC purchased solutions across all 3 of our pillars, including FortiSASE for 3,000 users. This\ncustomer chose Fortinet over the competition for our simplified, flexible and consistent security enforcement,\nenabling secure access to both on-premises and cloud applications while delivering a seamless user experience.\nBy leveraging FortiOS and FortiSASE, the school achieves superior performance, reduced total cost of ownership\nand simplified operations through our integrated security platform.\nNext, in an expansion and displacement deal, a leading retailer with 1,700 locations significantly increased the\ninvestment in Fortinet purchasing solutions across all 3 pillars, including 40 APs, 40 switches and 40 AIOps.\nAlready a FortiGate customer with firewalls deployed at every location, the retailer selected APs for all sites and\nFortiSwitches for 600 locations, with the remainder planned for early 2026.\nThis customer chose Fortinet for our integrated FortiOS operating system which enables seamless convergence\nof networking and security. As part of the deployment, they adopted FortiAIOps to proactively manage their\naccess points and switches, leveraging our AI-driven capabilities to improve operational efficiency.\nIn another large deal, a top U.S. school district expanded its footprint with the purchase of FortiGates,\nFortiSwitches and FortiAPs as part of a 350-plus site refresh, displacing multiple vendors, already utilizing\nsolutions across all 3 of our pillars, including FortiSASE, the district continues to invest in Fortinet to drive deeper\nnetwork segmentation stronger security outcomes and greater infrastructure resiliency. Due to their continued\nconsolidation on Fortinet products, they are realizing significant operational benefits, including simplified guest\naccess, accelerated deployments and more efficient upgrade cycles all managed through our Unified FortiOS\nplatform.\nLastly, a technology company upgraded a portion of the high-end firewalls as a result of the upcoming 2026 end-\nof-support deadline and expanded their deployment with additional FortiGate appliances in the data center. They\nselected Fortinet for our FortiOS operating system which enables streamlined operations while delivering a lower\ntotal cost of ownership.\nTurning to margins and cash flow. Total gross margin increased by 10 basis points to 81.6% and exceeded the\nhigh end of the guidance range by 60 basis points due to strong execution and cost control. Product gross\nmargin of 67.8% increased by 180 basis points as inventory-related charges normalized. Service gross margin of\n11/08/2025, 14:23\nFortinet, Inc., Q2 2025 Earnings Call, Aug 06, 2025 – Fortinet Inc. – BamSEC\nhttps://www.bamsec.com/transcripts/53dc461c-2163-4b7b-beed-11b80548f66d\n4/18\n87.8% was down by 80 basis points due to increased investments associated with the expansion of our hosted\nsecurity solutions.\nOperating margin of 33.1% decreased by 200 basis points, while being 60 basis points above the high end of our\nguidance range. The year-over-year decline reflects increased investments in sales headcount, the absorption of\ncosts from recent acquisitions and foreign exchange headwinds stemming from a weaker U.S. dollar as most of\nour operating expenses are denominated in foreign currencies.\nFree cash flow was $284 million and adjusted free cash flow was $428 million, up $104 million. Cash generation\nin the first half of the year was very strong with adjusted free cash flow reaching $1.27 billion, representing a\nmargin of 40% year-to-date. Infrastructure investments were $168 million, up $145 million as we continue to\nbuild out our infrastructure footprint to support FortiSASE, FortiCloud and other services.\nWe repurchased approximately 4.6 million shares of our common stock for an aggregate cost of $401 million in\nthe second quarter. The remaining share buyback authorization as of today is approximately $1.6 billion.\nBefore moving on to guidance, I'd like to provide an update on our firewall upgrade cycle and the broader macro\nenvironment. During our Analyst Day last November, we shared that approximately 650,000 firewall units will\nreach end of service by the end of 2026, followed by another cohort of 350,000 low-end units in '27.\nWhile the 2027 cohort is less significant than the 2026 cohort in terms of product revenue due to its lower price\npoint, firewall upgrade discussions offer valuable opportunities to engage with both, our customers and channel\npartners, allowing us to showcase our ongoing innovation in FortiOS. By upgrading to our new generation SASE\nfirewalls, customers gain enhanced security capabilities and benefit from our Unified platform approach.\nWe estimate that we are approximately 40% to 50% of the way through the 2026 upgrade cycle at the end of the\nsecond quarter based on the remaining active units and service contracts, and we expect continued upgrade\nactivity for the remaining devices over the next 6 quarters. Our focus and open communication regarding the\nrefresh allow us and our channel partners to have conversations with our customers around both the upgrade\nand the customers' overall security strategy, benefiting us longer term.\nDespite ongoing uncertainty surrounding tariffs and the global economic outlook, we have not experienced a\nnegative impact on our business. The cybersecurity market and the demand for our solutions remains strong and\nresilient.\nNow moving on to guidance. As a reminder, our third quarter and full year outlooks, which are summarized on\nSlide 17 and 18 are subject to the disclaimers regarding forward-looking information that Aaron provided at the\nbeginning of the call. For the third quarter, we expect billings in the range of USD 1.76 billion to USD 1.84 billion,\nwhich at the midpoint represents growth of 14%. Revenue in the range of USD 1.67 billion to USD 1.73 billion,\nwhich at the midpoint represents growth of 13%. Non-GAAP gross margins of 80% to 81%, non-GAAP operating\nmargin of 32.5% to 33.5%. Non-GAAP earnings per share of $0.62 to $0.64, which assumes a share count\nbetween 772 million and 776 million.\nInfrastructure investments of $110 million to $130 million. A non-GAAP tax rate of 18%, cash taxes of $60 million\nto $90 million. As a result of our strong results in the first half of the year, we are pleased to have raised the\nmidpoint of our full year billings guidance by $100 million. We maintained our total revenue guidance while\nadjusting the revenue mix by shifting $50 million from service to product revenue.\nDespite the shift towards product revenue for the full year, we maintained our gross margin range and slightly\nincreased our operating margin guidance midpoint. We continue to remain on track to achieve the Rule of 45 in\n2025 for the sixth consecutive year.\n11/08/2025, 14:23\nFortinet, Inc., Q2 2025 Earnings Call, Aug 06, 2025 – Fortinet Inc. – BamSEC\nhttps://www.bamsec.com/transcripts/53dc461c-2163-4b7b-beed-11b80548f66d\n5/18\nFor the full year, we expect billings in the range of USD 7.325 billion to USD 7.475 billion, which at the midpoint\nrepresents growth of 13%. Revenue in the range of USD 6.675 billion to USD 6.825 billion, which at the midpoint\nrepresents growth of 13% (sic) [ 13.3% ]. Service revenue in the range of $4.55 billion to $4.65 billion, which at the\nmidpoint represents growth of 14%.\nNon-GAAP gross margin of 79% to 81%, non-GAAP operating margin of 32% to 33.5%. Non-GAAP earnings per\nshare of $2.47 to $2.53 which assumes a share count of between 773 million and 777 million. Infrastructure\ninvestments of $380 million to $430 million. A non-GAAP tax rate of 18% and cash taxes of between $400 million\nto $450 million, which is $125 million lower than our prior expectation, primarily due to new tax law changes.\nI now hand the call back over to Aaron to begin the Q&A session.\nAaron Ovadia Fortinet, Inc. – Senior Director of Investor Relations\nThank you, Christiane. [Operator Instructions] Operator, please open the line for questions. .", "q_a": "Questions and Answers\nOperator\n[Operator Instructions] Our first question will come from Shaul Eyal from TD Cowen.\nShaul Eyal TD Cowen, Research Division – MD & Senior Analyst\nCongrats on the improved outlook for the year. Ken, Christiane, one of the questions we are constantly receiving\nfrom investors is whether sales of FortiSASE potentially cannibalize the core appliance business but it would\nappear we are currently seeing tailwinds across both these segments. Can you help us maybe reconcile these\nviews?\nKen Xie Fortinet, Inc. – Co-Founder, Chairman & CEO\nYes, I think probably, we do see customer expanding beyond the traditional firewall and -- but also traditional\nfirewall is still the important control point for all this traffic, especially within the enterprise, within the data\ncenter. On the other side, some supporting whether work from home or traveling or some other branch office,\nthat's also kind of a certain SASE and especially certain like OT/IoT use case, we see a way beyond the\ntraditional network security there. So we don't see SASE replacing the firewall. We just see is keeping enhancing.\nThat's what we call the SASE firewall. It's really the firewall itself need to keep adding new function like from 25\nyears ago, when we started Fortinet, the new generation of firewall add like application control, like intrusion\nprevention, like antivirus in the traditional for VPN.\nNow the traditional firewall also need additional like a SASE function together with some other edge device like\nFortiAP, FortiSwitch and also endpoint device and also the cloud deployment. So that's from the whole protection\ninfrastructure, which is really give much better security for the enterprise user. .\n11/08/2025, 14:23\nFortinet, Inc., Q2 2025 Earnings Call, Aug 06, 2025 – Fortinet Inc. – BamSEC\nhttps://www.bamsec.com/transcripts/53dc461c-2163-4b7b-beed-11b80548f66d\n6/18\nChristiane Ohlgart Fortinet, Inc. – Chief Accounting Officer, CFO and Principal\nFinancial & Accounting Officer\nLet me add to what Ken just said. In our win-loss analysis, we see very little reason codes for customers moving\nto the cloud and not continuing to buy. So I think it's an expansion. It's not a replacement sale.\nJohn Whittle Fortinet, Inc. – Chief Operating Officer\nAnd to your point, we see both markets growing. And then if you look at the market share, they're very\nfragmented markets on the firewall side. And so we can grow both by the market growing on the firewall side and\nexpanding our market share by taking business from other competitors.\nShaul Eyal TD Cowen, Research Division – MD & Senior Analyst\nUnderstood. And Christiane, thank you so much for the color about where we stand in a refresh cycle. Maybe a\nlittle bit of a long-term view of kind of already touching on the fiscal '27 cohort of products that will be refreshed.\nAre there any specificities associated with those family of products as we think about the 2027, which is coming\nto a renewal or a refresh?\nChristiane Ohlgart Fortinet, Inc. – Chief Accounting Officer, CFO and Principal\nFinancial & Accounting Officer\nYes. I think I've shared that in previous meetings potentially, that 2027 cohort is the low end of the low end. So it's\nnot -- unit-wise, it's significant. Product revenue wise, it's not as significant but that's why we included the\nmessage in my remarks, it's significant because we can talk to a lot of customers about where the security is\ngoing, right? And so that's where it provides a lot of upsell potential for us.\nOperator\nOur next question comes from Brian Essex with JPMorgan.\nBrian Lee Essex JPMorgan Chase & Co, Research Division – Executive Director of\nU.S. Software Equity Research\nMaybe Christiane, I was wondering if you could tell us what are some of the maybe untapped the services\nguidance a little bit. It's great to see the upside in the quarter, particularly with regard to product billings and\nservices strength this quarter. But how should we, I guess, -- what can we take away from the services guide?\nAnd what's embedded in the guidance for the year given the strength that you're seeing this quarter?\nChristiane Ohlgart Fortinet, Inc. – Chief Accounting Officer, CFO and Principal\nFinancial & Accounting Officer\nSo it -- the services billings to revenue conversion takes a little bit longer, right? And that's what we are seeing\nbased on the remaining waterfall. We are pleased with our current RPO growth. But for the rest of the year, we\ndecided to be prudent, take the midpoint down but we believe that we are not -- we are confident that the product\nrevenue is going to be stronger for the rest of the year based on the pipeline.\n11/08/2025, 14:23\nFortinet, Inc., Q2 2025 Earnings Call, Aug 06, 2025 – Fortinet Inc. – BamSEC\nhttps://www.bamsec.com/transcripts/53dc461c-2163-4b7b-beed-11b80548f66d\n7/18\nKen Xie Fortinet, Inc. – Co-Founder, Chairman & CEO\nYes. Also probably last quarter, it's the first time in the last few years, the product revenue growth starting faster\nnow. it's more like 4 years ago, like 2021, not in the product revenue growth we very fast, and then that gave us\nkind of benefit in the last few years, the service revenue still maintain a pretty healthy level, even the product\nrevenue going down in the last 1 to 2 years. Now we see the product revenue sitting accelerating which will be\nthe leading indicator for the future service revenue which we also view since starting turnaround, especially in\nboth the product revenue and also the service revenue starting kind of instead of keeping dropping gradually\nprobably will be starting picing up.\nBrian Lee Essex JPMorgan Chase & Co, Research Division – Executive Director of\nU.S. Software Equity Research\nAnd do you have the split FortiGuard, FortiCare? And is this a component of, like if you have a refresh? Obviously,\nis it that customers aren't completely replacing their subscription revenue? They're just extending their\nsubscription revenue with maybe less upside to that revenue line item? I mean so you have -- with a new box with\nthe same attached revenue.\nChristiane Ohlgart Fortinet, Inc. – Chief Accounting Officer, CFO and Principal\nFinancial & Accounting Officer\nCorrect. So that's part of it. I think there's part of it that the devices that they're using to replace, they may use a\nhigher box, but they can consolidate 1 to 2 boxes, right? So it's different components that, that factor into the\nservice revenue attached to the boxes, and this is where it's so critical for us to upsell not only SASE, but all our\nother revenue streams that benefit the customer. And based on the customer journeys, you can see -- the\ncustomer journeys work, right? The upsell is working. It's just not necessarily at the same point in time when they\nbuy a firewall.\nOperator\nNext question comes from Tal Liani with Bank of America.\nTal Liani BofA Securities, Research Division – MD, Head of Technology Supersector\n& Senior Analyst\nNow I have unmuted myself, can you hear me?\nKen Xie Fortinet, Inc. – Co-Founder, Chairman & CEO\nYes, that's great.\nTal Liani BofA Securities, Research Division – MD, Head of Technology Supersector\n& Senior Analyst\nOkay. Sorry. The SASE, the profile of SASE customers, what is it? Meaning, are these displacements of existing\nvendors, let's say, a customer has Zscaler or Palo Alto and you're displacing them? Are these -- do they purchase\n11/08/2025, 14:23\nFortinet, Inc., Q2 2025 Earnings Call, Aug 06, 2025 – Fortinet Inc. – BamSEC\nhttps://www.bamsec.com/transcripts/53dc461c-2163-4b7b-beed-11b80548f66d\n8/18\nat the end of contract that they had before with someone else? Or are these completely greenfield. They didn't\nhave anything before. Now they're having. I'm just trying to understand where you have success with your SASE.\nWhat is kind of the profile of the deployment, the types of deployments you're seeing?\nKen Xie Fortinet, Inc. – Co-Founder, Chairman & CEO\nBoth. From our current customer base, a lot of them, they do see the new operation system gave them a SASE\ncapability, both the software and hardware. So that's where they start to enable the SASE. You can see the Slide 4\nin the presentation, that's how we did in the SD-WAN a few years ago. Now the SASE become a fast-growing part\nof the business there, especially come from the current installation base. But we also see quite a few very\nsuccessful case replacing competitor because we also -- because we offer all these kind of integrated SASE\nsolution, and some of our partners, especially service providers also like this kind of a single OS solution. So\nstarting to call SASE firewall basically, just like how next-gen firewall starting replacing the traditional firewall.\nThe SASE firewall was starting to replace in not just next-gen firewall, but also on the SASE.\nBecause a lot of customers they view SASE, just like a few years ago, like sandbox like 20 years ago intrusion\nprevention starting from separate solutions, now they want to have integrated solutions with whatever the\nnetwork security infrastructure technology they have. So once the integrated solution in place, the single solution\nstarting kind of lost their edge and also starting kind of huge disadvantage for actual management cost for all\nthe actual costs basically. So that's we see a lot of customers love the -- love all this SASE firewall solution\nwithout the integrated solution together. So that we see both the current customer base and a lot of other\ncustomers from competitors to quickly adopt this new solution, and this is the fast-growing part of our business\nright now.\nTal Liani BofA Securities, Research Division – MD, Head of Technology Supersector\n& Senior Analyst\nYou said in the past that 95% of the customers are existing firewall customers, is still the case?\nChristiane Ohlgart Fortinet, Inc. – Chief Accounting Officer, CFO and Principal\nFinancial & Accounting Officer\nPretty much, yes.\nKen Xie Fortinet, Inc. – Co-Founder, Chairman & CEO\nYes, over 90% come from the current customer base, but we do see some other customer, which using our\ncompetitors' solution also changing to our solution now.\nTal Liani BofA Securities, Research Division – MD, Head of Technology Supersector\n& Senior Analyst\nGot it. If I can squeeze in one more. If not, we can move on. But I want to ask about the margins. You said in the\npast that you want to invest. What is the margin outlook? And where is the balance between investments and\nmargin upside?\n11/08/2025, 14:23\nFortinet, Inc., Q2 2025 Earnings Call, Aug 06, 2025 – Fortinet Inc. – BamSEC\nhttps://www.bamsec.com/transcripts/53dc461c-2163-4b7b-beed-11b80548f66d\n9/18\nKen Xie Fortinet, Inc. – Co-Founder, Chairman & CEO\nYes, we like to play the long-term game. Same just like the SASE, as we did in the firewall market, which we are\nthe only 1 building ASIC chip. So for SASE, we also invest in the infrastructure, which has a much better cost\nadvantage also more secure compared to leverage some other third party. So that's where we do believe if a\nlong-term SASE kind of -- if our own infrastructure, like 70% of traffic, then 30% in certain locations still using third\nparty. That will be the best cost model, even in the first few years, many more investment.\nBut long term, both customers or partners ourselves will benefit, so that's where we do believe we have a very\nhealthy margin. And this model, long-term game will also benefit both ourselves and our customers, both short\nterm and long term.\nOperator\nOur next question comes from Gabriela Borges with Goldman Sachs.\nGabriela Borges Goldman Sachs Group, Inc., Research Division – Analyst\nKen and Christiane, I wanted to follow up on your prepared remarks that we are 40% to 50% through the 2026\nrefresh cohort. What I wanted to understand is how to think about your growth rate through cycles? Because if I\ncan pay a billings growth what you're guiding to this year, it's about similar to what you guided to and what you\nachieved in 2023? The 2025 is a really big or larger than normal refresh cohort. So I want to better understand\nwhy are we not seeing more upside in the numbers this year from the refresh cohort? And the comment earlier\non potentially consolidating down boxes. Is it possible that perhaps customers have excess capacity in their\nnetworks from a 2021 COVID-type elevated throughput environment? Would love to hear your thoughts.\nChristiane Ohlgart Fortinet, Inc. – Chief Accounting Officer, CFO and Principal\nFinancial & Accounting Officer\nGabriela, good points. I think we need to look at it by FortiGate model. And the large firewalls that are end of\nsupport. We have a really good reporting and handle on because we know where they are. These are always with\nenterprise customers, right? We have a good handle on the lower end of the firewalls where it's with enterprise\ncustomers in retail or other scenarios, OT scenarios, where it's harder for us to predict. And we can only track\nregistration rates and similar is in the lower end.\nAnd there could be some excess capacity from prior years that has been replaced or -- that is replacing some of\nthe EOS models. We are comfortable with our guidance. But yes, the expectations by the Street might have been\na little bit higher, but we said we are outperforming the market, and it was baked in, right? So we've been\nconsistent in our messaging here.\nKen Xie Fortinet, Inc. – Co-Founder, Chairman & CEO\nYes. Also the -- the refresh upgrade of the product go out next year, is the product really been like 12 to 15 years\nafter we introduced the product. It's not a product like 4, 5 years ago when the supply chain issue happened. But\nif you compare to like a 10, 12, 15 years ago, the business size probably like current side is probably 5x, maybe\neven 10x larger. So that's where the upgrade refresh, we do see is very different than the supply chain issue a few\nyears ago. It's a much older product. We really -- after we introduced a new product, they -- usually average selling\nmaybe like 7, 8 years. And then after we stop selling we still supporting 5 additional year for the service. After 5\nadditional year stop shipping, but we do support service, then the customer reach to the end of service. So that's\n11/08/2025, 14:23\nFortinet, Inc., Q2 2025 Earnings Call, Aug 06, 2025 – Fortinet Inc. – BamSEC\nhttps://www.bamsec.com/transcripts/53dc461c-2163-4b7b-beed-11b80548f66d\n10/18\nearly probably average maybe like 12 to 15 years after the product being introduced. So that's the sense we kind\nof try to help customers to upgrade. And so like I said, even we have a large number of products, but that's\nusually the size of business we have like 12, 15 years ago.\nJohn Whittle Fortinet, Inc. – Chief Operating Officer\nI would also say we have additional incremental TAM to address going forward with SASE and SecOps where\nthose are becoming meaningful parts of our business. So if you look at historical results, they were more\nfocused on the firewall but those are becoming real growth drivers for us.\nGabriela Borges Goldman Sachs Group, Inc., Research Division – Analyst\nChristiane, maybe as a follow-up. The commentary last quarter on hesitancy in the sales force and in some of\nthe sales force conversations. I think today, you said macro didn't have an impact on the business. So maybe just\nreconcile those 2 data points. Are you still seeing hesitancy, is the hesitancy gone?\nChristiane Ohlgart Fortinet, Inc. – Chief Accounting Officer, CFO and Principal\nFinancial & Accounting Officer\nI would say that we've seen that we are resilient despite macroeconomic uncertainty. And -- the pipeline for the\nrest of the year and the sales confidence is good. So that's where we are confident to raise our billings guidance.\nOperator\nOur next question comes from Rob Owens with Piper Sandler.\nRobbie David Owens Piper Sandler & Co., Research Division – MD & Senior\nResearch Analyst\nLove for you to expand a little bit on the OT opportunity because I don't think I recall anything from your prepared\nremarks. Just in terms of what you're seeing there, both either increased competition? Or is this opportunity also\nplaying into the refresh cycle?\nKen Xie Fortinet, Inc. – Co-Founder, Chairman & CEO\nYes, that's in my comment there. The OT growing over 20%, continue to be one of the fast-growing area for us.\nAnd also, we are the only leader in the Westland and the OT/IoT security report. So that's where we see huge\npotential and OT need to have a special product, even special software to handle. We invest in this year for like\nmore than 10 years. We don't see much other competitor invest as we are so early, so broadly in the OT security.\nSo we do see -- we do believe this is a strong growing area going forward.\nRobbie David Owens Piper Sandler & Co., Research Division – MD & Senior\nResearch Analyst\n11/08/2025, 14:23\nFortinet, Inc., Q2 2025 Earnings Call, Aug 06, 2025 – Fortinet Inc. – BamSEC\nhttps://www.bamsec.com/transcripts/53dc461c-2163-4b7b-beed-11b80548f66d\n11/18\nAnd when you break down that over 20%, is that consistent internationally with domestically? Can you give you a\nview across the various theaters?\nKen Xie Fortinet, Inc. – Co-Founder, Chairman & CEO\nI think it's pretty consistent.\nChristiane Ohlgart Fortinet, Inc. – Chief Accounting Officer, CFO and Principal\nFinancial & Accounting Officer\nYes. We are strong in OT across the board. EMEA has always been leading in OT for us. And that's where you\nalso -- I mean, it's aligned with the strong revenue growth that we see in EMEA as well, right? So -- you also, I\nthink, asked whether it plays into the upgrade cycle. It does. We have a number of Rocket devices that are part of\nthe 2026 cohort benefiting from that. But we just see expansion and also the thought leadership that we've\nalways had in OT and bringing this to the forefront of our customer as an important security area, I think, has\nhelped us a lot.\nOperator\nOur next question comes from Junaid Siddiqui from Truist.\nJunaid Hamid Siddiqui Truist Securities, Inc., Research Division – Associate\nJust had a question. Ken, your SASE business continues to show a lot of momentum. Could you just talk about\nhow your sovereign SASE solution is tracking? And how that's different from some of -- from what your\ncompetitors are doing in that space? And how important of a differentiator you think that is in furthering your\ncompetitive moat in SASE?\nKen Xie Fortinet, Inc. – Co-Founder, Chairman & CEO\nYes, that's a great question. Thanks a lot. That's also kind of -- my thinking in early days. I do believe a SASE long\nterm, the service provider carrier will play a more important role, just like how they did like 15, 20 years ago in the\nnetwork security but somehow, they're moving kind of slow in the last few years. That's the reason we started to\nlaunch our own SASE almost 2 years ago.\nBut we do working with a lot of carrier service provider. They do starting launch their own kind of SASE service\nnow. Leverage both their infrastructure, their close relations with local customer there. So we do believe that will\nbe the long-term trend because a lot of customer if not the most, they do concern who will be process their data\nwhere the data being secured processed. So that's where leverage the local service provider kind of Sovereign\nSASE solution, that's all the service provided special telecom service provider, they love a lot.\nEven they're a little bit slow on adopting all this SASE solution there, but I do see the very strong supporting the\nSovereign SASE. That's one of the key advantage we have because we can have all the SASE function in same\nOS, which they can deploy locally, whether in their own infrastructure, sometimes also in the customer premise\nthere. So that's a huge advantage than some other SASE players. So we do see that momentum starting to\naccelerating now. That's including the telecom area starting to kind of also go back to grow probably above\naverage now. So that's a strong area.\n11/08/2025, 14:23\nFortinet, Inc., Q2 2025 Earnings Call, Aug 06, 2025 – Fortinet Inc. – BamSEC\nhttps://www.bamsec.com/transcripts/53dc461c-2163-4b7b-beed-11b80548f66d\n12/18\nI do believe probably in the next few years in the SASE market, the Sovereign SASE probably can be taken almost\nhalf the market share compared to this global cloud-based SASE. So that's I still believe, long term, that's the\nlong-term direction. Even short term, there are some kind of change in back and forth, but long-term Sovereign\nSASE will be the long-term solution.\nOperator\nOur next question comes from Patrick Colville with Scotiabank.\nPatrick Edwin Ronald Colville Scotiabank Global Banking and Markets, Research\nDivision – Director and Equity Research Analyst\nTerrific. I guess, Ken and Christiane, I just want to circle back to the firewall upgrade comments. I mean very\nhelpful disclosure that we're 40% to 50% through the 2026 upgrade cycle and that the 2027 end of life cycle is\nkind of lower throughput devices. I guess the question we're getting from investors in our inbox over the last half\nan hour is what should we be excited about beyond this upgrade cycle? What is going to continue momentum\nwhen these tailwinds, which are clearly benefiting numbers now and you guys are executing very well in a tough\nenvironment? But if we look beyond 2026 upgrade and '27 upgrade, what can continue this kind of rocket share\nmomentum.\nKen Xie Fortinet, Inc. – Co-Founder, Chairman & CEO\nYes, I believe the excitement will be the new SASE firewall. So it's very different than the traditional next-gen\nfirewall. So the customers do need a new function and also address the new infrastructure security need. So\nthat's the huge opportunity and not just additional product but also additional servers on top of that, give them\nkind of a securelywhole infrastructure. So that's we're starting to train the sales force, train the partner and also\ncustomer for this new SASE firewall solution which is where they gave them better security and also kind of\nmuch better total cost of ownership also.\nChristiane Ohlgart Fortinet, Inc. – Chief Accounting Officer, CFO and Principal\nFinancial & Accounting Officer\nAnd let me add to that. I think when we talk about the refresh cycle, we are only talking about the force refresh\ndue to end of support. But as Gabriela pointed out, there's the COVID cycle as well that it's not end of support yet\nbut is going to be 5, 6, 7 years out in a year or 2. So that with security and with the additional functionalities that\nare part of the firewall and also the additional network requirements that you have with running ChatGPT, AI, you\nname it. We believe there is -- there are going to be enough tailwinds for us to continue to grow.\nJohn Whittle Fortinet, Inc. – Chief Operating Officer\nYes. I think to Ken's point, cloud services, that's growing really, really fast, and we view that as largely an\nincremental additional total addressable market for us. And like Ken said, it's what we have in SASE right now,\nand you can layer on additional cloud services over time. So that should be high growth. And we really like our\nmodel of the common operating system between firewall, SASE, SD-WAN. And we think that firewall market will\ncontinue to grow naturally as well, and we'll take market share there, too. We've got all these other additional\ngrowth drivers in terms of SASE and SecOps, which are new TAM and really becoming meaningful to our\nbusiness and our high growth.\n11/08/2025, 14:23\nFortinet, Inc., Q2 2025 Earnings Call, Aug 06, 2025 – Fortinet Inc. – BamSEC\nhttps://www.bamsec.com/transcripts/53dc461c-2163-4b7b-beed-11b80548f66d\n13/18\nKen Xie Fortinet, Inc. – Co-Founder, Chairman & CEO\nYes. Again, a few we're probably a little bit over discussed about this refresh upgrade because this device has\nbeen there like 12 to 15 years ago. And that time, our size is probably 1/5 or 1/10 of our current size. Even all this\nproduct being in refresh or upgrade within like 1 or 2 years still not much business impact. So that's a few -- the\nmore important is really we leveraged the opportunity to introduce customer with a new FortiOS, new hardware,\nupsell cross-sell. So to measure the percentage of some old device been there like 12, 15 years ago, probably\nmuch less important than helping customers to upgrade to the new security infrastructure. And also the\nbusiness impact for the old device is also a much smaller percentage than the total business we have today.\nPatrick Edwin Ronald Colville Scotiabank Global Banking and Markets, Research\nDivision – Director and Equity Research Analyst\nOkay. Okay. Very helpful. And I guess, I mean, Ken, you've been a thought leader in security for many, many years.\nWhen we think about agentic AI security, I guess how are you thinking about that domain and Fortinet's position\nas a vendor that can help in agentic AI security?\nKen Xie Fortinet, Inc. – Co-Founder, Chairman & CEO\nYes, I do believe like keep being saying this for probably 10 years, whether the agentic AI or the device security\nstarting to get more and more important than some people -- human security, which people access. Right now,\nthe device, even the agent probably already like a 10x more than the people access all these information,\nInternet, all the data there. So that's where we invest in this area for more than 10 years and has multiple angle to\naddress the AI security, including agentic AI, including all these OT/IoT device security. So that's where we feel\nwill be huge market potential but also kind of need to address this instead of like bolt-on some of the old need to\nbe integrated together. So example, whether agentic AI you want to check the identity or you want to check the\naccess control, they need to be part of the infrastructure just like a part of the firewall, part of end point, part of\nthe edge device instead of a separate solution.\nSo once this solution be integrated together, customers have a better management and also better secure\ninfrastructure to address all these agentic AIs, or smarter ITO -- IT/IoT device security there. So that's where the\nintegrated solution address the whole infrastructure will be much better than like a separate solution which bolt-\non some of the current solutions. So we do believe this long-term integrated solution will be the key to address\nthis agentic AI the same as like IT/IoT solution security there.\nOperator\nOur next question comes from Saket Kalia with Barclays.\nSaket Kalia Barclays Bank PLC, Research Division – Senior Analyst\nOkay. Great. Christiane, maybe for you, 40% to 50% through the upgrade cycle, can you just talk about sort of\nwhat that cadence is going to look like this year? I mean I think that intra-quarter, we were talking about sort of a\n20% type of number maybe the real question is, where do we end '25 in terms of the percentage of that -- of the\ncohort that we're through?\n11/08/2025, 14:23\nFortinet, Inc., Q2 2025 Earnings Call, Aug 06, 2025 – Fortinet Inc. – BamSEC\nhttps://www.bamsec.com/transcripts/53dc461c-2163-4b7b-beed-11b80548f66d\n14/18\nChristiane Ohlgart Fortinet, Inc. – Chief Accounting Officer, CFO and Principal\nFinancial & Accounting Officer\nGood question. We've -- if you look at our updated guidance, you see that we believe there is strength in product\nfor the rest of the year. Where we exactly end is hard to say because -- of course, it's not only upgrade refresh\nproduct that we are planning to sell. So -- but I think we will get through those cycles faster than we expect.\nSaket Kalia Barclays Bank PLC, Research Division – Senior Analyst\nGot it. Got it. That makes sense. Maybe the follow-up is, I think you're hearing the question just about sort of\nwhat's the growth going to look like here after the upgrade cycle? And of course, it's FortiSASE, it's SecOps. I'm\ntrying to think if we've talked about this before, but have you -- can we touch on sort of what percentage of the\nservices revenue kind of comes from those 2 businesses versus attached subscription because just to the\nearlier point, that's really that mix shift that has to happen. So any color that you could sort of give on and where\nwe are in that kind of mix shift within services?\nChristiane Ohlgart Fortinet, Inc. – Chief Accounting Officer, CFO and Principal\nFinancial & Accounting Officer\nMix shift between FortiCare and security subscriptions?\nSaket Kalia Barclays Bank PLC, Research Division – Senior Analyst\nYes. Well, maybe more specifically, attached sort of subscriptions and maintenance versus FortiSASE and\nSecOps. So maybe firewall versus non-firewall in more late terms?\nChristiane Ohlgart Fortinet, Inc. – Chief Accounting Officer, CFO and Principal\nFinancial & Accounting Officer\nThe nonattached subscriptions are growing faster, for sure.\nSaket Kalia Barclays Bank PLC, Research Division – Senior Analyst\nGot it.\nKen Xie Fortinet, Inc. – Co-Founder, Chairman & CEO\nYes. Also on the attached part, the service is also starting to have a more high percentage because we offer\nmore service whether the SD-WAN, SASE definitely there's more service, more function behind. So that's also\nstarting at a higher percentage compared with the hardware. So that's both sides. There's some additional\nservice like we launched the 3 FortiCloud service, FortiIdentity, FortiDrive, FortiConnect, that's a new service on\nattached but there's also attached service which has a more higher ratio percentage compared with the\nhardware side of it.\nOperator\n11/08/2025, 14:23\nFortinet, Inc., Q2 2025 Earnings Call, Aug 06, 2025 – Fortinet Inc. – BamSEC\nhttps://www.bamsec.com/transcripts/53dc461c-2163-4b7b-beed-11b80548f66d\n15/18\nOur next question comes from Shrenik Kothari with Baird.\nShrenik Kothari Robert W. Baird & Co. Incorporated, Research Division – Senior\nResearch Analyst\nCan you guys hear me? All right. So just a quick question on the go to market. You guys have been pushing\ntowards platform adoption and multiproduct. Can you talk a little bit about how the channel incentives are\nmoving towards kind of achieving your internal targets? I mean, in terms of the rewarding models that are\nfavoring platform cross-sell or pure volume. Can you just give us an update on what's been most effective in\ndriving that? Where are the areas where you're still working on? Yes, I would really appreciate that.\nKen Xie Fortinet, Inc. – Co-Founder, Chairman & CEO\nYes, traditionally, we are a more channel-focused company. Now in the last few years, we're more starting to\ninvest in like direct marketing, direct sales, especially all these big enterprise. So you can see the -- whether the\nbigger deal and big enterprise sales grow very strong, like 40%, 50% -- that's all come from all this direct touch\napproach and also integrate solutions, selling platform like multiple products instead of single product. That's\nalso needed to train the sales, need to train a partner, how to sell this multiple solutions -- multiple products\ntogether into an integrated solution there, including whether the SASE, SD-WAN, including the SecureOP. So that's\nalso kind of leading to the AI part of story, which we believe is a fast-growing part of our business there, even we\nonly introduced for a few years but that's AI kind of based SecureOP and also like a security AI infrastructure to\nthe -- FortiAI-Assist, FortiAI-Protect as well customers see the benefit of this AI-driven operation so -- operation\ncenter there. So that's where we see is kind of an integrated solution with all this AI-enabled kind of SecureOP,\nthat's become a fast-growing part of our business right now.\nChristiane Ohlgart Fortinet, Inc. – Chief Accounting Officer, CFO and Principal\nFinancial & Accounting Officer\nAnd to answer your question on the channel incentives, they are exactly aligned around multiproduct. So we\nmake sure that the channel introduces new products and for that, they get higher back-end rebates.\nOperator\nOur next question comes from Eric Heath with KeyBanc.\nEric Michael Heath KeyBanc Capital Markets Inc., Research Division – VP & Equity\nResearch Analyst\nCan you hear me?\nKen Xie Fortinet, Inc. – Co-Founder, Chairman & CEO\nYes, all good.\n11/08/2025, 14:23\nFortinet, Inc., Q2 2025 Earnings Call, Aug 06, 2025 – Fortinet Inc. – BamSEC\nhttps://www.bamsec.com/transcripts/53dc461c-2163-4b7b-beed-11b80548f66d\n16/18\nEric Michael Heath KeyBanc Capital Markets Inc., Research Division – VP & Equity\nResearch Analyst\nGreat. Just come back to the comments on the refresh cycle one more time and sorry for belaboring this point.\nBut if I'm understanding this correctly, you've done well in excess of $100 million in refresh activity in the past 2\nor 3 quarters, which would suggest product revenue, excluding this refresh benefit has been flat to negative in\nthe last couple of quarters. So can you just help me understand why the underlying firewall demand isn't\nstronger?\nKen Xie Fortinet, Inc. – Co-Founder, Chairman & CEO\nI would not say it would be negative, it's continue to refresh, but because it's such a small percentage of the\noverall business, that's the reason we gave additional like billing guidance for the rest of the year on top of what\nwe already overachieve in Q1 and Q2. So that's just keeping -- we believe, whether the market and also our\nsolution is much better. We're not too much counting on the refresh. It's a very small percentage. We're just using\nour view to calculate whether internally or incentive the channel to helping customers to upgrade and especially\nfor the new SASE firewall. So that's where we kind of -- we do give a much more number measurement,\nsometimes could be confusing, but I do believe it's the way we try to helping the customer partner to upgrade the\nnew SASE firewall instead of have too big business impact because, like I said, the end of service, that's the\nproduct been there 12, 15 years ago. It's a pretty small percentage of our total business.\nOperator\nOur last question comes from Andrew Nowinski with Wells Fargo.\nAndrew James Nowinski Wells Fargo Securities, LLC, Research Division – Senior\nEquity Analyst\nI'm wondering -- still a little bit unclear on why services revenue growth is decelerating so much. Looking back\nover the last, call it, 4 quarters? And then also going forward. And I'm wondering if you could just provide any\ncolor around what's really driving that deceleration?\nAnd then related to that, why is your unified SASE -- it has so much momentum right now. Why would that be flat\nsequentially in Q2? Because it looked like it was about $1.15 billion in Q2 and the same thing that you had in your\nslide deck in Q1. So just wondering if you could comment on -- I know on a year-over-year basis, it was up, but i\ndon't know, sequentially, why would it be flat? .\nKen Xie Fortinet, Inc. – Co-Founder, Chairman & CEO\nGo ahead, Christiane.\nChristiane Ohlgart Fortinet, Inc. – Chief Accounting Officer, CFO and Principal\nFinancial & Accounting Officer\nTo answer your second question first, sequentially, it's flat because there are a number of products, some of\nthem have not been growing or turning a little bit while Unified SASE -- while SSE has been growing nicely and is\noffsetting that. So that's part of this.\n11/08/2025, 14:23\nFortinet, Inc., Q2 2025 Earnings Call, Aug 06, 2025 – Fortinet Inc. – BamSEC\nhttps://www.bamsec.com/transcripts/53dc461c-2163-4b7b-beed-11b80548f66d\n17/18\nOn the service revenue growth, the -- I think that what you're seeing is that we had significant deferred revenues\nthat were sold during the COVID period, and they have come. So we've recognized service revenue over the last\ncouple of years, benefiting from that growth. And now the product revenue and the service revenue are aligning\nmore with our billings growth. And so we need to grow faster, and we are planning to grow faster to drive that\nboth revenue streams up.\nKen Xie Fortinet, Inc. – Co-Founder, Chairman & CEO\nYes, the service revenue -- service line, if you look at like 3, 4 years ago, the product revenue grew like 30% 40%,\nsome quarter, maybe even close to 50%, that drive the service revenue because service term unit average may be\nlike 30 months -- 29, 30 months. So that's need to be recognized during that like 2.5-, 3-year period.\nOn the other side, keeping refer back to the presentation #4 -- Slide #4, which is really the SSE part of SASE\ngrowing very, very strong because Unified SASE including SD-WAN. Because SD-WAN, we already have a pretty\ngood penetration reading enterprise. That's where customers were starting to adopt beyond SD-WAN starting\nquickly adopt SASE now. So that's where the growth is still very strong. So we do believe -- so we are the #1\nfirewall, #1 SD-WAN we do believe we are the #1 SASE within the next few years because -- we believe we have a\nhuge advantage on SASE in a single OS and also can very easily for the current customer base to upgrade to the\nSASE, which not other SASE player has a huge customer base. And also our own infrastructure give us cost\nadvantage. So how this 3 advantage of SASE in not our competitors had, that we do believe we'll be the #1 SASE\nplayer in the next few years.\nJohn Whittle Fortinet, Inc. – Chief Operating Officer\nSo I'd say we focus on the value to the customer, and we've got 800,000 customers and that path to value from\nfirewall to SD-WAN to SASE with the integrated single operating system approach, is really pretty straightforward.\nAnd so we see a huge opportunity both there and with new sales of SASE, and that will be a real growth driver for\nus.\nOperator\nThis concludes our Q&A session. I will now hand it back to Aaron Ovadia for closing remarks.\nAaron Ovadia Fortinet, Inc. – Senior Director of Investor Relations\nThank you. I'd like to thank everyone for joining today's call. We will be attending investor conferences hosted by\nDeutsche Bank, Citi and Goldman Sachs during the third quarter. The fireside chat webcast link will be posted on\nthe Events and Presentations section of our Investor Relations website. If you have any follow-up questions,\nplease feel free to contact me. Have a great rest of your day.\n11/08/2025, 14:23\nFortinet, Inc., Q2 2025 Earnings Call, Aug 06, 2025 – Fortinet Inc. – BamSEC\nhttps://www.bamsec.com/transcripts/53dc461c-2163-4b7b-beed-11b80548f66d\n18/18"}, "content_hash": "0ccf55f9522d268b1e295e2caeab07f73deaf816986dbbef9f15d6cdf89aa797", "transcript_name": "Fortinet, Inc., Q2 2025 Earnings Call, Aug 06, 2025 – Fortinet Inc. – BamSEC.json"}