{"validated_at": "2025-09-08T23:22:11.548845", "input": {"call_type": "earnings", "summary_length": "long", "answer_format": "prose", "filename": "HubSpot Q1 2025 Earnings Transcript.pdf"}, "transcripts": {"presentation": "Corrected Transcript\n \n \n1-877-FACTSET   www.callstreet.com \nTotal Pages: 19\nCopyright © 2001-2025 FactSet CallStreet, LLC\n \n08-May-2025 \nHubSpot, Inc. (HUBS) \nQ1 2025 Earnings Call \n \n \nHubSpot, Inc. (HUBS) \nQ1 2025 Earnings Call \nCorrected Transcript \n08-May-2025 \n \n \n1-877-FACTSET   www.callstreet.com \n \n2\nCopyright © 2001-2025 FactSet CallStreet, LLC\n \n \nCORPORATE PARTICIPANTS \n \nRyan M. Burkart \nSenior Director-Investor Relations, HubSpot, Inc. \nYamini Rangan \nPresident, Chief Executive Officer & Director, HubSpot, Inc. \nKathryn Bueker \nChief Financial Officer, HubSpot, Inc. \nDharmesh Shah \nCo-Founder, Chief Technology Officer & Director, HubSpot, Inc. \n .....................................................................................................................................................................................................................................................................  \n \nOTHER PARTICIPANTS \n \nMark R. Murphy \nAnalyst, JPMorgan Securities LLC \nSamad Samana \nAnalyst, Jefferies LLC \nArjun Bhatia \nAnalyst, William Blair & Co. LLC \nGabriela Borges \nAnalyst, Goldman Sachs & Co. LLC \nAlex Zukin \nAnalyst, Wolfe Research LLC \nRishi Jaluria \nAnalyst, RBC Capital Markets LLC \nJeffrey Parker Lane \nAnalyst, Stifel, Nicolaus & Co., Inc. \nElizabeth Porter \nAnalyst, Morgan Stanley & Co. LLC \nBrad Sills \nAnalyst, BofA Securities, Inc. \nJoshua Reilly \nAnalyst, Needham & Co. LLC \nKeith Bachman \nAnalyst, BMO Capital Markets Corp. \nKen Wong \nAnalyst, Oppenheimer & Co., Inc. \nJackson E. Ader \nAnalyst, KeyBanc Capital Markets, Inc. \nKirk Materne \nAnalyst, Evercore ISI \n \n \nHubSpot, Inc. (HUBS) \nQ1 2025 Earnings Call \nCorrected Transcript \n08-May-2025 \n \n \n1-877-FACTSET   www.callstreet.com \n \n3\nCopyright © 2001-2025 FactSet CallStreet, LLC\n \n \nMANAGEMENT DISCUSSION SECTION \n  \nOperator: Good afternoon, and welcome to the HubSpot's Q1 2025 Earnings Call. My name is Gigi, and I'll be \nyour operator for today. At this time, all participant lines are in listen-only mode, and there will be an opportunity \nfor questions and answers after management's prepared remarks. [Operator Instructions] \n \nI would now like to hand the conference over to Senior Director of Investor Relations, Ryan Burkart. Please go \nahead. \n .....................................................................................................................................................................................................................................................................  \nRyan M. Burkart \nSenior Director-Investor Relations, HubSpot, Inc. \nThanks, operator. Good afternoon and welcome to HubSpot's first quarter 2025 earnings conference call. Today, \nwe'll be discussing the results announced in the press release that was issued after the market closed. With me \non the call this afternoon is Yamini Rangan, our Chief Executive Officer; Dharmesh Shah, our Co-Founder and \nCTO; and Kate Bueker, our Chief Financial Officer. \n \nBefore we start, I'd like to draw your attention to the Safe Harbor statement included in today's press release. \nDuring this call, we'll make statements related to our business that may be considered forward-looking within the \nmeaning of Section 27A of the Securities Exchange Act of 1933, as amended, and Section 21E of the Securities \nExchange Act of 1934, as amended. \n \nAll statements, other than statements of historical fact are forward-looking statements, including those regarding \nmanagement's expectations of future, financial and operational performance and operational expenditures, \nexpected growth, FX movement, and business outlook, including our financial guidance for the second fiscal \nquarter and full year 2025. \n \nForward-looking statements reflect our views only as of today, and except as required by law, we undertake no \nobligation to update or revise these forward-looking statements. Please refer to the cautionary language in today's \npress release and our Form 10-Q, which will be filed with the SEC this afternoon for a discussion of the risks and \nuncertainties that could cause actual results to differ materially from expectations. \n \nDuring the course of today's call, we'll refer to certain non-GAAP financial measures as defined by Regulation G, \nthe GAAP financial measure most directly comparable to each non-GAAP financial measure, used or discussed, \nand a reconciliation of the differences between such measures can be found within our first quarter 2025 earnings \npress release in the Investor Relations section of our website. \n \nNow, it's my pleasure to turn the call over to HubSpot's Chief Executive Officer, Yamini Rangan. Yamini. \n .....................................................................................................................................................................................................................................................................  \nYamini Rangan \nPresident, Chief Executive Officer & Director, HubSpot, Inc. \nThank you, Ryan, and welcome, everyone. Today, I'll focus on our Q1 2025 results and the key trends driving our \nperformance. Then I'll highlight the clear momentum we are seeing with AI adoption, how our Spring Spotlight \ninnovations are accelerating it, and why we believe HubSpot is uniquely positioned to lead and win with AI. Let's \ndive in. \n \nHubSpot, Inc. (HUBS) \nQ1 2025 Earnings Call \nCorrected Transcript \n08-May-2025 \n \n \n1-877-FACTSET   www.callstreet.com \n \n4\nCopyright © 2001-2025 FactSet CallStreet, LLC\n \nQ1 was a solid start for HubSpot, with revenue growing 18% year-over-year in constant currency. Total customers \ngrew by 19% to over 258,000 globally, fueled by over 10,000 net customer additions in the quarter. I'm also \npleased to announce that our board of directors has authorized our first-ever share repurchase program with up to \n$500 million under authorization, a clear signal of the confidence we have in our business and the growth \nopportunity ahead. This trend is reflected in our Q1 results, driven by three consistent pillars: platform \nconsolidation; upmarket expansion; and strength in customer acquisition downmarket. \n \nLet's start with platform consolidation. HubSpot's customer platform is becoming the clear choice for businesses \nlooking to drive AI innovation, while reducing total cost of ownership with a unified simpler tech stack. Over 37% \nof our Pro+ customers by ARR are using four or more hubs, up seven points year-over-year. In Q1, we saw more \nnew Pro+ customers start with our full platform than ever before. This is a clear signal that our platform for \nstrategy is working. \n \nIn upmarket, we continue to see real momentum driven by product innovation and go-to-market execution. We \ndelivered key enterprise-grade functionality that larger customers need, including journey orchestration in \nMarketing Hub Enterprise to run sophisticated workflows, enhance sandbox functionality to support complex \nimplementations and the launch of three new data centers in Sydney, Oregon and Montreal. \n \nAs a result, large deal growth was strong, up 23% year-over-year with clear momentum among our installed base. \nOur partners continue to be a key driver of market with cost selling up 41% in Q1. \n \nIn downmarket, we see strength in customer acquisition, driven by pricing changes and improvements in the Free \nto Starter conversion. We made our product easy-to-buy and easy-to-upgrade, and those changes are a clear \ntailwind. \n \nFree to Starter conversion is up year-over-year, driven by better onboarding, product improvements and flexible \nmonthly payment options. Our Smart CRM and core seat offerings are gaining strong traction, expanding our \nreach beyond traditional personas to include ops, admin, and finance users who need powerful editing \ncapabilities. 24% of our Pro+ customers on the seats model have purchased additional core seats. It's rewarding \nto see customers scale with HubSpot and the consistency of our results shows our platform is delivering real \nvalue. \n \nOkay, before we move into AI innovation, I want to acknowledge the macro environment. Uncertainty remains the \nconstant. We entered the year with more growth conversations, and while that has not shifted dramatically, we \nare seeing a sharper focus on value. HubSpot is built for moments like these, and we have a proven playbook to \ncommunicate value. As a crafted customer platform, we help businesses consolidate tools, cut costs and unlock \nthe power of a unified customer view. \n \nOur ease-of-use and fast time to value allow customers to onboard quickly and see results. With AI embedded \nacross all hubs, we deliver immediate efficiency, and we believe that AI's value is amplified further when \ncompanies prioritize driving productivity. In uncertain times, HubSpot is the predictable choice for scaling \nbusinesses. \n \nOkay, with that, let's shift gears and talk about AI innovation and momentum. Our AI strategy has been clear. We \nwill embed AI into every hub and every part of the platform. One product, one AI-first customer platform, no bolt-\nons. We have executed against that strategy by introducing hundreds of embedded features across hubs, \nlaunching Copilot to help go-to-market teams get work done faster and rolling out agents that can do the work for \nHubSpot, Inc. (HUBS) \nQ1 2025 Earnings Call \nCorrected Transcript \n08-May-2025 \n \n \n1-877-FACTSET   www.callstreet.com \n \n5\nCopyright © 2001-2025 FactSet CallStreet, LLC\n \nthem. We have reinforced the strategy through strategic acquisitions, including frame.ai and Dashworks to \naccelerate our roadmap. And that strategy is working. \n \nOver the past year, Content Hub attach rates have tripled and Service Hub adoption has improved because of \nembedded AI. Copilot adoption has accelerated with the number of users who have engaged with Copilot more \nthan doubling from 270,000 users in Q4 to over 660,000 in Q1. Our agents are gaining traction. Customer Agent \nadoption has doubled in three months, now serving over 2,500 customers with average resolution rates of over \n50% and some seeing 80% AI resolution. \n \nService Hub customers with Customer Agents closed tickets 39% faster than customers not using it. Prospecting \nAgent now in public beta automatically researches target accounts, personalizes outreach and engages prospects \nto help sales teams grow pipeline. We now have over 2,300 customers activating on Prospecting Agents, \nsignaling clear demand. These wins are important, not just because they show clear adoption and value, but \nbecause they validate a core belief. \n \nOur customers want AI embedded within HubSpot, not bolted on. Many have organizational mandates to drive AI \ninitiatives and appreciate our ease-of-use and fast time to value. We are doubling down on Customer Agent, \nbecause it's driving real results. We're seeing clear product market fit. And therefore, in June, we are expanding it \nbeyond Service Hub to all Pro and Enterprise customers across every hub. \n \nWhat's been fascinating is how customers are using Customer Agent across the entire journey, not just for post-\nsales support. Whether answering marketing questions like where is your next webinar or sales questions like \nhow does your pricing work, Customer Agent is already delivering value at every stage of the customer journey. \nAnd that's why we believe Customer Agent will become the single most important AI agent every business will \nadopt and the easiest way for companies to scale with AI. \n \nStarting June 2, Breeze Customer Agent will be available through our existing credit-based system. The same \nsimple model we introduced at INBOUND with Breeze Intelligence. Here's how it's going to work. To make it easy \nfor customers to get started, Pro and Enterprise customers will receive a monthly allotment of credits included in \ntheir subscription. This means they can begin using Customer Agent immediately at no extra cost. As they see \nsuccess and want to scale, customers can purchase additional credits, either in flexible amounts or in easy to \nchoose packs, giving them full control and predictability over their spend. This is just a step in our broader \nstrategy to monetize AI using both seats and credits. \n \nOver time, we'll extend credits-based pricing to other AI agents and features, staying true to our philosophy of \ndelivering value before monetizing. While we believe this approach will be a strong long-term growth driver, \nbecause we're launching this midyear and adoption will take time to ramp, we do not expect a material impact to \nour 2025 revenue from this change. \n \nOkay. Let's talk about how we are sustaining our AI momentum. We've continued to innovate rapidly and released \nover 200 new features at our first-ever in-person Spring Spotlight event. Our innovations focused on three clear \nthemes: deeply embedding AI across the customer journey; advancing multi-agent orchestration; and driving \nupmarket scalability. We have significantly enhanced Customer Agent, Prospecting Agent, and Content Agent to \nhelp customers market, sell and support better. \n \nFor example, Content Agent now proactively suggests blog topics, learns from marketeer-provided context and \nautomates internal blog linking, creating high-quality targeted content faster. Prospecting Agent now combines \nHubSpot and external data to personalize outreach, delivering insight directly into sales workspace. \nHubSpot, Inc. (HUBS) \nQ1 2025 Earnings Call \nCorrected Transcript \n08-May-2025 \n \n \n1-877-FACTSET   www.callstreet.com \n \n6\nCopyright © 2001-2025 FactSet CallStreet, LLC\n \n \nNow, as we lead the way in agent to human collaboration, we are taking a major leap forward with agent-to-agent \norchestration, a shift, we believe, will define how work gets done in the future. At Spring Spotlight, we introduced \nKnowledge Base Agent, a breakthrough in multi-agent orchestration. \n \nAs we watched Customer Agent adoption closely, we saw a clear pattern. Customers with strong, well-\ndocumented knowledge bases achieved the highest AI resolution rates. And to help more customers succeed, we \nbuilt Knowledge Base Agent to work alongside Customer Agent, automatically identifying knowledge gaps and \ndrafting new articles from unstructured data like support tickets, calls and e-mails. This is agent-to-agent \norchestration in action, two agents working together using unified HubSpot data to deliver faster results. \n \nAlongside these AI advances, we have expanded our Enterprise capabilities with powerful new features like \nlookalike list, journey automation and multi-account management in Marketing Hub Enterprise, plus enhanced \nworkspaces for sales, service and customer success teams. Together, these innovations give customers the \nconfidence that by choosing HubSpot, they are AI-first and are future-proofing their business for what's next. \n \nOur approach to AI is differentiated, and that is what will set HubSpot apart. We unify structured, unstructured and \nexternal data at scale, giving our AI a richer, more complete foundation. We layer deep context across the entire \ncustomer journey, brand, tone, voice, customer interactions, something only a true platform, not point solutions or \nagents can deliver. With nearly two decades of experience serving SMBs, we understand exactly what growing \nbusinesses need from AI, and we're building features and agents that deliver real outcomes, not complexity. \n \nAnd through agent.ai, we are incubating a vibrant AI agent ecosystem, already engaging over 1.7 million users \nand 17,000 agent builders. We uniquely bring together data, context, customer focus and ecosystem innovation, \nand that's why we're positioned to lead the next era of AI-powered growth. \n \nWith that, I'll hand it over to our CFO, Kate Bueker, to walk you through our financial and operating results. Kate? \n .....................................................................................................................................................................................................................................................................  \nKathryn Bueker \nChief Financial Officer, HubSpot, Inc. \nThanks, Yamini. Let's turn to our first quarter 2025 financial results. Q1 revenue grew 18% year-over-year in \nconstant currency and 16% on an as-reported basis. Subscription revenue grew 16% year-over-year, while \nservices and other revenue increased 13% on an as-reported basis. Q1 domestic revenue grew 16% year-over-\nyear. International revenue growth was 19% in constant currency and 15% as-reported, representing 47% of total \nrevenue. \n \nWe added over 10,000 net new customers in Q1, modestly above our expectations and ended the quarter with a \ntotal of 258,000 customers growing 19% year-over-year. Average subscription revenue per customer was \n$11,000 in Q1, down 2% year-over-year in constant currency, and 4% on an as-reported basis. Over the next few \nquarters, we expect net additions to moderate to roughly 9,000 and ASRPC growth to be approximately flat. \n \nWe continued to see healthy customer dollar retention in Q1 holding in the high-80s. Net revenue retention was \n102% in Q1, down two points sequentially as expected. \n \nFor the full year of 2025, we continue to expect net revenue retention to be up a couple of points year-over-year, \nprimarily driven by the impact of our seats-based pricing model change. Calculated billings were $767 million in \nQ1, growing 18% year-over-year in constant currency and 20% on an as-reported basis. The remainder of my \ncomments will refer to non-GAAP measures. \nHubSpot, Inc. (HUBS) \nQ1 2025 Earnings Call \nCorrected Transcript \n08-May-2025 \n \n \n1-877-FACTSET   www.callstreet.com \n \n7\nCopyright © 2001-2025 FactSet CallStreet, LLC\n \n \nQ1 operating margin was 14%, down one point compared to the year ago period. As a reminder, there was a one \npoint headwind to operating margins due to an increased company match rate for our 401(k) contributions that \nshifts more costs earlier in the year. Net income was $96 million in Q1 or $1.78 per fully diluted share. Free cash \nflow was $122 million or 17% of revenue in Q1. \n \nFinally, our cash and marketable securities totaled $2.2 billion at the end of March. As Yamini shared, our board \nhas authorized HubSpot's first-ever share repurchase program of up to $500 million over the next 12 months. This \nreflects our strong conviction in our long-term opportunity and our commitment to delivering shareholder value. \nWe will continue to prioritize investments in organic innovation and remain selective with strategic M&A, our \nhealthy balance sheet and strong free cash flow gives us the flexibility to settle our convertible bond in June and \nexecute this repurchase program, which will help offset dilution. \n \nOkay, before I move into guidance, I want to touch quickly on the macro environment. I think Yamini said it \nperfectly. Uncertainty remains the only constant. While we haven't seen a significant change in our business \ntrends, we are seeing a heightened focus on value and a higher level of uncertainty regarding the economic \nenvironment, which we expect to persist through the remainder of the year. \n \nWith that, let's dive into guidance for the second quarter and full year of 2025. For the second quarter, total as-\nreported revenue is expected to be in the range of $738 million to $740 million, up 16% year-over-year in both \nconstant currency and on an as-reported basis. Non-GAAP operating profit is expected to be between $124 \nmillion and $125 million, representing a 17% operating profit margin. Non-GAAP diluted net income per share is \nexpected to be between $2.10 and $2.12. This assumes 53.2 million fully diluted shares outstanding. \n \nAnd for the full year of 2025, total as-reported revenue is now expected to be in the range of $3.036 billion to \n$3.044 billion, up 16% year-over-year in both constant currency and on an as-reported basis. Non-GAAP \noperating profit is now expected to be between $558 million and $562 million, representing an 18% operating \nprofit margin. Non-GAAP diluted net income per share is now expected to be between $9.29 and $9.37. This \nassumes 53.3 million fully diluted shares outstanding. \n \nAs you adjust your models, please keep in mind the following: our EPS guidance includes the impact from both \nthe planned convertible bond settlement and our share repurchase program. We expect the repurchase program \nto be slightly dilutive to EPS in the second half of 2025 due to the lower interest income from reduced cash. \n \nThat said, the reduction in share count will build over the next 12 months to offset the lower interest income. We \ncontinue to expect CapEx as a percentage of revenue to be roughly 5% and now expect free cash flow to be \nabout $570 million for the full year of 2025 with seasonally stronger free cash flow in Q4. \n \nWith that, I will turn the call back over to Yamini. \n .....................................................................................................................................................................................................................................................................  \nYamini Rangan \nPresident, Chief Executive Officer & Director, HubSpot, Inc. \nThank you so much, Kate. As we close, I want to express my heartfelt gratitude to Brian Halligan, our Co-\nFounder, who has decided to transition from his role as Executive Chair to a regular member of our board. After \n3.5 years as Executive Chair, Brian is stepping back to devote more time to his work with Sequoia, Propeller \nVentures and his teaching role at MIT. I am very grateful for Brian's support, guidance and investment in me \nduring his time as Executive Chair. Brian will continue to serve as a board member, a founder, and a large \nHubSpot, Inc. (HUBS) \nQ1 2025 Earnings Call \nCorrected Transcript \n08-May-2025 \n \n \n1-877-FACTSET   www.callstreet.com \n \n8\nCopyright © 2001-2025 FactSet CallStreet, LLC\n \nshareholder, supporting HubSpot from the boardroom. Lorrie Norrington, our long-standing lead independent \ndirector, will assume the Board Chair role. \n \nI want to thank our customers, our partners and investors for their continued support and a huge, huge thank you \nto all HubSpotters around the world for staying focused on solving for our customers every single day. \n \nWith that, operator, let's please open up the call for questions. \n .....................................................................................................................................................................................................................................................................  \n \nQUESTION AND ANSWER SECTION \n  \nOperator: Thank you. [Operator Instructions] One moment for our first question. First question today is from \nMark Murphy from JPMorgan. \n .....................................................................................................................................................................................................................................................................  \nMark R. Murphy \nAnalyst, JPMorgan Securities LLC \nQ \nThank you so much. And congrats on a very steady performance. So, Dharmesh, I was hoping you could give us \nan update on agent.ai. And just as part of that, there was some talk about multi-agent orchestration. How are you \ndoing that across the hubs? So for instance, an agent in Marketing Hub, how will it talk to an agent in Sales Hub? \nAnd I'm trying to understand if you're going to use something like model context protocol or some other \ncommunication mechanism. And then I have a quick follow-up. \n .....................................................................................................................................................................................................................................................................  \nDharmesh Shah \nCo-Founder, Chief Technology Officer & Director, HubSpot, Inc. \nA \nOkay. Thanks for the questions. So, on the agent.ai front. So as Yamini mentioned, agent.ai is one of our \ninnovation bets. And the thesis behind the bet is that the future is going to consist of tens of thousands, hundreds \nof thousands of agents all collaborating and working with each other to accomplish higher order goals. And so, \nour kind of goal behind agent.ai is to kind of empower seasoned builders to build this next generation of agents, \nand we're really pleased with the progress that, that innovation bet has made. \n \nNow, one of the ways, I think these agent-to-agent collaborations will happen is with what's called model context \nprotocol, which you brought up. What model context protocol is, is an open standard that defines how AI \napplications and agents can communicate with a variety of tools and back ends and services. And so, this \nbenefits HubSpot in a couple of ways. \n \nOne is, earlier this week. I'm super proud, the team launched into public beta our MCP server support, which \nallows any AI application, current and future, to be able to communicate with HubSpot's backend over a natural \nlanguage interface within an LLM. And so, where this unlocks potential is that now HubSpot can be used by all \nsorts of applications, they can get to that data easily. So think of it as a next-generation API. So, past APIs were \nbuilt for classic applications. Model context protocol allows agents to be able to consume HubSpot services. \n \nThe flip side of it is HubSpot will also be an MCP client. This will allow us to then interact with all the third-party \nsystems that are out there and be able to bring that data into our normalized hybrid structured, unstructured form. \nSo, it kind of expands broadly the footprint of data that we will have access to. So, we're super excited both by the \nkind of agent network as represented by agent.ai and the opportunity that MCP, the model context protocol \nunlocks. Thanks for the question \n .....................................................................................................................................................................................................................................................................  \nHubSpot, Inc. (HUBS) \nQ1 2025 Earnings Call \nCorrected Transcript \n08-May-2025 \n \n \n1-877-FACTSET   www.callstreet.com \n \n9\nCopyright © 2001-2025 FactSet CallStreet, LLC\n \n \nOperator: Thank you. One moment for our next question. Our next question comes from the line of Samad \nSamana from Jefferies. \n .....................................................................................................................................................................................................................................................................  \nSamad Samana \nAnalyst, Jefferies LLC \nQ \nHi, good evening and thank you for taking my question. Great to see the strong execution in a tough backup. \nMaybe, Kate, for you, just as I think about the revised guidance, it's obviously impressive, but it now implies a \ndifferent shape of growth as the year progresses than where we started. \n \nAnd so, I was wondering if you could maybe just help us contextualize how we should think about the quarterly \nprogression? And then maybe related, just on the margin side, sticking with guidance, how much you're absorbing \nin terms of OpEx from M&A? Because I'm guessing you would have revised that maybe higher otherwise. Just \nmaybe help us understand that guidance just a little bit better. Thank you so much. \n .....................................................................................................................................................................................................................................................................  \nKathryn Bueker \nChief Financial Officer, HubSpot, Inc. \nA \nOh, sure thing. I would just maybe start, Samad, by saying, well, there are maybe a little bit more complex pieces \nto the puzzle, the way that we've approached guidance for this quarter is very much consistent with the way we \nalways approach guidance. \n \nSo, maybe I'll take you through the pieces and it will help a little bit here. I think you're well aware, foreign \nexchange has been quite volatile. Since we reported our earnings in February, the US dollar has weakened pretty \nmeaningfully, which is favorable to our as-reported revenue results, and we've flowed this through to our full year \nguidance. \n \nSo, we flowed through $50 million of FX upside, which is all of the movement that we saw in rates between \nFebruary and today. That said, we did not flow through our Q1 outperformance into the full year outlook, and the \ndecision not to do that is really a reflection of the increased macro uncertainty that you heard both Yamini and I \ntalk about in the prepared remarks. \n \nA couple things maybe just to highlight as you think about our full year guide. Yamini said it pretty clearly. We \nhave not seen any material headwinds to the business through April, but the environment is obviously highly \nuncertain, and we're actively monitoring trends in the business. \n \nSecondly, like, as always, our guidance is going to reflect a range of scenarios that we run in preparation for this \ncall. We have not assumed a full-scale downturn in the economic situation this year, but we do believe that our \nrevised outlook is appropriately prudent, and it really does reflect sort of a confident view of the business that we \nsee today. In terms of the operating profit side and the impact of M&A, it's honestly very small. \n .....................................................................................................................................................................................................................................................................  \n \nOperator: Thank you. One moment for our next question. Our next question comes from the line of Arjun Bhatia \nfrom William Blair. \n .....................................................................................................................................................................................................................................................................  \nArjun Bhatia \nAnalyst, William Blair & Co. LLC \nQ \nGood. Thank you so much. Two questions. One, Dharmesh, if I can follow up on Mark Murphy's earlier question \non agent.ai. Is it right to assume that the experience of an agent that's coming into HubSpot through agent.ai is \nHubSpot, Inc. (HUBS) \nQ1 2025 Earnings Call \nCorrected Transcript \n08-May-2025 \n \n \n1-877-FACTSET   www.callstreet.com \n \n10\nCopyright © 2001-2025 FactSet CallStreet, LLC\n \ngoing to be the same or not materially different than the agents that HubSpot is building – that you're building \nyourself? Or are there differences that we should be thinking about just in terms of the customer experience and \nhow that gets developed? \n \nAnd then one for just on the macro, I know you pointed out a little bit of customers are facing higher – or putting \nhigher focus on value. I'm curious if you're seeing certain verticals, certain end markets, or certain types of \ncustomers be more hesitant than others. Is there any way to kind of just get a little bit more granular into where \nyou're seeing the higher focus on value thus far? Thank you. \n .....................................................................................................................................................................................................................................................................  \nYamini Rangan \nPresident, Chief Executive Officer & Director, HubSpot, Inc. \nA \nLet me start with this, and then I'll have Dharmesh step in on the agent. I'll start with the overall macro question \nthat you have. As we've said couple of times here, we have not seen significant changes in demand patterns, and \nthat holds true by industry and segment and geography. Across all of those, we're seeing very similar patterns \nacross that board. \n \nNow, look, I think, there's just a broader narrative that SMBs may be disproportionately impacted by economic \ndownturn. And while we'll never say never, we simply have not seen that play out in the business over the last few \nyears. And we've kind of been through a lot, a pandemic, a downturn, and macro uncertainty. And the reason for \nthat is that we are a platform that is a must-have. \n \nWe're not just a nice-to-have. And we're kind of the nerve center of our customers' revenue-generating activities. \nAnd the platform that they rely on to connect to their end customers and grow and our customer base is broad \nand diverse. And so we're not reliant on one industry, one geography, or a specific segment. And because of that \nbroad customer base, the results tend to be very resilient. \n \nNow, you asked a question in terms of agents. Maybe I'll start with explaining our strategy. Our AI strategy is to \nembed AI deeply into every hub and across the whole platform to deliver a Copilot, which is a digital assistant for \nall front office employees, and to deliver a set of agents that are first-party agents that we're building that can help \nour customers accomplish work. So we're building an agent platform, and that takes all of the unified, structured, \nunstructured data and the context we have across our 258,000 customers and brings that to bear. That is kind of \nour strategy from a core, agentic delivery of value from our customers' perspective. \n \nNow, as Dharmesh explained, we also have an innovation bet where we want to have an ecosystem of vibrant \ndevelopers of agents, and we're certainly looking at that, but the core part of our strategy is to build Customer \nAgent, Prospecting Agents, and deliver value for our customers. \n .....................................................................................................................................................................................................................................................................  \n \nOperator: Thank you. One moment for our next question. Our next question comes from the line of Gabriela \nBorges from Goldman Sachs. \n .....................................................................................................................................................................................................................................................................  \nGabriela Borges \nAnalyst, Goldman Sachs & Co. LLC \nQ \nHi, good afternoon. Thanks for taking my question. Yamini, I wanted to revisit some of the share gain momentum \nthat you're seeing in the mid-market, so that's 200 to 1,000 employee cohort. \n \nNow that you have the additional HIPAA qualifications and compliance, how do you think about which customers \nor which cohorts of customers in the mid-market makes the most sense for HubSpot? And when you have your \nHubSpot, Inc. (HUBS) \nQ1 2025 Earnings Call \nCorrected Transcript \n08-May-2025 \n \n \n1-877-FACTSET   www.callstreet.com \n \n11\nCopyright © 2001-2025 FactSet CallStreet, LLC\n \nsalespeople giving you feedback, are there specific targets or specific types of customers, either by vertical or by \nmindset, that work better as potential HubSpot customers versus perhaps staying on their existing provider? \nThank you. \n .....................................................................................................................................................................................................................................................................  \nYamini Rangan \nPresident, Chief Executive Officer & Director, HubSpot, Inc. \nA \nHey, Gabriela, thanks a lot for the question. I think, just stepping back, we have been focusing on 2 to 2,000, and \nyou're absolutely right, the mid-market portion of our segmentation is kind of between 25 to 200. But I will say that \nyour broader question on what are we seeing, which verticals, where do we see even further opening, I think the \nreason we have been able to consistently deliver results is because we're seeing momentum in all of our \nsegments. \n \nWe've had a strategy where we want to drive acquisition at the lower end, and we want to continue to add value. \nOver the last few years, you have seen us do things like HIPAA support, but also deliver more complex and \nsophisticated like needs of the customers in the upmarket segments, and all of that has played through. \n \nAnd again, as I mentioned slightly before, it's not in one segment or in one vertical. And this is really driving a \nbetter product market fit for mid-market and upmarket customers, and we're doing it without compromising ease \nof use. When I talk to our customers, when I talk to our sales reps on where there's momentum, they will come \nback to the same reason. We have a clear value proposition for mid-market and upmarket customers, which is \neasy to use, fast time to value, and unified data. And because of that, there is just a ton of momentum in both \nmid-market as well as upmarket. \n .....................................................................................................................................................................................................................................................................  \n \nOperator: Thank you. One moment for our next question. Our next question comes from the line of Alex Zukin \nfrom Wolfe Research. \n .....................................................................................................................................................................................................................................................................  \nAlex Zukin \nAnalyst, Wolfe Research LLC \nQ \nHey, guys. Thanks for taking the question. I guess maybe getting kind of the AI and macro question differently. As \nyou look at the delta between upmarket traction and maybe kind of downmarket traction at the same time, any \ndifferent patterns of either Copilot or agentic adoption that you're noticing between the two various cohorts? And \nthen anything even through the month of April in the pipeline around sales cycles that you're seeing maybe \ndifferent between the enterprise versus low-end pipeline? \n .....................................................................................................................................................................................................................................................................  \nYamini Rangan \nPresident, Chief Executive Officer & Director, HubSpot, Inc. \nA \nYeah, Alex. Thanks a lot for the question. So if I look at the sales pipeline, it remains healthy across all of the \nsegments, and we've not seen significant changes in pipeline quality or velocity on any one of those segments, \nwhether it is downmarket mid-market or upmarket. And as you can imagine, we're monitoring all of the key \nleading indicators, both top of funnel as well as pipeline conversion very closely. \n \nNow, if I were to give you color in terms of what's happening within the pipeline in Q1 as well as the beginning of \nQ2, I would remark it like a couple of different trends. The first one is we see a lot of multi-hub deals. And the \nconsolidation of tech stack, the pattern that I talked about in the prepared remarks, that is what is continuing to \ndrive that trend. Our prospects are frustrated with disconnected point solutions and hidden costs and overly \ncomplex implementations and setup and our message, but also proven ability to simplify their tech stack and \nlower the total cost of ownership while delivering value is resonating, and that's what we see in the pipeline. \nHubSpot, Inc. (HUBS) \nQ1 2025 Earnings Call \nCorrected Transcript \n08-May-2025 \n \n \n1-877-FACTSET   www.callstreet.com \n \n12\nCopyright © 2001-2025 FactSet CallStreet, LLC\n \n \nNow, in terms of AI, I have a ton of conversations. They really like the fact that AI is built into the platform. Many \nof our customers, and this is kind of a cross segment, they have internal mandates of getting started with AI and \nthey come to us. And we are likely one of the first AI solutions that they're working with, and they appreciate the \nfact that it's embedded, it is easy to use, it's easy to get started with, and they are excited about how fast we're \ninnovating. \n \nAnd I don't necessarily think that there is a difference between segment. The real factor is, is there someone \nwithin the customer who is leaning into AI. That tends to make the difference. But overall, we're winning because \nwe are delivering clear value. We are helping our customers adopt AI quickly. \n .....................................................................................................................................................................................................................................................................  \n \nOperator: Thank you. One moment for our next question. Our next question comes from the line of Rishi Jaluria \nfrom RBC. \n .....................................................................................................................................................................................................................................................................  \nRishi Jaluria \nAnalyst, RBC Capital Markets LLC \nQ \nOh, wonderful. Thanks so much for taking my questions and nice to see continued strong execution in a tough \nmacro environment. I wanted to drill a little bit more into pricing for all these AI solutions. Look, I totally understand \nthe idea that you want to get it in front of customers, go through use case discovery before really trying to collect \nmoney. And I totally get that, I think that's the right thing to do. \n \nIf we think about this idea of HubSpot credits for Breeze Customer Agents and expanding that, I guess two \nquestions there. Number one, how should we be thinking about specifically on what vector are customers paying? \nIs it for the amount of time they're using it? Is it outcome-based pricing? Is it token-based, resource-based? Any \nkind of puts and takes there would be helpful. \n \nAnd maybe alongside that, given how early we are in the technology, how do you balance wanting to obviously \nturn this into revenue over time, but also customers are notoriously terrible at forecasting their own usage of even \nsomething like AWS, let alone cutting-edge technology that pricing can be very opaque and confusing. How do \nyou kind of help remove that friction and make it more predictable for your customers? Thank you. \n .....................................................................................................................................................................................................................................................................  \nYamini Rangan \nPresident, Chief Executive Officer & Director, HubSpot, Inc. \nA \nHey, Rishi, thank you so much for the question. I think it's like a two-part question that I'm going to try and \nanswer. The first one is, how are you thinking about this credit-based system? And then how are you going to \nmake it easy for your customers to kind of like adopt this? And both of those are super important and obviously \nsomething that we have been thinking about quite a bit. Maybe I'll start with grounding us on the philosophy of \nmonetization. \n \nOur philosophy is to deliver value, and once we see consistent repeat value and we have high confidence, then \nwe begin to add monetization levers. That has served HubSpot really well throughout our history, and that is \nexactly what we are doing with introducing Customer Agent as part of the credit-based system. \n \nAnd we launched credit-based pricing at INBOUND last year for Breeze Intelligence. And now because of the \nclear value and the adoption that we have seen with Customer Agents, we're adding Customer Agent to the same \ncredit-based system. \n \nHubSpot, Inc. (HUBS) \nQ1 2025 Earnings Call \nCorrected Transcript \n08-May-2025 \n \n \n1-877-FACTSET   www.callstreet.com \n \n13\nCopyright © 2001-2025 FactSet CallStreet, LLC\n \nAnd really, the way we think about this is we want to make it super easy for our customers to get started, to start \nusing and to scale with agents. And therefore, the way it'll work is Pro and Enterprise customers will have an \nallotment of credit that is included within their subscription. That means when they begin to start using Customer \nAgents, they can do that without adding additional costs. And as they increase usage and they want to scale, they \ncan buy credits and they can either buy pay as you go or they can buy packs of credit. \n \nAnd this gets to the second part of your question, which is by having super easy packs of credit, it gives our \ncustomers, especially scaling businesses, predictability and control over their spend. And that's what we have \nseen even in the earlier adoption of Breeze Intelligence credit packs, they want the ability to be able to predict it, \nand that's exactly what we are doing. \n \nWhat you can expect is that we'll just have a universal credit system. And because we are a platform, not a point \nsolution, that credit consumption will be based on the value that these agents will deliver and provide. So in case \nof Customer Agents, it'll be the number of conversations that we enable with AI. In the case of Prospecting \nAgents, it might be the number of meetings that we book. So it'll consume credit-based on the value that we are \ndelivering. \n \nI feel really good that we are expanding AI monetization to include both seats-based and credit-based component. \nAnd I feel the platform approach that we have taken to bring these agents to bear will really help us scale our \nmonetization alongside the value that we are delivering to our customers. \n .....................................................................................................................................................................................................................................................................  \n \nOperator: Thank you. One moment for our next question. Our next question comes from the line of Parker Lane \nfrom Stifel. \n .....................................................................................................................................................................................................................................................................  \nJeffrey Parker Lane \nAnalyst, Stifel, Nicolaus & Co., Inc. \nQ \nYeah. Hi team, good afternoon. Thanks for taking the question. Kate, I think we anniversaried the new seat-based \npricing during this quarter. I was wondering, when you look at the stability of gross retention and what we see in \nNRR, what are you seeing from those cohorts of customers as we get to that anniversary mark? Is there perhaps \nbetter potential gross retention trends by landing people at the more appropriate levels or more suitable levels to \ntheir needs? \n .....................................................................................................................................................................................................................................................................  \nKathryn Bueker \nChief Financial Officer, HubSpot, Inc. \nA \nYes. Parker, thank you so much for the question. We are continuing to see really nice momentum as it relates to \nthe seats-based pricing model change that that we made about a year ago. What we are seeing is really strong \nand consistent seat upgrade trends, and happens both because customers get started with the seats that they \nneed and they grow from there and it also happens because customers are adopting more core seats, which is a \nreflection of the value that we're delivering in the core CRM, which we always knew. \n \nMigrations continue. They're going well. We continue to expect that most of the customer base will migrate by the \nend of 2025. And as we shared at Analyst Day, we expect that 50% to 60% of the MRR of our existing customer \nbase will go through their first renewal by the end of 2025. I also shared in my prepared remarks that net revenue \nretention is likely to be up a couple points this year. That is, in large part, a result of the tailwinds we're seeing \nfrom the seats-based pricing model change. \n .....................................................................................................................................................................................................................................................................  \n \nHubSpot, Inc. (HUBS) \nQ1 2025 Earnings Call \nCorrected Transcript \n08-May-2025 \n \n \n1-877-FACTSET   www.callstreet.com \n \n14\nCopyright © 2001-2025 FactSet CallStreet, LLC\n \nOperator: Thank you. One moment for our next question. Our next question comes from the line of Elizabeth \nPorter from Morgan Stanley. \n .....................................................................................................................................................................................................................................................................  \nElizabeth Porter \nAnalyst, Morgan Stanley & Co. LLC \nQ \nGreat. Thank you so much. I wanted to follow up on the announcement about Customer Agent expanding beyond \nService Hub. Just given Customer Agent, just went GA, I think, earlier this year. Can you just talk to some of the \nsuccess that you're seeing that gives you confidence to roll out across the broader platform so soon? And also, \ngiven just the benefits of agents plus data, over time, is there an opportunity you think to use agents to push into \nmore adjacent categories that may not necessarily be core hubs today? Thank you. \n .....................................................................................................................................................................................................................................................................  \nYamini Rangan \nPresident, Chief Executive Officer & Director, HubSpot, Inc. \nA \nElizabeth, I love that question. I'll take both the parts there. We're very excited about the momentum that we're \nseeing with Customer Agent. I talked a little bit about the adoption that we're seeing. We have over 2,500 \ncustomers, average of 50-plus resolution rates. And in a number of cases, it just takes 15 to 30 minutes to set it \nup, especially if the customers have well-documented knowledge base and history of tickets. And so this is a \nplace where we feel very comfortable for customers to get started with and get value fast. \n \nBut what is even more interesting, and you mentioned this, is when we were observing the early adoption patterns \ncarefully, what we found is that customers are already using it beyond post-sales support requests. And we're \nseeing customers already use it within marketing, when someone asks them, \"Hey, where's the next webinar? Or \nwhere should I go for this particular event?\" Customer Agents is answering that. Same thing with sales. Sales \nteams are leveraging it to handle inquiries on pricing and product features and driving better prospect \nengagement. \n \nSo the big aha for us is that, one, customers really want the context across the whole customer journey. And two, \nwe are uniquely positioned as a platform to be able to deliver that type of an agent. And so, we really believe that \nCustomer Agent is one where every customer can benefit from and so excited about that. \n \nI think the second part of your question, agents plus data, does that have like a bigger impact? Look, we think that \nwe're just getting started with AI. And if I were to frame it, if everything that we did with our apps was to help \npeople do their jobs, I think agents allow us to do the work to help people. And that's a huge transformation. And \nthat means that the opportunity becomes much bigger. It's not really just the software spend that we're thinking \nabout. It's the labor replacement and the labor augmentation that we can now be part of. And so, is there adjacent \ncategories? Absolutely. I think there's multiple ways in which we can add value to our customers. And that is what \nis exciting about not just where we are getting started, but where we can go over the next few years. Super \nexciting. \n .....................................................................................................................................................................................................................................................................  \n \nOperator: Thank you. One moment for our next question. Our next question comes from the line of Brad Sills \nfrom Bank of America. \n .....................................................................................................................................................................................................................................................................  \nBrad Sills \nAnalyst, BofA Securities, Inc. \nQ \nOh, wonderful. Thank you so much. I wanted to ask a question about agents as well here, if I could. Could you \ngive us a sense for how plug-and-play agents are in HubSpot? Is it as plug-and-play as what HubSpot's known \nfor, the simplicity of getting out single hub, multi-hub deals? Is there a certain amount of data prep that's involved \nHubSpot, Inc. (HUBS) \nQ1 2025 Earnings Call \nCorrected Transcript \n08-May-2025 \n \n \n1-877-FACTSET   www.callstreet.com \n \n15\nCopyright © 2001-2025 FactSet CallStreet, LLC\n \nhere? Were you kind of used to thinking about this as an effort for customers in a deployment cycle, the data \nlayer, and then the orchestration? Or are these just features that run within HubSpot and customers don't think of \nit any differently than that? So just if you could provide a little sense for the effort involved, if at all, to spin up an \nagent. \n .....................................................................................................................................................................................................................................................................  \nYamini Rangan \nPresident, Chief Executive Officer & Director, HubSpot, Inc. \nA \nYeah. I would say that you'd have to expect that we'll take any technology and we'll make it easy for our \ncustomers to adopt. I think that's why we have won, and that's why we will continue to win in the agentic world as \nwell, Brad. And maybe to answer your question in a little bit of depth, agents can augment work for every go-to-\nmarket employee. \n \nAnd in order for agents to do it effectively, you need a few things. First of all, agents thrive on data, structured \ndata, unstructured data, external data. And we have always been fantastic at having that structured data. Now \nwe're expanding and getting all of that unstructured data so we can give agents deep, actionable insights from \nthat data right out of the box. \n \nThe second thing is agents need context. Imagine like employee getting onboarded within a company, well, that \nemployee needs context. What's your product? Who is your customer? What's your brand voice? How do you \ncommunicate to your ideal customer profile? That's exactly what an agent needs, and we have that ability to bring \nthat context across the customer journey. And so the agents that we're developing naturally have the deep \ncontext across the whole customer journey. And then there's – agents need intelligence. They need to be able to \nreason, they need to be able to act, and that's why our platform-centric approach works. \n \nSo all of this, what does it translate into for our customers? Well, our customers will need data. And if not, we'll \nhelp them get the data in a single unified matter. And once they have the data, then adopting agents is not such a \nbig deal. Once they have the data, especially like for Customer Agents, we're seeing – it takes like 15, 30 \nminutes. If you have well-documented knowledge bases, if you have a history of support ticket, if you have \nenough to feed that agent, it takes no more than that. So our job is to take complex technology and be world-class \nat applying that technology to SMBs, and that's what we're excited about, and that's how we're driving the \ninnovation in this cycle. \n .....................................................................................................................................................................................................................................................................  \n \nOperator: Thank you. One moment for our next question. Our next question comes from the line of Joshua \nReilly from Needham. \n .....................................................................................................................................................................................................................................................................  \nJoshua Reilly \nAnalyst, Needham & Co. LLC \nQ \nAll right. Thanks for taking my question. How are you thinking about the normalization of upgrades in 2025 after a \nfew years where you could argue there was some pent-up demand building? And how are you thinking about this \ncontribution to net new ARR growth for the year versus the last few years? Thank you. \n .....................................................................................................................................................................................................................................................................  \nKathryn Bueker \nChief Financial Officer, HubSpot, Inc. \nA \nYeah, Josh, thank you very much for the question. I think that I would answer the question maybe by taking a step \nback and talking about what we are seeing with net revenue retention, which is really where you see the impact of \nupgrades show up in our metrics. \n \nHubSpot, Inc. (HUBS) \nQ1 2025 Earnings Call \nCorrected Transcript \n08-May-2025 \n \n \n1-877-FACTSET   www.callstreet.com \n \n16\nCopyright © 2001-2025 FactSet CallStreet, LLC\n \nAs you know, net revenue retention was kind of seasonally down a couple of points, but the conversation we had \nlast quarter was that we were going to see net revenue retention up a couple of points in 2025 relative to 2024. \nThis is a reflection of a couple of things. The first is really a continued strong customer dollar retention. We \nconsistently see customer dollar retention hanging out in the high-80s, which is a very healthy number. And then \nwhat we are seeing in terms of upgrades and sort of the year-over-year growth is very much focused around seat \nexpansion. And we made the pricing model change to the new seats-based pricing model about a year ago. We \nare seeing seat upgrade rates be up year-over-year. \n \nAnd again, that's a combination of new customers who start on the new seats-based pricing model, buying what \nthey need, adopting more seats over time as their businesses grow. And it's also a reflection of higher paid seat \nratios. We are monetizing the core CRM through our core seats. That was something new in the new pricing \nmodel, and we are seeing customers really see value in that core CRM functionality. And that's the main driver of \nthe increased expansion year-over-year. \n .....................................................................................................................................................................................................................................................................  \n \nOperator: Thank you. One moment for our next question. Our next question comes from the line of Keith \nBachman from BMO. \n .....................................................................................................................................................................................................................................................................  \nKeith Bachman \nAnalyst, BMO Capital Markets Corp. \nQ \nHi. Thank you very much. I wanted to try to understand how you're thinking broadly about consumption revenue \nadding to the model. So, to break it down, you did introduce consumption-based pricing last year. Yamini, you \nclearly said that the Customer Agents wouldn't contribute this year. But I'm trying to understand, if I think \nphilosophically about the next couple years, how will consumption-based pricing contribute to revenue growth? \nAnd either the answer could be something to the extent of we see it adding X basis points or more likely. \n \nIs there any way to characterize if you thought about your growth algorithm that 90% comes from traditional seat \nbase and 10% comes from consumption? But any dynamics you could give us on how, at least philosophically, \nyou're thinking about consumption adding to growth over the longer term? Thank you. \n .....................................................................................................................................................................................................................................................................  \nKathryn Bueker \nChief Financial Officer, HubSpot, Inc. \nA \nYeah. Thanks, Keith. And I'll just start by appreciating the reiteration you had that, that the new credit-based \nmodel will not have a material impact on 2025. So thank you. That said, over the medium to long term, we are \nreally excited about the opportunity to drive top-line growth through our consumption model through credits on AI \nand other forms of consumption. That said, and you heard this from Yamini, we do believe that AI is a mix of \nseats and consumption through the credit system. And it's honestly early for us to really understand how that \nbalance will play out over time. I would say, as we learn, we will continue to share more information with you. \n .....................................................................................................................................................................................................................................................................  \n \nOperator: Thank you. One moment for our next question. Our next question comes from the line of Ken Wong \nfrom Oppenheimer & Co. \n .....................................................................................................................................................................................................................................................................  \nKen Wong \nAnalyst, Oppenheimer & Co., Inc. \nQ \nThank you for taking my question. Kate, you mentioned moderating customer net adds down to 9,000 from 9,000 \nto 10,000. Is that just kind of the seasonal dynamics of the back half? Or are you deliberately trimming that funnel \na little bit due to the macro uncertainty? \n .....................................................................................................................................................................................................................................................................  \nHubSpot, Inc. (HUBS) \nQ1 2025 Earnings Call \nCorrected Transcript \n08-May-2025 \n \n \n1-877-FACTSET   www.callstreet.com \n \n17\nCopyright © 2001-2025 FactSet CallStreet, LLC\n \nKathryn Bueker \nChief Financial Officer, HubSpot, Inc. \nA \nYeah. Thanks, Ken, for the question. I think you know, like over the last few quarters, we've talked about 9,000 to \n10,000 as the range to be focused on for net adds. This quarter, we came in a little bit above, which was nice. \nMaybe I would say the following. We continue to see healthy growth additions through all of our customer sizes. \nWe continue to see really nice Professional and Enterprise net customer adds. At the starter tier, we are lapping \nthese large cohorts of starter additions that were driven by pricing and packaging changes. And it's that \nexpectation that that's going to continue here that leads us to point toward a net adds number that's closer to \n9,000. \n \nNow, you didn't ask the question, but I'm going to answer it anyway, which is what's going to happen to ASRPC \nas a result, because that's frankly just an output metric. In Q1, you saw ASRPC down low single digits, which was \nin line with what we told you last quarter. We're going to expect over the next couple of quarters that ASRPC \ngrowth is basically going to be flat. \n .....................................................................................................................................................................................................................................................................  \n \nOperator: Thank you. One moment for our next question. Our next question comes from the line of Jackson \nAder from KeyBanc Capital Markets. \n .....................................................................................................................................................................................................................................................................  \nJackson E. Ader \nAnalyst, KeyBanc Capital Markets, Inc. \nQ \nGreat. Thanks for taking our questions guys. Kate, I think part of the expectation for net retention rate to improve \nalso has to do with the pricing adjustment, right, the pricing increase of no more than 5% upon renewal on the \nseats-based model. And I'm just curious, given now that we are introducing more credit-based pricing on the \nhigher tiers, and uncertainty persists. Any kind of update on what you're thinking in terms of your willingness or \nflexibility for customers coming up for renewal on the pricing increase in the second half? \n .....................................................................................................................................................................................................................................................................  \nKathryn Bueker \nChief Financial Officer, HubSpot, Inc. \nA \nYeah. Thanks very much for the question. You are right that the net revenue retention increase year-over-year is \na combination of healthier seat upgrade rates and the pricing impact. Customers migrate from the old legacy \nmodel to the new seats-based pricing model at a neutral ARR. And then when they come up for their first renewal, \nwe said we would take up to 5%. That has been going – the sort of total migration of customers over to the new \nseats-based model has been going well, going very similar to plan. I think the expectation is that, that will continue \nthrough the year. \n .....................................................................................................................................................................................................................................................................  \n \nOperator: Thank you. We have time for one more after this. Our next question comes from the line of Kirk \nMaterne from Evercore ISI. \n .....................................................................................................................................................................................................................................................................  \nKirk Materne \nAnalyst, Evercore ISI \nQ \nThanks very much for taking the question. I don't know who should take this, Dharmesh or Kate or Yamini. But I \nwas just kind of curious, can you give us an update on sort of the use of AI internally at HubSpot and maybe how \nthat's trending? And if there's any impact sort on you all from a, I guess, an OpEx growth perspective? I know \nthere's a lot – Dharmesh, on your side in terms of the coding agents and the benefits of those, we've heard a lot \nfrom some of your peers. So I just wondered if you could give us a quick update on that. Thanks. \n .....................................................................................................................................................................................................................................................................  \nHubSpot, Inc. (HUBS) \nQ1 2025 Earnings Call \nCorrected Transcript \n08-May-2025 \n \n \n1-877-FACTSET   www.callstreet.com \n \n18\nCopyright © 2001-2025 FactSet CallStreet, LLC\n \nYamini Rangan \nPresident, Chief Executive Officer & Director, HubSpot, Inc. \nA \nYeah, Kirk, I'm happy to take this and answer it, this is Yamini. Look, we were very early in our pivot to using AI \ninternally, just as quickly as we pivoted from a product roadmap perspective, we've been experimenting and \nscaling internally. 2023, 2024 was a lot of experimentation and learning. And this year and next year is going to \nbe a lot of scaling from the lessons that we have learned. And probably I'll highlight a few areas that we are using \ninternally and getting a ton of value. \n \nThe first one is support. Now we've talked about support being a slam dunk use case in terms of leveraging AI. \nLast year, 35% of our support tickets were resolved with AI. Already in Q1, we're seeing up to 41%. And we've \nbeen able to hold head count flat within our support organization for the last 18 months, and we've been able to \ndrive more proactive support based on how we're doing this. So that's an area. \n \nI'd say the prospecting is another one. You can imagine AI being super easy to look at accounts and send emails \nto accounts and set up meetings. And in Q1, we booked nearly 11,000 meetings using AI for our sales team. So \nit's driving productivity there. And of course, marketing, we've been doing a lot of work internally with marketing. \n \nAnd we've been at the forefront of leveraging it, and we've seen clear improvements in e-mail conversion rates up \nto 80% improvement in email conversion rates through leveraging AI for personalization, and we've been able to \nmove most of our web chats that are now being handled by AI and automation. So within our go-to-market \nengine, there's just a ton of experimenting and scaling with AI, and we feel really good about what that will lead to \nin terms of mid-term and long-term efficiencies. \n \nAt the same time, we're using it within our product organization. Our developers are using AI to increase their \nproductivity. And one of the reasons we've been able to accelerate our pace of innovation over the last couple of \nyears and certainly this last year has been leveraging AI. What is interesting is that the first gen of developer \nproductivity was via Copilot types of things like GitHub. And now we're on to using Cursor and Claude code and \nleveraging agents for developer productivity, and that is super exciting. So overall, we have a huge set of \ninitiatives that we're scaling and this is all going to have mid-term to long-term impact in terms of efficiency, but we \nalso have this added benefit of learning fast and sharing those best practices with our customers. So feel very \ngood about it. \n .....................................................................................................................................................................................................................................................................  \n \nOperator: Thank you. This concludes the HubSpot Q1 2025 earnings call. Thank you to everyone who was able \nto join us today. You may now disconnect your lines. \n \n \n \n \n \n \n \n \nHubSpot, Inc. (HUBS) \nQ1 2025 Earnings Call \nCorrected Transcript \n08-May-2025 \n \n \n1-877-FACTSET   www.callstreet.com \n \n19\nCopyright © 2001-2025 FactSet CallStreet, LLC\n \n \n \n \nDisclaimer \nThe information herein is based on sources we believe to be reliable but is not guaranteed by us and does not purport to be a complete or error-free statement or summary of the available data. \nAs such, we do not warrant, endorse or guarantee the completeness, accuracy, integrity, or timeliness of the information. You must evaluate, and bear all risks associated with, the use of any \ninformation provided hereunder, including any reliance on the accuracy, completeness, safety or usefulness of such information. This information is not intended to be used as the primary basis \nof investment decisions. It should not be construed as advice designed to meet the particular investment needs of any investor. This report is published solely for information purposes, and is \nnot to be construed as financial or other advice or as an offer to sell or the solicitation of an offer to buy any security in any state where such an offer or solicitation would be illegal. Any \ninformation expressed herein on this date is subject to change without notice. Any opinions or assertions contained in this information do not represent the opinions or beliefs of FactSet \nCallStreet, LLC. FactSet CallStreet, LLC, or one or more of its employees, including the writer of this report, may have a position in any of the securities discussed herein. \n \nTHE INFORMATION PROVIDED TO YOU HEREUNDER IS PROVIDED \"AS IS,\" AND TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, FactSet  CallStreet, LLC AND ITS LICENSORS, \nBUSINESS ASSOCIATES AND SUPPLIERS DISCLAIM ALL WARRANTIES WITH RESPECT TO THE SAME, EXPRESS, IMPLIED AND STATUTORY, INCLUDING WITHOUT LIMITATION ANY IMPLIED \nWARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, ACCURACY, COMPLETENESS, AND NON-INFRINGEMENT. TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE \nLAW, NEITHER FACTSET CALLSTREET, LLC NOR ITS OFFICERS, MEMBERS, DIRECTORS, PARTNERS, AFFILIATES, BUSINESS ASSOCIATES, LICENSORS OR SUPPLIERS WILL BE LIABLE FOR ANY \nINDIRECT, INCIDENTAL, SPECIAL, CONSEQUENTIAL OR PUNITIVE DAMAGES, INCLUDING WITHOUT LIMITATION DAMAGES FOR LOST PROFITS OR REVENUES, GOODWILL, WORK STOPPAGE, \nSECURITY BREACHES, VIRUSES, COMPUTER FAILURE OR MALFUNCTION, USE, DATA OR OTHER INTANGIBLE LOSSES OR COMMERCIAL DAMAGES, EVEN IF ANY OF SUCH PARTIES IS ADVISED \nOF THE POSSIBILITY OF SUCH LOSSES, ARISING UNDER OR IN CONNECTION WITH THE INFORMATION PROVIDED HEREIN OR ANY OTHER SUBJECT MATTER HEREOF. \n \nThe contents and appearance of this report are Copyrighted FactSet CallStreet, LLC 2025 CallStreet and FactSet CallStreet, LLC are trademarks and service marks of FactSet CallStreet, LLC. All \nother trademarks mentioned are trademarks of their respective companies. All rights reserved.", "q_a": ""}, "content_hash": "04c38cac44d9b8c04bf84e281a9ded2910d2dc5a2c2410d2e6e0a9b3be3f1801", "transcript_name": "HubSpot Q1 2025 Earnings Transcript.json"}