{"validated_at": "2025-09-02T10:51:26.039914", "input": {"call_type": "conference", "summary_length": "long", "answer_format": "prose", "filename": "MicrosoftConference.pdf"}, "transcripts": {"presentation": "................................................................................................\n....................................................................\nCOPYRIGHT © 2025 S&P Global Market Intelligence, a \ndivision of S&P Global Inc. All rights reserved\nspglobal.com/marketintelligence\nMicrosoft Corporation \nNasdaqGS:MSFT\nCompany Conference Presentation\nThursday, August 28, 2025 5:30 PM GMT\n \n \nCALL PARTICIPANTS\n2\nPRESENTATION\n3\nQUESTION AND ANSWER\n4\nMICROSOFT CORPORATION COMPANY CONFERENCE PRESENTATION  AUG 28, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n2\nCall Participants\n....................................................................................................................................................................\nEXECUTIVES\nVasu Jakkal\nANALYSTS\nBrad Alan Zelnick\nDeutsche Bank AG, Research\nDivision\nMICROSOFT CORPORATION COMPANY CONFERENCE PRESENTATION  AUG 28, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n3\nPresentation\n....................................................................................................................................................................\nBrad Alan Zelnick\nDeutsche Bank AG, Research Division\nOkay. I think we're live. Awesome. Welcome back, everybody. Once again, I'm Brad Zelnick with the\nSoftware Research team here at Deutsche Bank. For this session, we are very pleased to have none other\nthan Microsoft specifically, Vasu Jakkal, do I have that right?\nVasu Jakkal\nRight.\nBrad Alan Zelnick\nDeutsche Bank AG, Research Division\nI always take a little bit of risk in pronouncing a last name, but who is Corporate Vice President of\nMicrosoft Security, which for those that don't realize is the most significant security business of all security\nbusinesses worldwide by a significant factor. But format of this presentation is going to be a fireside chat.\nI've got a bunch of prepared questions that I'm hoping we can get through, and we're going to get a lot\nsmarter on the topic of cybersecurity and why it's so important to Microsoft. So with that, thank you so\nmuch for joining us today.\nVasu Jakkal\nThat's a pleasure, Brad, and it's nice to be in Dana Point with you.\nBrad Alan Zelnick\nDeutsche Bank AG, Research Division\nIsn't it lovely?\nVasu Jakkal\nIt's beautiful. I might even take up golf now, but this...\nBrad Alan Zelnick\nDeutsche Bank AG, Research Division\n[indiscernible] this would be a perfect time and a perfect place. Well, again, thanks so much for being\nhere. Maybe for those that don't know you and are less familiar with Microsoft Security business, can you\njust take a minute to explain your role at Microsoft and what your mandate is?\nMICROSOFT CORPORATION COMPANY CONFERENCE PRESENTATION  AUG 28, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n4", "q_a": "Question and Answer\n....................................................................................................................................................................\nVasu Jakkal\nYes, absolutely. So Thank you, everyone, for joining. It's great to be here with you all. I've been at\nMicrosoft now for 5 years, and I'm responsible for our Security business. So I joined really to build a\nbusiness and I oversee our security portfolio end-to-end globally that involves defining the strategy,\nworking with Charlie, our engineering leader on products and then, of course, all the go-to-market,\nincluding business models. And this portfolio is pretty broad. We have 6 product families as part of that,\nand we really protect end-to-end. So starting with threat detection and security operations, defending\nagainst all the attacks coming at organizations. That's our Defender and Sentinel product line. We have\nIdentity. We started with Identity Management, but we have Protection and Governance, that's Entra.\nAnd that picture, I think we'll have a picture for you that shows the portfolio. We also have device\nmanagement and that's Intune. And then finally, given, of course, AI data security has reached a critical\npoint. And we have Purview, which is our data security Protection and Governance family. So those are all\nof the families within the Microsoft Security portfolio. We also have our generative AI Security Solutions\ncalled Security Copilot, which integrates with each of our products and also it can be used stand-alone and\nthat constitutes the Microsoft security platform.\nBrad Alan Zelnick\nDeutsche Bank AG, Research Division\nThank you for that. And I think we do -- there it is.\nVasu Jakkal\nThat's it.\nBrad Alan Zelnick\nDeutsche Bank AG, Research Division\nExcellent. A picture is worth a 1,000 words, I think they say. Thank you for that overview. Super helpful.\nAnd maybe just at a very high level, with nearly 1.5 million Security customers. That's a massive number.\nMicrosoft clearly has a unique perspective into broader trends and what's going on in the world. What are\nyou seeing in the current environment?\nVasu Jakkal\nYes, it's a great question, Brad. So we're seeing 3 challenges, which are -- which every organization is\nfacing right now. The first 1 is the threat landscape. It's at unprecedented levels right now, the speed,\nthe scale and the sophistication. And just to give you an idea, last year, we were seeing 4,000 password\nattacks per second because Identity continues to be a battleground of security. This year, we're seeing\n7,000 password attacks per second. So that's 600 million attacks every single day. So that -- just the\nscale is a lot. The speed is also -- has also increased. On average, it takes attackers 72 minutes or less\nto infiltrate an organization. So from when a user clicks to a phishing link to when the actor gets access\nto your data, sometimes your [ full ] inbox. That's not a whole lot of minutes for a Defender to protect\nan organization. And then we're seeing the number of attackers has also increased. The cyber crime is a\n$9.2 trillion anti-economy every year, that's increasing. And just from the number of attackers that we are\ntracking at Microsoft, last year, we were tracking 300 unique nation-state and financial crime actors. This\nyear, we are tracking 1,500. So that's a 5x increase. So that's challenge #1, is unprecedented levels of the\nthreat landscape. Challenge #2 is data. Data risk and insider risks are increasing. 20% of data breaches\nare caused by insiders, whether it's intentional or unintentional, doesn't matter, but that's kind of the\nstat. 80% plus leaders are concerned about data, especially as AI becoming mainstream. And then the\nthird challenge is complexity, fragmentation continues in the security industry. This industry was built by\na lot of bolt-on tools. On average, organizations have 40-plus tools, and they have to stitch it together,\nespecially when the security talent doesn't exist. There's more than 4 million jobs, I think 4.7 million\nwas the latest stat, which are unfulfilled in security right now. But they don't have the talent to fit that,\nMICROSOFT CORPORATION COMPANY CONFERENCE PRESENTATION  AUG 28, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n5\nand then you have a very complex regulatory environment. This year we, I think, there are 100-plus AI-\nrelated regulations. Every day, there are 250-plus regulatory updates. So that's a lot for organizations to\ndeal with. The challenge #1, threat landscape; two, data risk; three complexity. And what we're seeing\nin terms of trends and solutions now is GenAI. So both using AI for security, like how do you turbocharge\ndefense. That is a super power that we have to leverage. And we're also seeing security for AI. You have\nto secure all of this AI and then the last 1 is consolidation, simplification and end-to-end protection. So\nthat's what we're seeing aligned to these challenges.\nBrad Alan Zelnick\nDeutsche Bank AG, Research Division\nIIt's a lot to keep up with, I don't know when you sleep. By the way, does everybody in the room hear\nVasu, okay? I just want to make sure. Okay, cool.\nGreat. Me doing my own AV check. Like I said, a lot to keep up with, and the interesting part about cyber,\nit seems it's the only adversarial aspect of IT. It's been a perennial game of cat and mouse. And the\nindustry feels more competitive than ever with multiple platforms, all attempting to consolidate across\nvarious segments. Can you just help us understand Microsoft -- how Microsoft differentiates itself amidst\nwhat is such a noisy landscape out there?\nVasu Jakkal\nYes. It's extremely noisy, and I love what you said, it's a cat and mouse game. I feel like for those\nwho like hiking, I feel we are like hiking up Kilimanjaro and someone's actively throwing boulders at\nus. That's what it feels like in security any single day. But in terms of -- and this is the main reasons\nMicrosoft is in security because we are a software and a platform player, and we are security players.\nSo we have strength across both. And our biggest strength is that of the platform. But the 3 things that\nmake us unique. The first 1 is signals. You cannot defend what you cannot see. Every single day Microsoft\nprocesses 84 trillion signals. And just to give you an idea of that magnitude and the growth, when I joined\nMicrosoft 5 years back, we were tracking 8 trillion signals. So that's a 10x investment and increase just\nin 5 years. These signals help us understand who the attackers are, what are they up to? How are they\nattacking organizations? And you take that and you marry that with our human threat intelligence of 1,500\nthreat actors, we do have the largest and deepest threat intelligence in the industry. So that's number\none, which is our differentiator. Number two, we talked about the complexity, the fragmentation. Attacks\ncome from everywhere. They're not going to just start with your end point or your identities. We have to\nlike monitor it all. Microsoft has the most comprehensive portfolio. We've been believers in this end-to-\nend. So you can't just protect your endpoint or identities, you have to look all around. We integrate 50-\nplus categories today and we bring them to life in that portfolio. So you can have a consolidated solution\nfrom Microsoft. The third thing is we make sure that we have best-of-breed solutions in the areas that\nwe are participating. So whether it is Identity, which is where our roots are, its device management, it's\ndata security, it's cloud security, it's endpoint, it's SIEM, SecOps. We have best-of-breed in 19 categories\nacross the industry, the only leader which is best-of-breed in the largest number of categories. And then to\nstop all of this is GenAI. We were at the leading edge of GenAI in 2023 when ChatGPT and Copilot became\nmainstream. So we have this deep understanding of what is needed for AI and the AI stack and leveraging\nthat really to understand, well, how do you secure this AI, both using AI for defense so that's Copilot and\nwe were the first to market with a GenAI solution. In fact, our security Copilot is used by more than 1,000\ncustomers and there are some statistics which are showing how they are making a difference, like 30%\nreduction in mean time to response. And we are securing the GenAI solutions across. So I think those 4\nthings signals, making sure that we have end-to-end protection with best-of-breed that we have GenAI\nand that we are continuously building a platform, integrating the ecosystem is what sets us apart.\nBrad Alan Zelnick\nDeutsche Bank AG, Research Division\nNo doubt, puts Microsoft in a very differentiated position. I want to double-click on AI and I feel\nlike -- we've almost made it 10 minutes and we didn't really spend too much time focusing on, it's\n[indiscernible].\nMICROSOFT CORPORATION COMPANY CONFERENCE PRESENTATION  AUG 28, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n6\nVasu Jakkal\nYou think of AI, right?\nBrad Alan Zelnick\nDeutsche Bank AG, Research Division\nYou've heard o this, right? So yes, it's a multidimensional topic. So 3 related questions. You've touched on\nthis a bit already, but how have you seen the threat landscape change with AI specifically? I don't know\nif you can further quantify or give us a sense of what the impact has been. How should we think about\nMicrosoft's response to better leverage AI security Copilot, et cetera, [ learn ] a little bit more about that\nand how we're going to protect AI itself?\nVasu Jakkal\nYes. I know it feels it's like water now. It's all around us and we're spinning in it. So from an AI standpoint,\nthe threat actors are really smart. They are going to use every tool which is available to them. And\nso the types of attacks that we can expect to see and we're seeing is every single dimension that you\nthink of, whether it is identity attacks of phishing attacks, think of them just getting faster and the scale\nincreasing. In phishing, we're seeing social engineering. I'm sure you've seen a lot of the deepfakes on\nhow AI can be used, very convincing. And they have more context now. They can do [ Recon ] very easily.\nWe published a report almost a year back with OpenAI on some of the nation-state related actors and\nwhat they're using AI for, and we saw that they're doing a lot of [ Recon ] with it. But using that context,\ngetting smarter, really mimicking humans more with phishing and providing that, they're going to see\nthat. Identity, we talked about identity being the battleground of security, with AI now you can do faster\npassword cracking. I mean how many of us still have passwords? We still live in a password world. So\nthat's going to be challenging. Everything from command and control to make do lateral movements and\nhow they're using AI to just get better intelligence on your organizations and what we're going to see from\nthreat actors. But more than that, I think one of the Other aspects of AI is it introduces new surface areas.\nSo in addition to what we consider existing surface areas, your devices and identities and network, think\nabout prompts, that's a new attack area. Think about LLM models, think about AI-related data. So we are\ngoing to start seeing them also leverage those attack surfaces and try to get into organizations through\nthat. So it's using our existing attack surfaces and they're really trying to leverage AI to get smarter and\nfaster and inside the [indiscernible] and leverage the new surface areas to use that as a leverage for\nthem. Now in terms of Brad, you asked, how are we going to protect against that? So you have to think\nabout protecting the entire AI stack. And so foundational security, whether it's modeled, it's the AI stack\nitself. It's what we call built-in content safety, all of those measures, we have to have that. And then you\nhave to have security measures all around, so you're monitoring and your governing AI while it is being\nused in organization. So that's how we are using AI and of course, we have to use AI for security because\nyou can't keep up with these attacks by just what we were doing earlier. We have to start using GenAI.\nBrad Alan Zelnick\nDeutsche Bank AG, Research Division\nWe need AI to fight AI.\nVasu Jakkal\nYou need AI to fight AI, beautifully said.\nBrad Alan Zelnick\nDeutsche Bank AG, Research Division\nIt makes a lot of sense. Microsoft is obviously continually innovating, once stat that stood out to us, is\nthat 5 of 11 recently released security Copilot agents were developed by partners such as OneTrust and\nTanium with 2 names that I remember. But can you tell us why Microsoft's collaborative approach to the\necosystem is so important?\nVasu Jakkal\nMICROSOFT CORPORATION COMPANY CONFERENCE PRESENTATION  AUG 28, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n7\nYes. We've always said that security is a team sport. And if you truly look at what we're all up against is\nthese very smart threat actors who have unlimited resources in many ways. I mean cyber crime is a gig\neconomy itself. So we have to collaborate as an industry, and Microsoft is a big believer that we all have\nto work together and figure out how to stitch together our solutions so that we can defend end-to-end.\nWe built a platform that's Sentinel, and we have 350 connectors in it. And as agents get developed and\nthey're going to use these platforms, they're going to use the data, we need to make sure that we are\nenabling everyone to build agents because really, the next frontier is Agentic AI, and we didn't talk a lot\nabout that, but your -- today, we have assisted agents. Tomorrow, these agents are going to -- and you're\nstarting to see them. They're getting very autonomous and you're going to enter at -- what we call frontier\norganization. So as we think about security, we have to help organizations build these agents. And so we\nlaunched our first 11 agents earlier this year, 6 from Microsoft, tackling some of the biggest challenges\nlike phishing and identity and data security that we talked about. And then we have 5 agents, Brad, to\nyour point from the ecosystem. And we're really excited. I mean I think the best part of this is that we\nare working with the ecosystem. So we have Tanium doing alert triaging agents. We have OneTrust doing\nprivacy agents. We have Aviatrix doing network agents for us. And this just completes the portfolio. So\nnow a customer can get all of it from 1 platform through Copilot and protect themselves. So that's going\nto be a big focus of ours is getting more partners to develop agents.\nBrad Alan Zelnick\nDeutsche Bank AG, Research Division\nMakes sense. It's a team sport. As I think about Microsoft from the very top down, trust and security are\ncompletely paramount. And Microsoft has done work around the secure future initiative that's very, very\nimpressive. We saw a stat released a few months ago, Microsoft has dedicated the equivalent of 34,000\nengineers working full time for 11 months to this project. I mean, that's bigger than other massive scale\ncompanies, let alone a single project. Can you tell us a bit more about this and why it's so important?\nVasu Jakkal\nSo Microsoft started the journey of the Secure Future Initiative years back in 2024. And actually in 2023\nfall is when we introduced and then we doubled down. The reason Secure Future Initiative is important\nis for all the reasons we just talked about. We are in the age of AI. We are in the age of Agentic AI, and\nthe way we have defended organizations even 5 years back is different than how we need to defend\norganizations going forward. The Secure Future Initiative was born out of the need for defending first\nMicrosoft, learning through that and then protecting our customers and our ecosystem for this age of\nAI. There were some very challenging attacks related to nation-state actors that we are facing. And we\nhad to rethink about how do we make sure that security is a priority, not just for the security team, but\nfor every single person at Microsoft. And as much as it is an engineering transformation, it is a cultural\ntransformation. And we are hoping that we can use this blueprint to help our customers and to help our\necosystem in general. Secure Future Initiative is based on Zero Trust principle. So that is a I think a\nlasting framework for the security industry, which starts with verifying explicitly, having least privileged\naccess and assuming breach. And the 3 principles are secured by design. So every line of code that\nyou write has to be secure from the [indiscernible], secure by default, security should be out of box.\nYou should not be bolting it on. And then secure operations all around, if we want to secure that. We\nhave 6 engineering pillars, everything from protecting your network, your identities, your engineering\nsystems, your tenants and production systems, making sure the accelerating response and remediation\nto making sure we are continuously monitoring and detecting threats. And as you said, we have 34,000\nengineers. One of the most important things about Secure Future Initiative is our CEO declared this as\nthe #1 priority. Security is the #1 priority for Microsoft, so above all else, because without security, you\ncannot have trust. And every single employee at Microsoft now has a security priority. A compensation, it's\ntied to that. We review our progress with Satya, our CEO every 2 weeks. We send a report every week and\nof course, with the Board from a governance standpoint. So it's a pretty big initiative. And they're using\nSecure Future Initiative to really turbo charge our flywheel of defense, this portfolio that you see. So as\nwe learn, we're using all of those things and those investments to make sure that we are building products\nwith those innovations so that we can then protect our customers.\nBrad Alan Zelnick\nMICROSOFT CORPORATION COMPANY CONFERENCE PRESENTATION  AUG 28, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n8\nDeutsche Bank AG, Research Division\nAwesome. That is great. I wanted to turn for a moment to what's happening in security operations. And\nwhat's really caught our eye of late is just the innovation that Microsoft is driving within the SOC with\nSentinel and especially in the midst of a number of other cyber platforms that are [indiscernible] to\ndisplace legacy SIEM solutions out there. Would love to hear how you view the SOC evolving and where\nthe most interesting opportunities are?\nVasu Jakkal\nYes. And thank you for saying the kind words about our innovation. It's been a journey for us. And if you\nlook at even the security operations market, it's getting disrupted, like categories are getting disruptive.\nAnd by the way, GenAI is going to be a major category disruptor. What we saw early on is SIEM, XDR,\nlike SOAR, UEBA, you have all these like acronyms in the security industry. There are a lot of acronyms.\nBut they're all really trying to do the same thing, which is secure organizations, give them visibility and\nprovide that -- find that needle in the haystack. So what we did was we combined what was extended\ndetection and response. So protecting your e-mail, protecting your endpoint, protecting your cloud apps,\nprotecting your identities all into one. And then we took SIEM, which is your security information event\nmanagement, and we brought them together. So we were the first ones in the industry to bring XDR\nand SIEM together. And we are using now that with, of course, with GenAI and AI and machine learning\nto turbocharge that. We're also integrating security Copilot into that. So we have -- we are seeing like\nadvances in that. And we have just announced a recent data lake, so not only do you have analytics and\nthe hot tier, but you also have cold tier because one of the things we hear from our customers is, it's\nreally expensive to have SIEMs to all of this data. So that's the convergence we have been driving. We are\nleaders in both SIEM and XDR. So we are best-of-breed in those. And now with GenAI, I think we're going\nto see a tremendous amount of just innovation and leapfrogging across that. So it's been -- it's been great\nto see that. And these are very big businesses for us as well, as you know, Brad, like we have shared\npublicly that just our Sentinel business is $1 billion. And 2 years back, we shared across like our Security\nbusiness is more than $20 billion in revenue, which is a big number.\nBrad Alan Zelnick\nDeutsche Bank AG, Research Division\nIt's a big number. And as we talk about the SOC, Sentinel in our conversation with CISO is a foundational\nelement of their strategy. So it's not surprising. I wanted to turn to a different topic. Palo Alto Networks\nrecently announced the acquisition of CyberArk, which I think really shines the light on the importance\nof identity security. Not that it always wasn't important. But I mean, they're making a call that now is an\ninflection point. Microsoft already has a very strong presence with Entra. But as competitors expand from\ntheir core competencies, how you think about the architectural center of gravity or capabilities around\nwhich identity strategies will coalesce.\nVasu Jakkal\nYes. And I always believe that an investment by any company in security is a good investment for the\nsecurity industry because we -- it's challenging for all of us. I feel like we are all on the same side. But\nalso it reinforces our strategy in so many ways because we started with identity. We believe identity is the\nboundary in this boundaryless world, right? I mean even going back to the pandemic and remote work and\nall of that, it was identity. And it is the first thing we do as you log in, you log into a system. Our old CISO\nused to say, attacker don't break in, they log in. So it just kind of reemphasizes how important identity\ncontinues to be. And we've been on this identity journey, Brad, like you've been following us for many,\nmany years. We started with identity management, with Entra, we extended to Protection and conditional\naccess, which is really our policy engine at the heart of it. and then, of course, Identity Governance more\nrecently and then [indiscernible]. So we have the entirety of the identity portfolio. It is very critical for our\nsecurity portfolio, see Entra there. And it's very critical because for Zero Trust because Zero Trust really\nstarts with identity. So this is a big place where we're going to make investments. The other thing I'd say\nis in the age of Agentic AI, identity, again, becomes that tip of the spear because these agents, these\nautonomous agents are all going to need their own identity, and we announced just a couple of months\nback. that we have agent ID. So Entra now can provide agents IDs so that we can now have them and\nMICROSOFT CORPORATION COMPANY CONFERENCE PRESENTATION  AUG 28, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n9\nthey're doing autonomous work, track them just like we would in humans. So I think expect to see a lot\nmore innovation from us in the identity side.\nBrad Alan Zelnick\nDeutsche Bank AG, Research Division\nWe look forward to it. So Vasu, we've talked about AI security. We've talked about the SOC. Where else\ndoes Microsoft see opportunity within the broader security landscape?\nVasu Jakkal\nYes, we covered a lot of ground. I think what we're seeing is that consolidation is going to be continuously\na major theme for us. Ultimately, security is going to be about simplification. It is going to be about\nGenAI. And it's going to be about making sure these key areas like identity, cloud security, endpoint\nsecurity, network security, apps are secured end-to-end. But more than that, if I were just to step back\nand look at the security market, it is changing pretty rapidly. It is going to be the foundation of trust for\nall organizations, especially as we embark on AI, we can't really do AI without security. We just can't. And\nso I think where we are seeing this going is security, governance, privacy, observability are all coming\ntogether in security as a whole and that end-to-end protection matters. You've got to secure AI, you've\ngot to secure end-to-end and you have to secure it using GenAI. So those are the big trends. And we're\nmonitoring the market and hopefully shaping it actively as well.\nBrad Alan Zelnick\nDeutsche Bank AG, Research Division\nMakes sense. Perhaps I'd be dramatic or oversimplifying to say that without trusted security, there is no\nMicrosoft.\nVasu Jakkal\nThere is no Microsoft. Microsoft runs on trust and trust cannot happen without security. It's the first thing\nyou need to do because if you live in a house and if you're worried about thiefs coming into your house\nevery single day. I don't think we could cook the meal or watch the television or do all work. That's what\nsecurity is. Security is the threat actors knocking on your door. And not only that, being in your homes\nand your kitchen, we don't even know that. So how can we can live our lives? How can we use technology\nwithout security? That's a dystopian world, and that's how critical security is it has to come above all else.\nBrad Alan Zelnick\nDeutsche Bank AG, Research Division\nBut with that said, and since we are here at an investor conference, how does this all drive shareholder\nvalue perhaps directly and indirectly?\nVasu Jakkal\nYes. I mean it's absolutely -- it's deeply tied to that because if you think about it, security is 1 of the\ntop priorities for all organizations, full stop. It's consistently been in the top 2, top 3. It's the most\ndefensible spend. There's no organization which is going to say, I want to cut Your security spend and put\non anything else because what happens if you get attacked? What happens if you get breached and the\ntrust that you lose? How much time? I talked about that $9 trillion number. Just think about the economic\nimpact. We know businesses, which could not come back online due to a breach. So it's that's how critical\nsecurity is and that's directly tied to share holder value. And then we talked a lot about innovation, that's\ncustomer value. When we provide value to our customers, they can do what they're supposed to do and\nthat keeps that whole flywheel of innovation and shareholder value, I think, keeps spinning. So I think\nsecurity is going to be probably even more critical going forward for GenAI than it was because you cannot\ndo AI without Security.\nBrad Alan Zelnick\nDeutsche Bank AG, Research Division\nMICROSOFT CORPORATION COMPANY CONFERENCE PRESENTATION  AUG 28, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n10\nVasu, this is a really great session to better understand Microsoft security and how important it is for the\noverall company. And frankly, for the work that you do, that benefits the entire industry and all of us here.\nAny final thoughts that you want to leave us with?\nVasu Jakkal\nThe 1 thing I would say is, please, please check out what Microsoft is doing on GenAI security. We have,\nof course, published some information but this entire portfolio that you're seeing right now is being used\nto secure AI. We're already securing 2 million apps with Defender. And if you just look at going back to\nyour shareholder values question as well. Our Purview, which is data security, it becomes critical for the AI\nworld, we have 75% of our security attached to Copilot. So there's a lot of work that Microsoft is doing in\nGenAI and it would be great to get your thoughts on it as well.\nBrad Alan Zelnick\nDeutsche Bank AG, Research Division\nExcellent. Well, with that, thank you again for being here.\nVasu Jakkal\nThank you, Brad. Thank you. It's been a pleasure.\nMICROSOFT CORPORATION COMPANY CONFERENCE PRESENTATION  AUG 28, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n11\nCopyright © 2025 by S&P Global Market Intelligence, a division of S&P Global Inc. All rights reserved.\nThese materials have been prepared solely for information purposes based upon information generally available to the public\nand from sources believed to be reliable. No content (including index data, ratings, credit-related analyses and data, research,\nmodel, software or other application or output therefrom) or any part thereof (Content) may be modified, reverse engineered,\nreproduced or distributed in any form by any means, or stored in a database or retrieval system, without the prior written permission\nof S&P Global Market Intelligence or its affiliates (collectively, S&P Global). The Content shall not be used for any unlawful or\nunauthorized purposes. S&P Global and any third-party providers, (collectively S&P Global Parties) do not guarantee the accuracy,\ncompleteness, timeliness or availability of the Content. S&P Global Parties are not responsible for any errors or omissions, regardless\nof the cause, for the results obtained from the use of the Content. THE CONTENT IS PROVIDED ON \"AS IS\" BASIS. S&P GLOBAL\nPARTIES DISCLAIM ANY AND ALL EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF\nMERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE OR USE, FREEDOM FROM BUGS, SOFTWARE ERRORS OR DEFECTS,\nTHAT THE CONTENT'S FUNCTIONING WILL BE UNINTERRUPTED OR THAT THE CONTENT WILL OPERATE WITH ANY SOFTWARE\nOR HARDWARE CONFIGURATION. In no event shall S&P Global Parties be liable to any party for any direct, indirect, incidental,\nexemplary, compensatory, punitive, special or consequential damages, costs, expenses, legal fees, or losses (including, without\nlimitation, lost income or lost profits and opportunity costs or losses caused by negligence) in connection with any use of the Content\neven if advised of the possibility of such damages. S&P Global Market Intelligence's opinions, quotes and credit-related and other\nanalyses are statements of opinion as of the date they are expressed and not statements of fact or recommendations to purchase,\nhold, or sell any securities or to make any investment decisions, and do not address the suitability of any security. S&P Global Market\nIntelligence may provide index data. Direct investment in an index is not possible. Exposure to an asset class represented by an\nindex is available through investable instruments based on that index. S&P Global Market Intelligence assumes no obligation to\nupdate the Content following publication in any form or format. The Content should not be relied on and is not a substitute for the\nskill, judgment and experience of the user, its management, employees, advisors and/or clients when making investment and other\nbusiness decisions. S&P Global Market Intelligence does not act as a fiduciary or an investment advisor except where registered\nas such. S&P Global keeps certain activities of its divisions separate from each other in order to preserve the independence and\nobjectivity of their respective activities. As a result, certain divisions of S&P Global may have information that is not available to\nother S&P Global divisions. S&P Global has established policies and procedures to maintain the confidentiality of certain nonpublic\ninformation received in connection with each analytical process.\nS&P Global may receive compensation for its ratings and certain analyses, normally from issuers or underwriters of securities or from\nobligors. S&P Global reserves the right to disseminate its opinions and analyses. S&P Global's public ratings and analyses are made\navailable on its Web sites, www.standardandpoors.com (free of charge), and www.ratingsdirect.com and www.globalcreditportal.com\n(subscription), and may be distributed through other means, including via S&P Global publications and third-party redistributors.\nAdditional information about our ratings fees is available at www.standardandpoors.com/usratingsfees.\n© 2025 S&P Global Market Intelligence."}, "content_hash": "ca2c1ea3c205533ef8df9941c05e0bf4b21a06a091ab93f36959993b8e32e2eb", "transcript_name": "MicrosoftConference.json"}