{"validated_at": "2025-08-30T12:32:04.915352", "input": {"call_type": "conference", "summary_length": "long", "filename": "Moody's Corporation Presents at Oppenheimer 28th Annual Technology, Internet & Communications Conference, Aug-11-2025 10_45 AM – Moody's Corporation – BamSEC.pdf"}, "transcripts": {"presentation": "Moody's Corporation Presents at Oppenheimer\n28th Annual Technology, Internet &\nCommunications Conference, Aug-11-2025\n10:45 AM\nEdited Transcript of Moody's Corporation Company Conference Presentation Monday, August 11, 2025 at\n02:45:00PM GMT\nCorporate Participants\nKiera Kilkowski Bridges\nStephen T. Tulenko Moody's Corporation – President of Moody's Analytics\nConference Call Participants\nOwen Lau Oppenheimer & Co. Inc., Research Division – Executive Director and Senior Analyst\nPresentation\nOwen Lau Oppenheimer & Co. Inc., Research Division – Executive Director and\nSenior Analyst\nAll right. Our next section is with Moody's. So first of all, thank you, everyone, for joining this session. For those of\nyou who don't know me, my name is Owen Lau. I cover information services, exchanges and also blockchain at\nOppenheimer. Moody's is well known to be a credit rating agency. But over the years, they have been building out\na software business in Moody's Analytics. They're also making a big push into AI. In the first half of this year,\nMoody's Analytics accounted for about 46% of total revenue.\nJoining us today is Steve Tulenko, President of Moody's Analytics. So first of all, thank you for your time, Steve.\nStephen T. Tulenko Moody's Corporation – President of Moody's Analytics\nThanks, Owen. Thanks very much for having us. Pleasure to be here. Look forward to a good session.", "q_a": "Questions and Answers\n12/08/2025, 12:59\nMoody's Corporation Presents at Oppenheimer 28th Annual Technology, Internet & Communications Conference, Aug-11-202…\nhttps://www.bamsec.com/transcripts/0a391e00-3a3f-4857-b450-299cfbdd1324\n1/13\nOwen Lau Oppenheimer & Co. Inc., Research Division – Executive Director and\nSenior Analyst\nExactly. Good to see you, Steve. So we asked this question last year, but we have been hearing quite a bit about\nthe AI adoption in the investment community recently. I'm wondering how you would see your software business\nin MA today and where you want to be in 5 years?\nStephen T. Tulenko Moody's Corporation – President of Moody's Analytics\nYes. Yes, this is a question, we get a lot, right? I think the -- maybe the first thing to note here is software is a part\nof the program. In a lot of ways, it's a chassis that we use at Moody's to deliver content and deliver analytics and\ndeliver insights. Sometimes the software is there to create the ability to interact in a way where we can bring our\nexpertise to the table. So we often use it and have used it for years as a way of delivering value to customers in\nterms of their lending operation, for example, where we bring the data on the companies that they might lend to\nthe table, maybe to help them do prospecting.\nWe also bring data on maybe the companies and whether or not they might have political exposure or their\nbeneficial owners might have political exposure that we might bring to the table to help them decide whether or\nnot they can do business with that company at all, and we use software to deliver that. And then we also have\nanalytic models to help them evaluate and maybe decide whether this is a good risk for them, what the price\nmight be, how they might structure that deal and maybe how they might think about doing business with that\ncompany in the future.\nThe software is the way in which we record those decisions and record that capability, creating a database often\nthat's a system of record that we can rely on and refer to in the future as we do more analytic work. So I think it\nwas really as an analytics business that leverages software as a chassis, and it's really a way in which we might\npackage the expertise that we can bring to the table to help the customers do their jobs even better.\nOwen Lau Oppenheimer & Co. Inc., Research Division – Executive Director and\nSenior Analyst\nGot it. So is there any area that you could invest into more and accelerate growth in MA?\nStephen T. Tulenko Moody's Corporation – President of Moody's Analytics\nYes. I mean there's always investments we can make, especially in light of what's happening here with AI, right?\nSo we've been pretty active about investing in those areas where we see the best growth opportunities.\nSometimes those are in the form of data tools or sometimes those are software applications or companies that\nproduce software that we thought would be helpful. And sometimes it's just internal development, those kinds of\ntools, especially leveraging some of the new AI capabilities.\nBut the lending space is a place where we are very focused and see some really good growth trends, either\nbecause banks continue to digitalize their activity or because we see -- and by the way, the Numerated\nacquisition is a good example of that, right, where we're bringing -- onboarding capabilities to our other elements\nin the value chain that we offer to banks to help them do their lending. That acquisition was a good example of\nan investment in the lending franchise for us. We do a lot in insurance underwriting.\nYou, of course, know about the RMS capabilities where we have the preeminent cat models in the world here,\nhelping people understand what the risk might be of a particular climate event, a hurricane or a wildfire affecting\n12/08/2025, 12:59\nMoody's Corporation Presents at Oppenheimer 28th Annual Technology, Internet & Communications Conference, Aug-11-202…\nhttps://www.bamsec.com/transcripts/0a391e00-3a3f-4857-b450-299cfbdd1324\n2/13\ntheir book from an insurance perspective and maybe in other areas as well. So we've made an investment with\nCAPE Analytics, which was the company that does a geospatial video AI work to help us understand properties\nand what's on those properties from an overhead perspective so that I can see, gosh, that roof right there has a\npatch on it and maybe there's a branch over hanging in that roof, and maybe I need to think about that insurance\npolicy differently than I might have just based on that, which is in the public records.\nOf course, KYC is another place where we are investing. And then in general, the AI concept is another place that\nwe think will help us accelerate growth. So those are big examples of areas where we're concentrating our\nefforts around an ecosystem that we can really add value in supporting maybe needs to consume some data\nfrom an external benchmark like us, maybe some analytic models from us, maybe some software to help\nstreamline the process. But really, I think of it as we're making bets on big sets of activities or ecosystems of\nactivities that our customers are engaged in.\nOwen Lau Oppenheimer & Co. Inc., Research Division – Executive Director and\nSenior Analyst\nGot it. So is there any area that you could deemphasize on the other hand?\nStephen T. Tulenko Moody's Corporation – President of Moody's Analytics\nI mean there's always redeployment work that we're doing. And so we look at our portfolio very carefully, as you\ncan imagine, and where are we on the product life cycle. You can picture an S-curve, each of our product suites is\nat some point along that S-curve. And at the beginning of an S-curve, your investment cycle is a little different\nthan it might be toward the end of an S-curve, and we aim to keep in the portfolio those products that generate\ngood growth profiles, but also good margin profiles when they get towards the end of that S-curve. So there's\nredeployment all the time. And maybe a good example of that would be maybe what we've done with the ESG\nactivities, right?\nSo a redeployment of resources internally and a partnership with MSCI is a good example of one where we felt\nthe portfolio, I'll call it, a rebalancing in the portfolio made sense in terms of the resource deployment. And\npartnering with MSCI is a tremendous opportunity for us to bring world-class capabilities in that space to our\ncustomers. Maybe we are not investing quite the same way we were in terms of producing that content\nourselves. And then, of course, it's a bilateral concept. So we can help them just the same in the private credit\nspace, for example, where we have great expertise in private credit. And they, of course, have great tools that\nsupport the asset management community. So that's a good example of a redeployment where it makes sense\ngiven our portfolio.\nOwen Lau Oppenheimer & Co. Inc., Research Division – Executive Director and\nSenior Analyst\nThat's good. So you mentioned AI multiple times. Could you please talk about the traction of your AI products?\nAnd I think your Research & Insights revenue was stronger than expected in the second quarter. Part of the\nreason was Research Assistant, which is embedded within CreditView, I think. And I think you have over 100\ncustomers and a healthy pipeline. Could you please give us an update on that?\nStephen T. Tulenko Moody's Corporation – President of Moody's Analytics\n12/08/2025, 12:59\nMoody's Corporation Presents at Oppenheimer 28th Annual Technology, Internet & Communications Conference, Aug-11-202…\nhttps://www.bamsec.com/transcripts/0a391e00-3a3f-4857-b450-299cfbdd1324\n3/13\nYes. I mean the Research Assistant is a good example of the way I think our product strategy will develop here as\nGenAI becomes more important to our customers in the way they do their work, right? It's an important capability\nthat enables us to draw inference across multiple areas of expertise and leverage it in the context of the work\nthat our customers are doing. And we're using the same technique. Sometimes we price for it independently as a\nnew module. Sometimes we include it in the product itself.\nSo it depends a bit on where we are and which product family we're talking about. But about -- I think Noemie\ntalked about this in the most recent earnings call, about 40% of our products, when you measure that by revenue\nor by ARR, now includes some form of GenAI capabilities. So for example, the RMS IRP, which is the platform that\nwe offer to help people manage their models across different catastrophic risks and engage those models\nthrough that platform. That platform has a set of GenAI tools, for example, that help you understand what the\nmodels can do, maybe understand how they work and actually writes code for you in order to implement and\nleverage those models in a way that makes the most sense for it. And that's something we didn't actually charge\nfor incrementally.\nBut when you look at the products that had these -- call it the product families that had these tools available in\nthe suite, you see a growth rate that's better than the average overall, sometimes maybe even twice the growth\nrate. So that is the other thing that we're pretty excited about is you get a very positive impact on the value that is\ngenerated by those products as well as the potential for growth by cross-selling, and sometimes we charge for\nthat module independently. Sometimes we just include it in the program, and then we see growth coming\nthrough expansion of those relationships. So this is something that is, I would say, already at almost half of our\nproduct array is now making contributions, this capability of these new technologies, and we expect this is going\nto permeate our product array as we move through the next 12 to 18 months.\nOwen Lau Oppenheimer & Co. Inc., Research Division – Executive Director and\nSenior Analyst\nGot it. And then a follow-up on that. I think the NPS, the Net Promoter Score, it's much higher with these clients, I\nthink just talked about and a much better cross-sell opportunities. Could you please maybe unpack a little bit\nmore why that's the case?\nStephen T. Tulenko Moody's Corporation – President of Moody's Analytics\nYes. I mean the cross-sell opportunities are probably obvious, but let's just connect some dots for people. As we\nmake more content available through our website, right, so historically, CreditView is the flagship product that\nMoody's has offered to help explain ratings and provide credit analysis on rated companies. We're now\nexpanding that to cover literally thousands and thousands more companies, not just the rated universe, but\nmaybe the names that might be relevant from the private credit perspective. And so that coverage is expanding\nliterally by thousands. So coverage itself is expanding, but we're also layering in more areas of expertise.\nFor example, the economic scenario analysis that we often do, we've sold separately before. We're now making\nthat available in the same place. So you can use these GenAI tools to draw inference across all of it. So the\nquestion, what would Moody's say about this name? Maybe it's a name in the private credit space where we don't\nactually formally rate them. We can use one of our rating scorecards in order to give you a sense for what that\nrating might look like. And then we also can use economic content, maybe it's interest rate forecast in order to\nsay what might happen to this company in light of that interest rate forecast.\nSo these tools give you the ability to introduce new content sets and maybe even suggest have you thought\nabout doing an interest rate forecast in light of this scenario? Or have you thought about applying this scenario\nto that credit? So there's the introduction part. And then, of course, deliver through especially GenAI tools. But in\ngeneral, we can just make it available on the same website as well. So there's some good cross-selling\n12/08/2025, 12:59\nMoody's Corporation Presents at Oppenheimer 28th Annual Technology, Internet & Communications Conference, Aug-11-202…\nhttps://www.bamsec.com/transcripts/0a391e00-3a3f-4857-b450-299cfbdd1324\n4/13\ncapabilities there that are pretty rich. You mentioned the NPS concept. We look at this, the scores themselves are\nuseful, but much more interesting is the feedback you get. So you get a great feedback move from your\ncustomers there, and we rely on that quite a bit. We actually have a regular cadence of meetings to look at that\nand make sure that we're not missing something that's brewing or something that's interesting from a customer\nperspective.\nBut what's really, really cool is the NPS scores are higher when these GenAI products are in place. But what's\nreally interesting is when you dive in and you look at the activity. They are spending more time on our website,\nwhich could be good or could be bad, right? Maybe it's harder to find stuff, so they have to [ spend, right ]? That's\nnot the case. They're spending more time and they're engaging more. They're getting more -- they're tapping more\nresearch and using more of our content than they are spending. So the rate of increase and the time they spend\nis going up, but the rate of engagement is going up faster. There's sort of a velocity to this that we're pretty\nexcited about, I'll call it an engagement velocity that is pretty interesting, right? So these GenAI tools are enabling\npeople to -- they're spending more time with us, which means they're spending less time with somebody else,\nwhich is great. More importantly, they're getting more from us in that same period of time than they ever did\nbefore. So I think very exciting.\nOwen Lau Oppenheimer & Co. Inc., Research Division – Executive Director and\nSenior Analyst\nYes, I agree. I do feel like I spend more time with ChatGPT these days, honestly. And then maybe a follow-up on\nthat is AI can be an opportunity for MA and many other companies. It could also be a threat to your business. I\nmean there has been a narrative that AI can replace some software products or some software codes. How do\nyou see this risk to MA workflow tools and software solutions such as CreditLens going forward?\nStephen T. Tulenko Moody's Corporation – President of Moody's Analytics\nYes. I mean this is a great kind of existential philosophical question. You could think about the disruption factor\nor you could think about the tremendous opportunity that's before us, and we definitely land on the opportunity\nside of this. If you think back what I mentioned before about software and kind of thinking as a chassis, AI and\nespecially these GenAI tools, the agentic tools that we're now developing. And by the way, Owen, we may be able\nto show your colleagues here a quick video to give you a sense for what we're doing next with respect to these AI\ntools.\nGenAI is just another form of software development. It happens to be that the code that we're using is often\nlanguage rather than your traditional software code. So packaging our expertise either in the form of\ndeterministic software like CreditLens or converting that into agentic software so that you do credit scoring or\nyou do spreading or you do covenant monitoring, those are the kinds of things that we can do agentically just the\nsame as we have done deterministically. And we see this as a great opportunity maybe to actually make that\ncapability available to more customers by helping them convert from, I'll call it, software tools that were systems\nof record to leveraging the data that's resident in those systems of record to do more analytics.\nSo I can show you a quick demonstration of the work we're doing with our website right now. This is -- we've\ndone this on video. And in the one-on-one meetings that we have scheduled today, we can do live\ndemonstrations if you'd like. But just to give you a sense, this is -- if you're a customer of our website -- of our\nproducts via our website, moodys.com, we have a module here where we have our agents that we're making\navailable. And this is just a demo version we've got in the video right now. But we've got agents that help you do\nthese kinds of tasks. We can glean insight from an earnings report. You can dive in on -- in this case, we dove in\non the D&O insurance work that you can hit pause for a second, the D&O insurance work that one of our\ninsurance customers might do. Each of the boxes here represents an agent that we've already created, right, in\norder to help them do the underwriting work on the D&O policies. So step 68 -- sorry, step 22 is get information\n12/08/2025, 12:59\nMoody's Corporation Presents at Oppenheimer 28th Annual Technology, Internet & Communications Conference, Aug-11-202…\nhttps://www.bamsec.com/transcripts/0a391e00-3a3f-4857-b450-299cfbdd1324\n5/13\nabout the company. Another step too is to search through the annual report on that company to understand\nthings. There is another step here where we review news stories on a name like Boeing.\nSo we're pulling in across dozens of agents the content and capabilities we bring through our data estate, maybe\nalso with content that might be in their systems and then bring that together, hit run again and pull that together\nand let these agents do some work for us. So on the right-hand side, you've got those different steps firing away,\nright, and you've got the results generated. On the left-hand side, you can see the agents going to work for us.\nAnd again, I can show this to you guys live. This is a production website. Green means that, that step has been\naccomplished. Blue means that step is actually being activated. And each of those boxes that we have organized\nthrough that schematic, we can add or delete and we can reconnect the way we want to in order to deliver in a\nway that's relevant for our customers.\nSo the software opportunity here deterministic SaaS-based software is actually more constrained than what we\ncan do with this. So we're actually pretty excited about the growth opportunity here. And what you'll see here is\nwe're generating content. I don't know if you can skip through to the end. We're generating content on the right-\nhand side. This will generate a report that might be 20 or 30 pages long, and we're going to help insurance\nunderwriter think about D&O insurance for this name and then consider the news that might be relevant, consider\nthe financials that might be relevant, look at the people and then understand how they might be exposed\npolitically or not. And then in light of all that, you have a much more holistic understanding of who you're doing\nbusiness with and what you might want to do in terms of pricing that policy.\nSo it gives you a sense for -- you can see we're very excited about the opportunity to actually use agents to do the\nsame work that software was doing before. And maybe some of the software applications that we have serve as\na system of record to help us bring the customer data in a way that's relevant to really add value to them going\nforward.\nOwen Lau Oppenheimer & Co. Inc., Research Division – Executive Director and\nSenior Analyst\nRight. So that's part of like one of your agentic solutions to like hire the agent to write a credit memo and stuff\nlike that, right?\nStephen T. Tulenko Moody's Corporation – President of Moody's Analytics\nWhat you just saw there is a button that we will make available. We have it in preview with some customers now.\nWe've actually sold some of these agents to customers already. So we have -- people actually paid us money. But\nthe most important thing here is we're going to make that layer of agents available on all of the items in our data\nestate as we make them available through moodys.com. And this is something we're in the process of doing\nnow. We've been -- you've undoubtedly been aware, we've been scaling up our coverage there. We're adding in\nmore and more content there. And as the AI capabilities are available across all of the things in our data estate,\nwe expose it through this set of agents and really hone in on what's important to a bank or an insurance\ncompany, an asset manager or whatever might be relevant.\nOwen Lau Oppenheimer & Co. Inc., Research Division – Executive Director and\nSenior Analyst\nGot it. We have around like maybe 20 minutes left. I do want to touch on the growth potential for MA because\nthere are lots of questions from investors about how can you guys reaccelerate the ARR or the potential. So for\nme, I think in the last quarter, you have mentioned 4 products. Let me -- like let us walk through these one by one.\n12/08/2025, 12:59\nMoody's Corporation Presents at Oppenheimer 28th Annual Technology, Internet & Communications Conference, Aug-11-202…\nhttps://www.bamsec.com/transcripts/0a391e00-3a3f-4857-b450-299cfbdd1324\n6/13\nI think the first one is the so-called enhanced capabilities in CreditLens. We know it's a very embedded product in\ncommercial lending, but could you please unpack what that upgrades are?\nStephen T. Tulenko Moody's Corporation – President of Moody's Analytics\nThe upgrades related to CreditLens?\nOwen Lau Oppenheimer & Co. Inc., Research Division – Executive Director and\nSenior Analyst\nYes, upgrades related to CreditLens and how they are going to drive ARR?\nStephen T. Tulenko Moody's Corporation – President of Moody's Analytics\nYes. I mean maybe the way to think of this is, again, this ecosystem concept, right? CreditLens is the software\napplication we use to bring customer data, bring our external -- or the data in our data estate together along with\nscoring models, spreading tools, right? So it's -- there's an ecosystem here that we help people do lending. And\nso I guess what's really good news is we have lots and lots of customers in the lending space, that's good. But\nnot all of them have bought all of our capabilities. So as you apply, as you become relevant from one piece of the\nvalue chain, we are offering other elements in the value chain that are quite synergistic for you to leverage right\nthen and there. And some of those could be delivered through software. Some of those might be delivered\nthrough these agents that we just talked about.\nBut at the beginning of the value chain might be a clarification. Am I able to do business with this person by\ndoing a KYC check? Then you might do your evaluation from a credit perspective and score it with one of our\nmodels. And then you might decide that you want to lend to that company and then you might also need to\nproject your impairments related to that company downstream in the finance and accounting department. So\nthese things all link together and create a great cross-selling opportunity that I think we think is really quite rich.\nWe see a good pipeline in the banking space I think partially because banks are now through some of the crisis\nmoments they had a couple of years ago and are now also, I think, investing in this AI capability and learning\nmore about it and I think are looking forward to actually leveraging it to really make themselves more productive\nand maybe save some money.\nOwen Lau Oppenheimer & Co. Inc., Research Division – Executive Director and\nSenior Analyst\nGot it. And the second one is the new model launch, I think in insurance space in the second half of 2025. Steve,\nyou mentioned RMS. We actually haven't talked about RMS for a long, long time. Why don't you give us more\ncolor and give us an update?\nStephen T. Tulenko Moody's Corporation – President of Moody's Analytics\nYes. I mean the platform that RMS brings to the table here, think of this as an industrial strength modeling for the\nlargest insurance companies and reinsurers and brokers in the world or I should say, for those who are interested\nin those exposures and can help anyone because the scale here can handle, I'll call it, industrial strength\napplication. So this thing is built for resiliency and the ability to handle a lot of activity. And what happens here\n12/08/2025, 12:59\nMoody's Corporation Presents at Oppenheimer 28th Annual Technology, Internet & Communications Conference, Aug-11-202…\nhttps://www.bamsec.com/transcripts/0a391e00-3a3f-4857-b450-299cfbdd1324\n7/13\nwhen you do these cat models is you run scenarios, often thousands and thousands of years of scenarios in\norder to project what your losses might be.\nSo it's not terribly unlike a lot of other work we do. You have frequency and severity and you do the math to get\nexpected losses, but you do it with projections of what might happen to weather and what might happen to\nweather patterns for a particular location on a particular building over the course of maybe literally 50,000 years\nthat are simulated. So you need a lot of compute to do that well. This platform is built for that. Maybe more\ninteresting, we have a whole host of models that we're releasing through that platform that we call high-definition\nmodels.\nThe one that's most famous probably are the most interesting, to I would say, the largest number of insurers in\nthe U.S. at least would be the severe convective storm capability, where you look at thunderstorms and large\nwind events and what do they do to your house and my house, right? These happen everywhere in the country,\nhappen everywhere in the world, and they are relevant for the most number of insurance policies in the world.\nHurricanes tend to be a little bit more important on the coast. Fires tend to be more important in sort of area,\nregions. The severe convective storm model applies almost anywhere in the world. And we have applied it and\ndone forecasting and simulations with it in mind.\nAnd that, I guess, is why we're excited about the launch that you're mentioning there, right? So our platform\nenables you to really do some really good work. The high-definition models are more effective than anybody\nelse's. And we've got data increasingly available for things like the acquisition of CAPE to even inform the raw\ndata and the raw material that comes into those models to inform them to make them even better. So this is a\npretty rich set of capabilities, very relevant for insurance. It's also relevant, I think, for other places that are\nconcerned about whether they might do to their assets, banks, public sector entities, et cetera. Corporations too,\nright?\nOwen Lau Oppenheimer & Co. Inc., Research Division – Executive Director and\nSenior Analyst\nGot it.\nStephen T. Tulenko Moody's Corporation – President of Moody's Analytics\nWhere should I put my warehouse?\nOwen Lau Oppenheimer & Co. Inc., Research Division – Executive Director and\nSenior Analyst\nRight. Exactly. Exactly. So Steve, you mentioned CAPE a number of times already. I think there's an integration\nprocess going on. And I think CAPE, it's not in your ARR number yet.\nStephen T. Tulenko Moody's Corporation – President of Moody's Analytics\nCorrect. Not organic yet. Yes.\nOwen Lau Oppenheimer & Co. Inc., Research Division – Executive Director and\nSenior Analyst\n12/08/2025, 12:59\nMoody's Corporation Presents at Oppenheimer 28th Annual Technology, Internet & Communications Conference, Aug-11-202…\nhttps://www.bamsec.com/transcripts/0a391e00-3a3f-4857-b450-299cfbdd1324\n8/13\nNot organic. Yes. So how should we think about the time line of this integration and how much and when it will\nshow up in your MA ARR?\nStephen T. Tulenko Moody's Corporation – President of Moody's Analytics\nYes. The acquisition of CAPE was, when was that?\nKiera Kilkowski Bridges\nIn January.\nStephen T. Tulenko Moody's Corporation – President of Moody's Analytics\nYes, January.\nKiera Kilkowski Bridges\nI think after a year of being part of the company, it will be part of that ARR.\nStephen T. Tulenko Moody's Corporation – President of Moody's Analytics\nYes. Yes. So CAPE, I think we're really excited about from a cross-selling perspective, very excited because the\nidea of -- I think this is a very helpful way to think of this. We can tell you about virtually any roof in the United\nStates and any plot of land in the United States from an overhead visual perspective. So literally, I have a garage\nthat I insured through one of our larger carriers in the United States, and they have to be a CAPE customer. They\ninsured my building for a couple of months and then decided they didn't want to cover me anymore and cited\nthat there were some issues with my roof.\nThis is a building I was refurbishing and rehabilitating, but it gives you a sense for how accurate this kind of\ntooling can be, right? So I had to go seek insurance from a different provider because the visuals they were able\nto glean from the overhead shot gave them a good sense for what they were dealing with. It's true. I had patched\nmy roof, and it was a different color. So I have first-person experience with this, right? So you can imagine what\nthis does when you can actually see that at scale for any roof in America, right, any property in America that has\na branch overhanging the roof. Anywhere you see a few cars in the backyard, right? Maybe you wonder what\nthose barrels are next to the building, right? These are the kinds of things that you can now see and you don't\nhave to do a site inspection. So that gives you a sense for the opportunity. It will move into the organic ARR\nnumber next year, probably -- I guess, we'll probably report that way in the first quarter.\nOwen Lau Oppenheimer & Co. Inc., Research Division – Executive Director and\nSenior Analyst\nGot it. And then I guess the other potential support for ARR is KYC, you mentioned that maybe some new sales to\ncorporate. Could you please talk about your existing customer mix for KYC and why corporate become a new\nopportunity for MA?\n12/08/2025, 12:59\nMoody's Corporation Presents at Oppenheimer 28th Annual Technology, Internet & Communications Conference, Aug-11-202…\nhttps://www.bamsec.com/transcripts/0a391e00-3a3f-4857-b450-299cfbdd1324\n9/13\nStephen T. Tulenko Moody's Corporation – President of Moody's Analytics\nYes. I mean we -- the history of that business, we had Orbis, which was very useful in the KYC sector, right,\nbecause Orbis brought all of the connections between the corporate entities, which was very useful. And we also\nbought Regulatory Data Corporation a few years ago, right? So that brought a database of politically exposed\npeople and sanctions data. So the combo of the 2 is really attractive. Orbis, of course, was very important to the\nbanking world, but also to the corporate world.\nRDC had their history. They started in the banking space. So we have a very good franchise among banks that\nare doing KYC work and supporting their regulatory compliance as well as their efforts to be more productive\nand more efficient. But in the corporate space, I think that this concept of resiliency has become more and more\nimportant. People are more aware of this notion of, gosh, I wonder how resilient my supply chain is. I wonder\nwho it is that's walking into my building, right? We literally have customers that use our tools to consider who it is\nthat's literally walking into their building at the reception desk. We have immigration authorities that are\nconsidering who it is that's flying into their country, right?\nSo it's the combination of all this data. And the same concept applies whether you're in the banking sector where\nthere are heavy regulations that require you to check and see who it is you do business with. Those same\nconcepts, I think, apply to corporates and corporations that might not have the same regulatory situation. They\nmight have increasing regulatory obligations, but it's early days in that respect. And I think -- but the resiliency\ndriver is the thing that's really driving them, right? They want to make sure they understand, is there something\nout there that I should be aware of before I rely on this company to deliver for me? And that is the -- that's really\nthe nature of the demand.\nBy the way, it's the same as financial strength from an analogy perspective. Will they pay me back? It's the same\nas are they exposed to weather? Is their headquarters in a floodplain? Well, we might also be able to tell them\nabout whether or not that company or those individuals have any kind of sanctions risk associated with them.\nOwen Lau Oppenheimer & Co. Inc., Research Division – Executive Director and\nSenior Analyst\nGot it. And then another hot topic is related to private credit. I mean we talk a lot about the private credit on the\nrating side. Is there a role MA can play here in terms of offering tools, right, to private credit firms and stuff like\nthat?\nStephen T. Tulenko Moody's Corporation – President of Moody's Analytics\nYes, yes, sure. So I mean, I think a private credit as another area where Moody's can offer a lot of value. I mean\nthink about the continuum of credit may be going from the top of the house or the largest credit exposures or the\nbiggest companies that borrow are often rated. And then Moody's has credit scoring capabilities and data on\nevery other company in the world as well. So Orbis, for example, along with financial statements that we gather\nthrough Orbis or maybe we might use AI to spread for our customers.\nWe have financial statements on literally 20 million or 30 million companies. We have lots of other data you\nmight use to proxy what that company might look like compared to their peers and then use our credit models to\nhelp generate a quantitative score on basically any name that is incorporated, right? So our models reach down\ninto sole proprietorships and provide value. So at the top of that, as we talk about the rated names, private credit\nis just the next slice. It's the mezzanine level just before you start doing your kind of traditional lending. And\noften, private credit is a substitute for some of the lending, right?\n12/08/2025, 12:59\nMoody's Corporation Presents at Oppenheimer 28th Annual Technology, Internet & Communications Conference, Aug-11-202…\nhttps://www.bamsec.com/transcripts/0a391e00-3a3f-4857-b450-299cfbdd1324\n10/13\nSo our biggest customer base is the banking customer base because of lending. So private credit is -- it's literally\nin our wheelhouse. We have data on those names. We have financial statements on those names. We can\nconfirm who the people are. We can tell you what business they're in. We know and can project what those data\nmight imply in terms of credit risk and in the private credit space. That's the one thing that you would expect\nMoody's would be able to do, right? So we help with the risk premia associated with a debt instrument, especially\nwhen it comes to the risk associated with credit, which is a big portion of it. It's the one thing you can probably\nget a good -- do a good job of predicting.\nSo we are excited about the opportunity here. We're working with many of the largest players in the private credit\nspace. And maybe one way to sum it up is what would Moody's say about this name if it were rated, right? That\nquestion, what would Moody's say about this one, is something that MA can answer even if the rating agency\nhasn't yet rated that name, right? So this tens of thousands of companies that might potentially tap the private\ncredit segment of the markets that we can actually address that question.\nOwen Lau Oppenheimer & Co. Inc., Research Division – Executive Director and\nSenior Analyst\nSo is it like you can even provide a pre-rating to customers when they subscribe to MA or kind of...\nStephen T. Tulenko Moody's Corporation – President of Moody's Analytics\nIn Moody's CreditView, for example, right, we have all of the rated names and all the research that explains that,\nright? We have all of our industry research, but we also have all the scorecards that the analysts use. These are --\nwe make them available, right, to explain here are the most important quantitative criteria that we review in the\nrating process. Here are the most important qualitative criteria that we review in the rating process. We can help\nyou use those scorecards, and we often -- this is one of the things we might do agentically, for example, right?\nWe can help you pull the data together to be -- that's relevant for the scorecard on that name in that industry,\nright? So what would we say about this name that isn't rated yet, might be rated someday depending on what --\nwhether they tap the public market and the private market. Maybe it's a name you've seen in the syndicated loan\nspace. What would we say about that one? And we have economic content, we have benchmark content, we\nhave scorecards that you can use and analytic models to populate and maybe come up with something that\nwould be very helpful in addressing the credit premium in the bond price or the -- yes, in the instrument price.\nOwen Lau Oppenheimer & Co. Inc., Research Division – Executive Director and\nSenior Analyst\nGot it. So we only have like maybe like 4, 5 minutes left. Maybe my final questions are I want to touch on two\nthings. Number one is the KYC business, and then the other one is the expense program. Maybe on the KYC\nbusiness, the growth rate has been very strong. I think ARR was about 15% in the second quarter. Could you\nplease talk about the driver of this growth and how sustainable it is?\nStephen T. Tulenko Moody's Corporation – President of Moody's Analytics\nYes. I mean I think we're -- we continue to be very excited about this is a place we are investing. We mentioned it\nat the top of the program here. There is great opportunity for us to provide tools and whether they take the form\nof databases or data feeds or analytic models or software applications to streamline the operations in these\nefforts. These efforts, I would actually think of as KYC and third-party risk management because when we help\n12/08/2025, 12:59\nMoody's Corporation Presents at Oppenheimer 28th Annual Technology, Internet & Communications Conference, Aug-11-202…\nhttps://www.bamsec.com/transcripts/0a391e00-3a3f-4857-b450-299cfbdd1324\n11/13\npeople evaluate suppliers, we put this in the same -- we think of this in the same business unit. So that's, I think,\nan important note.\nThere's good growth in the supply chain space as well. But maybe just -- maybe more importantly, the\nopportunity to address the labor required to investigate a name that showed up on the list, right? So think of this,\na bank, for example, processing thousands of these a day. And 90-something percent of them get taken out an\naddress, we got a match. We're good. I know that this is Owen Lau. He's a guy who works at Oppenheimer, in\ngood shape, right? That's confirmed.\nThen there's another one named Owen Lau, who works at another company, and we're not sure if it's the same\nguy and that requires an investigation. The work required to do the investigation is multiple. It's just hours and\nhours of work. And if we can find a way to streamline that maybe agentically, we've actually sold an agent to help\npeople do the screening, right? That's a place where we can really access another TAM because we earn\neconomic rent by replacing the labor, right? So 5 investigators can do the work of maybe even 50 investigators\nbefore by leveraging these tools. It's not just Google searching, it's all of our tools at once leveraged for you\nagentically to really save you time and money. That's, I think, why we're so excited about this business.\nOwen Lau Oppenheimer & Co. Inc., Research Division – Executive Director and\nSenior Analyst\nYes. That's why there are lots of opportunities in AI, combining AI to many different areas. And then I guess my\nfinal question is about your expense. You had -- I think you gave us an update on the efficiency program back in\nthe fourth quarter of 2024. When would you complete this program? And how much expense runway you expect\nto save?\nStephen T. Tulenko Moody's Corporation – President of Moody's Analytics\nYes. I think the restructuring window is open. I actually think it's declared in the statements. I think it's open for\nmore than a year, right? So we are continuing to do work here and acknowledge that work through that\nrestructuring process. If you ask me how long will this go on? I would say we are actively engaging and continue\nto engage in redeployment efforts, taking the good people who are doing the work that we want to do and maybe\napplying it to a new activity, maybe a new activity that we consider to be worthy of us doubling down on some of\nthese bets.\nThe lending space is a good example. We're doing a lot of that. We're doing a lot of work to drive productivity,\nespecially in the engineering space, leveraging AI, for example. Some of these new tools that have come through\nare really quite valuable, and they enable us to do a lot more work in a shorter period of time. The same thing\ngoes for product development. Same thing goes for sales, right, where we're leveraging some of these AI tools to\ngenerate more productivity per head. That's an affirmative objective, and it's one that we are continuing to do, and\nyou'll see that reflected through that restructuring window.\nOwen Lau Oppenheimer & Co. Inc., Research Division – Executive Director and\nSenior Analyst\nGot it. I think we're about time. Steve, again, thank you for your time and Kiera as well, and thank you all for\njoining us today.\nStephen T. Tulenko Moody's Corporation – President of Moody's Analytics\n12/08/2025, 12:59\nMoody's Corporation Presents at Oppenheimer 28th Annual Technology, Internet & Communications Conference, Aug-11-202…\nhttps://www.bamsec.com/transcripts/0a391e00-3a3f-4857-b450-299cfbdd1324\n12/13\nThanks, Owen. Hopefully, that was helpful. We look forward to talking with you next time. And if anybody has any\nquestions or follow-up, you let us know.\nOwen Lau Oppenheimer & Co. Inc., Research Division – Executive Director and\nSenior Analyst\nSounds great. Thanks a lot.\nStephen T. Tulenko Moody's Corporation – President of Moody's Analytics\nThanks, Owen. Thanks a lot.\nOwen Lau Oppenheimer & Co. Inc., Research Division – Executive Director and\nSenior Analyst\nThank you. All right. Have a good day. Bye-bye.\n12/08/2025, 12:59\nMoody's Corporation Presents at Oppenheimer 28th Annual Technology, Internet & Communications Conference, Aug-11-202…\nhttps://www.bamsec.com/transcripts/0a391e00-3a3f-4857-b450-299cfbdd1324\n13/13"}, "content_hash": "f1b36128f6f208e0b4e16568fa4e4a5cceb650f8ffd749599c70feb640f591f3", "transcript_name": "Moody's Corporation Presents at Oppenheimer 28th Annual Technology, Internet & Communications Conference, Aug-11-2025 10_45 AM – Moody's Corporation – BamSEC.json"}