{"validated_at": "2025-09-01T16:59:31.201650", "input": {"call_type": "earnings", "summary_length": "long", "answer_format": "bullet", "filename": "NetflixEarningCall-July2025.pdf"}, "transcripts": {"presentation": "* Capability needed to view estimates data. Please contact your account \nmanager.\n................................................................................................\n....................................................................\nCOPYRIGHT © 2025 S&P Global Market Intelligence, a \ndivision of S&P Global Inc. All rights reserved\nspglobal.com/marketintelligence\nNetflix, Inc. NasdaqGS:NFLX\nEarnings Call\nThursday, July 17, 2025 9:45 PM GMT\n \n \nCALL PARTICIPANTS\n2\nPRESENTATION\n3\nQUESTION AND ANSWER\n4\nNETFLIX, INC. FQ2 2025 EARNINGS CALL - PRELIMINARY COPY  JUL 17, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n2\nCall Participants\n....................................................................................................................................................................\nEXECUTIVES\nGregory K. Peters\nCo-CEO, President & Director\nSpencer Wang\nVice President of Finance,\nCorporate Development & Investor\nRelations\nSpencer Adam Neumann\nChief Financial Officer\nTheodore A. Sarandos\nCo-CEO, President & Director\nNETFLIX, INC. FQ2 2025 EARNINGS CALL - PRELIMINARY COPY  JUL 17, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n3\nPresentation\n....................................................................................................................................................................\nSpencer Wang\nVice President of Finance, Corporate Development & Investor Relations\nGood afternoon, and welcome to the Netflix Q2 2025 Earnings Interview. I'm Spencer Wang, VP of\nFinance, IR and Corporate Development. Joining me today are Co-CEOs, Ted Sarandos and Greg Peters;\nand CFO, Spence Neumann.\nAs a reminder, we'll be making forward-looking statements, and actual results may vary. We'll take\nquestions submitted by the analyst community, and we will begin with our results and our forecast.\nNETFLIX, INC. FQ2 2025 EARNINGS CALL - PRELIMINARY COPY  JUL 17, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n4", "q_a": "Question and Answer\n....................................................................................................................................................................\nSpencer Wang\nVice President of Finance, Corporate Development & Investor Relations\nThe first question comes from Steve Cahall of Wells Fargo. The question is, since the revenue increase\nin your forecast is primarily FX-driven, we're curious about the components of the constant currency\nincrease. Is this due to a better underlying revenue growth? Or are there specific expenses that are\ncoming in better like content amortization?\nSpencer Adam Neumann\nChief Financial Officer\nI will take that one. Thanks, Steve. So as you saw on the letter, we increased our full year revenue\nguidance to $44.8 million to $45.2 billion. That's up from the prior guide of $43.5 million to $44.5 billion,\nso up about $1 billion at the midpoint of the range and a tighter range. As you know, it primarily reflects\nthe FX impact from the weakening dollar relative to most other currencies. But the good news is we're also\nseeing strength in our underlying business. We've got healthy member growth, and that even picked up\nnicely at the end of Q2, a bit more than we expected. And we think that will carry through with our strong\nback half slate. So we're reflecting that in our latest forecast.\nAnd we're also seeing nice momentum in ad sales still off a pretty small base, but good growth, and it's\non pace to roughly double our revenue in the year, and it's a bit ahead of beginning of year expectations.\nSo when we carry all that through to operating margin, our operating expenses are essentially unchanged,\nwhich is part of your question. So they're basically unchanged forecast to forecast. So we're largely\nflowing through the expected higher revenues to profit margins. So that's why our updated target full year\nreported margin is up 1 point from 29% to 30% and that 50 basis point increase in FX neutral margin is\nreally just that revenue lift from stronger membership growth and adds relative to prior forecast flowing\nthrough the margin.\nSpencer Wang\nVice President of Finance, Corporate Development & Investor Relations\nThank you, Spence. We'll take our next question from Barton Crockett of Rosenblatt Securities. Why is\noperating margin guidance for the full year only 30% after the upside in 2Q and a forecast of 31.5% for\nthe third quarter. Is there a timing issue, FX issue? Or is there a new level of spending that will continue\nbeyond the fourth quarter of 2025?\nSpencer Adam Neumann\nChief Financial Officer\nWell, this is really mostly timing. So thanks, Barton. We primarily. As a reminder, we primarily manage\nthe full year margins, and we expect our content expenses will ramp in Q3 and Q4. We've got many\nof our biggest new and returning titles and live events in the back half of the year. We've also -- Q4 is\ntypically and generally almost always is a heavier film slate. Sure we'll talk about -- I expect we'll talk\nabout more of this on the call. We'll also be marketing to support that heavier slate, and we're continuing\nto aggressively build out our ad sales infrastructure and capabilities through the year.\nSo all of that is to be expected. We can manage to, will we manage to those margins. And even with\nthat back half ramp in expenses, we expect operating margins to be up year-over-year in each quarter,\nincluding Q4, and as just noted, we expect to deliver a strong full year margins as we just took up our\nguide to 29.5% FX neutral, 30% reported.\nSpencer Wang\nVice President of Finance, Corporate Development & Investor Relations\nGreat. Thanks, Spence. The next question comes from Tom Champion of Piper Sandler. How has your view\nof the consumer and the macro economy changed over the last 90 days?\nNETFLIX, INC. FQ2 2025 EARNINGS CALL - PRELIMINARY COPY  JUL 17, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n5\nGregory K. Peters\nCo-CEO, President & Director\nSimilar to last quarter, we're carefully watching consumer sentiment in the broader economy. But at this\npoint, really nothing significant to note in the metrics and the indicators that we get directly through the\nbusiness. Those are retention that remains stable and industry-leading. There have been no significant\nshifts in plan mix or planned take rate. and the price changes we've done since the last quarter have been\nin line with expectations. Engagement also remains healthy.\nSo things all look stable from those indicators and big picture, entertainment in general, and Netflix\nspecific have been historically pretty resilient and tougher economic times. We also think that we are an\nincredible entertainment value, not only compared to traditional entertainment, but if you think about\nother streaming competitors when we start at $7.99 in the United States. And you think about all of the\nentertainment you get. We have a belief and expectation that the demand for not only entertainment, but\nfor us, specifically will remain strong.\nSpencer Wang\nVice President of Finance, Corporate Development & Investor Relations\nThanks, Greg. I think it's a nice follow-up to this question will be on advertising. So from Ben Swinburne\nat Morgan Stanley. Can you share any data points around your upfront negotiations?\nGregory K. Peters\nCo-CEO, President & Director\nYes. As we noted in the letter, our U.S. upfront, it's nearly complete. We've closed a large majority of deals\nwith the major agencies. Those results have generally been in line or slightly better than our targets and\nconsistent with our goal to roughly double the ads business this year. and what are advertisers excited\nabout. Growing scale is something we definitely hear also a highly attentive and engaged audience. So\nbigger audience, but also an audience that's more engaged relative to our peers. The rollout of our own\nad tech stack, which helps deliver a bunch of features and then our slate, which is generally amazing and\nincludes a growing number of live events that advertisers are excited about.\nSpencer Wang\nVice President of Finance, Corporate Development & Investor Relations\nGreat. Follow-up question on advertising from Vikram of Baird. How have advertisers in the U.S.\nresponded to the Netflix Ad Suite rollout since the April launch. What features and capabilities are\nattracting the most interest? And how is the initial feedback in other regions outside of the U.S.?\nGregory K. Peters\nCo-CEO, President & Director\nWe've completed the rollout of our own ad -- tech stack, the Netflix ad suite to all of our ad markets now.\nSo we're fully on our own stack around the world at this point. That rollout was generally smooth across\nall countries. We see good performance metrics across all countries and the early results are in line with\nour expectations. Now we're in this phase of learning and improving quickly based on the fact that being\nlive everywhere means that you get a bunch of feedback about what we can do better, which is great.\nAs we mentioned before, the most immediate benefit from this rollout is just making it easier for\nadvertisers to buy on Netflix. We hear that benefit, that ease from direct feedback talking to advertisers.\nThey tell us that it's easier. We see it in our overall sales performance. We've seen an increased\nprogrammatic buying. So all of these are consistent with what we are expecting both qualitatively and\nfrom a metrics perspective.\nWe're also, I guess, worth noting that we're going to roll out additional demand sources like Yahoo!, that\nwill further open up the market for us. long term being on our own stack that improves the speed of our\nexecution to deliver this pretty significant road map of features that we have in front of us. It's things like\nimproved targeting and measurement. There's also leveraging advertiser and third-party data sources,\nwhich we definitely hear demand for as well. And it will ultimately allow us to improve the ad experience\nNETFLIX, INC. FQ2 2025 EARNINGS CALL - PRELIMINARY COPY  JUL 17, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n6\nfor our members, which is critically important. So that means better adds personalization. So the ads that\nI see are increasingly different from the ads that say, Ted would see, and they're more relevant for each of\nus, which is good for us as users and it's good for the brands.\nWe're also going to be introducing interactivity in the second half of the year. So that's exciting. So that's\nall to say this is a pretty significant milestone for us. One, we're super excited to get behind us because\nnow we can shift into the steady release cycle where we're dropping new features all the time, both for\nadvertisers and for members. And that's the development and release model that we have in other parts\nof the business. So it's fun to be able to get to that point.\nSpencer Wang\nVice President of Finance, Corporate Development & Investor Relations\nThanks, Greg. I'll move this along now to a set of questions around content as well as engagement. This\none comes from Ben Swinburne of Morgan Stanley. 1% engagement growth year-over-year suggests\nengagement is down year-over-year on an average per member basis. How do we reconcile that with\nengagement growing on a per member, household basis, if that's still accurate?\nGregory K. Peters\nCo-CEO, President & Director\nSo total view hours did grow a bit in the first half '25, and that's despite a particularly back half-weighted\nslate. But to your point on engagement on a per member basis, we've mostly been focused for the last\nfew years on measuring engagement on what we call an owner household basis. So this takes out the\nborrower effect, and we obviously think this is the best way to assess our engagement per member\nbecause it removes the tricky comparison impacts from paid sharing.\nSo that metric per owner household engagement has been relatively steady over the past 2.5 years.\nthroughout the rollout of paid sharing and amidst increasing competition for TV time is more viewing\nmoves to streaming and gets this on-demand benefit. So we're glad to have held that normalized\nengagement level, but we clearly also want to increase it. And to that end, we're optimistic and expect\nthat our engagement growth in the second half of this year will be better than in the first half given our\nstrong second half slate.\nSpencer Wang\nVice President of Finance, Corporate Development & Investor Relations\nThanks, Greg. Great segue to [ Doug Amit's ] question from JPMorgan. The content in the back half of the\nyear looks strong with quite Three, already the third most popular non-English series ever and Wednesday\nand Stranger Things releasing in the coming months. You often say that no single title drives more than\n1% of total viewing how do you think about the business currently as being boosted or had driven? And\nare you confident that both original and licensed content momentum can continue in 2026?\nTheodore A. Sarandos\nCo-CEO, President & Director\nYes, I'll take that. And thank you, Doug. On the first part of your question, we're definitely riding this long-\nterm trend of linear to streaming and that has a natural adoption curve, but we can accelerate our growth\nwith big hits. But as you said, each one of them, even in success going to drive about 1% of total viewing.\nSo you need a lot more than just a big hit every once in a while. So to your point, it's not about the single\nhead. So what it is, is about a steady drumbeat of shows and films and soon enough, games that our\nmembers really love and continue to expect from us. So like by way of example, we had 44 individual\nshows nominated for Emmys this year. So that's what quality at scale looks like.\nWe ended the quarter with a huge return of Squid Game. Thanks for acknowledging I go into the second\nhalf with the return of Wednesday and Stranger Things. And a really strong slate of supporting titles and\nfavorites like -- and new shows like next week, this week, we had [ Eric Ban's ] on tamed. Next week, we\nhave [ ] new comedy show line both look really great. And that's just to name a few. And the back half\nof the year also has perhaps the most anticipated slate of new movies that we've ever had. That starts\nNETFLIX, INC. FQ2 2025 EARNINGS CALL - PRELIMINARY COPY  JUL 17, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n7\non the 25th with Happy Gilmore 2, followed by, we have a new knives out film. We have new films from\n[ Noah Bambec from Gamble Del Toro ], from Catherine Bigelow, and it does not stop there.\nIt does roll right into 2026. And that's the second part of your question, and we're looking forward to\nmovies like the RIP from Ben Affleck and Matt Damon, Charleston, it's a new movie called Apex, which is\na phenomenal action movie. Millie Bobby Brown is back in an Enola Homes 3. Recall that in 2023, Enola\nHomes was our biggest -- 2 was our biggest movie. So we're looking forward to that new sequel. And\n[ Greta Garwig's ] Narnia is going to be phenomenal. And then on top of that, we're talking about return of\nBridgerton, One Piece, Avatar, The Last Air Bender, all 3 huge successes around the world. The Gentleman\nFour Seasons, Point Break -- I'm sorry, Running Point, sorry, Beef, which as you recall in 2023, won just\nabout every award imaginable and was a gigantic success for us, it's back for a new season in '26.\n3 body problem, Love is Blind, Outerbanks and not just from the U.S. from France, we have upon from\nSpain. We have Berlin. We have a new season of 100 years of saved from Colombia. So big hit returning\nshows and new series from each of our regions around the world. And the new stuff we've got coming up\nlike Man on Fire, Reimagining, A little house on the Prairie, the Duffer Brothers from Stranger Things have\na brand-new show, The Boroughs. We've got The Human Vapor from Japan, [ Operation Suffered Cigar ]\nfrom India, Can This Love Be Translated from Korea.\nSo again, popular programming, new and returning from all over the world in 2026. Unscripted shows\nlike the Reboot of Star Search. We've got Into The doll Universe, with Wonka's Golden Ticket, which we're\nreally excited about, and In Our Life, we've got a few surprises for you next year. But of course, we have\nour NFL Christmas stay double header than we're really thrilled about too. So we're really incredibly\nexcited about the back half of this year and confident that it keeps rolling in '26.\nSpencer Wang\nVice President of Finance, Corporate Development & Investor Relations\nThank you, Ted. We'll take the next question from Rich Greenfield of LightShed Partners who asked, are\nyou concerned by the stagnation in your viewing share domestically? I think Rich is probably referring\nto the Nielsen Gage data. Do you need to spend more on programming or spend differently to materially\nmove your viewing share higher?\nTheodore A. Sarandos\nCo-CEO, President & Director\nThanks, Rich. Look, our goal continues to be to continue to grow our share over the long term. And\nover the past few years, you're right, we've been able to maintain our share even as we work through a\ngrowing number of TV-based streaming services, some free, some paid and the impact of paid sharing\nthat Greg mentioned earlier. As well as this 2025 slate that was more back half weighted than we typically\nhave in previous years. But over the long term, we tend to keep growing as the other 50% of TV viewing\nmigrates from linear to streaming. And we'll do that by doing what we've always done continuously\nimprove the service.\nSo keep in mind, since 2020, our content amort has grown more than 50%, from under $11 billion to\nmore than $16 billion that we expect to do this year. And for that same time period, we definitely had --\nwe saw increased spending, but also increasing agent increased revenue, increased profit and increased\nprofit margin. So that's our model in action. It is our objective to sustain healthy revenue growth,\nreinvest in the business to improve on all aspects of the service. And that includes growing content spend,\nstrengthening and expanding the entertainment offering and to drive that positive flywheel of growth by\nadding value to our members and all the while growing engagement revenue and profit around the world.\nSpencer Wang\nVice President of Finance, Corporate Development & Investor Relations\nGreat. Thank you, Ted. I'll move to Alan Gould from Loop Capital next. Can you provide more information\non the TF1 partnership? Why did you choose to add TF1 in France as opposed to other broadcasters as\nyour first partner? Why is now the right time to create such a partnership? Should we anticipate similar\npartnerships in other countries?\nNETFLIX, INC. FQ2 2025 EARNINGS CALL - PRELIMINARY COPY  JUL 17, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n8\nGregory K. Peters\nCo-CEO, President & Director\nYes, perhaps just start with the rationale for the partnership. You would think with that long list of\namazing titles that had just rattled off, we would have enough to satisfy every person on the planet, but\nit turns out actually consistently hear from our members that they want more. They want more variety,\nmore breadth of content. So the fundamental purpose for this TF1 partnership is all about that goal of\nexpanding our entertainment offering. How do we enhance the value we deliver to members? We want to\nprovide more content, more variety, more quality.\nSo just as you've seen us do with licensing and production, this is just another mechanism to expand that\noffering. And in this case, it's specifically about highly relevant local for local content in a country that\nhas strong demand for that local content. This is an accelerated way to satisfy that need. Why now? Why\nwas this time the right time? Well, we've invested a lot in a bunch of enabling capabilities that are either\nrequired or highly leveraged by this deal. You can think live, ads, the new UI, among other things.\nAnd then why TF1 versus some other partner? Well, we know each other really well. We wanted our first\npartner to be in a big territory. We wanted to pick the leading local programmer. We wanted to be highly\naligned in terms of the deal and the shape of the partnership and the values that we thought we could\ngenerate mutually by working together for our customers. And we both look at this as an opportunity to\nlearn to figure out how do we scale the local content that TF1 is producing to more customers in France.\nSo we're looking forward to seeing what consumers think, you never really know until you get out there\nand get the real reactions. And then obviously, we'll factor that into our plans going forward.\nSpencer Wang\nVice President of Finance, Corporate Development & Investor Relations\nThanks, Greg. From Robert Fishman of MoffettNathanson, with reports suggesting Apple is now in the\ndriver seat for F1 rights, haha, pun intended, I guess, plus UFC and MLB still looking for new deals and\nthe NFL may be looking to come to market a year earlier, can you share updated thoughts on how you are\napproaching sports rights for Netflix and where you draw the line on something that can move the needle?\nTheodore A. Sarandos\nCo-CEO, President & Director\nWell, thanks for that, Robert. Remember, sports are a subcomponent of our live strategy but our live\nstrategy goes beyond sports alone. Our live strategy and our sports strategy are on change. We remain\nfocused on ownable big breakthrough events that -- because our audiences really love them. Anything we\nchase in the event space or in the sports space, has got to make economic sense as well. We bring a lot\nto the table and the deals that we make out to reflect that. So live is a relatively small part of the total\ncontent spend, and we've got about 200 billion view hours. So it's a pretty small part of view ours as well\nright now.\nBut that being said, not all view hours are equal. And what we've seen with live is a outsized positive\nimpacts around conversation around acquisition, and we suspect around retention. And so right now, we're\nvery excited where we sit. We're very excited with the existing strategy. We're excited about the Canelo\nvs. Crawford fight in September and the SAG Awards and our weekly WWE matches, and the NFL, of\ncourse, which is a great property, and we're happy to have Christmas Day double header, which includes\nDallas versus Washington and Detroit versus Minnesota.\nSo today, our live events have all primarily been in the U.S., keep in mind. So over time, we're going to\ncontinue to invest and grow our live capabilities for events around the world in the years ahead. So we're\nexcited, but the strategy is unchanged.\nSpencer Wang\nVice President of Finance, Corporate Development & Investor Relations\nGood follow-up question on that one from Steve Cahall of Wells Fargo. What investments have you made\nto increase your capabilities in producing live events. What have you been able to do in-house in 2025 that\nNETFLIX, INC. FQ2 2025 EARNINGS CALL - PRELIMINARY COPY  JUL 17, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n9\nyou couldn't do last year? And how long will it take before you have the capability to produce large-scale\nevents like NFL games?\nTheodore A. Sarandos\nCo-CEO, President & Director\nYes. Thanks, Steve. I'd say, remember, when we started original scripted programming, we had\n0 production capability. House of Cards was, in fact, thinking about our first 3 years of original\nprogramming, all of those shows were produced by others. You have to go 3 years later, we produced\nStranger Things in-house. Today, we still have shows that are produced by others. Universal, 20th\nTelevision, which is Disney, Paramount, Lionsgate, Winter Television there's lots of available infrastructure\nto produce TV, and that is true of live events and sports as well.\nWhen we do more and more, we may choose to bring some of that in-house. We've already produced a\nfew, and we're just as likely to continue to use partners with existing production infrastructure and work to\nmake sure that those productions are bespoke and do they feel like they could only be on Netflix. So you\nshouldn't think about the mix partnerships and self-producing as a -- we think about it as a scaling tool,\nnot backfilling some lack of ability in some area of the company. And I should note, by example, CBS is a\nphenomenal partner producing NFL games with us, and we're thrilled to work with them again this year on\nChristmas Day.\nGregory K. Peters\nCo-CEO, President & Director\nMaybe take this opportunity just to some commentary on the general capability we've been dealing with\nlive. When we start something new, we pretty much expect that we're not going to be brilliant at the\nbeginning. But we -- yes, that's true. Unfortunately, we don't have any really reason to believe that. But\nwe don't let that stop us from kicking off initiatives that we believe have a strong strategic rationale, even\nthough now we need to develop that capability. And of course, our job is to get out there and learn by\ndoing and get world-class as quickly as we possibly can.\nAnd if you look at our current capabilities around live, we are in just a completely different place today\ncompared to when we first started. As a good example that just happened last Friday, we had our first\nconcurrent pair of live events we had Taylor vs. Serrano globally delivered alongside WWE Smack Down,\nwhich was delivered ex U.S., both events at scale and delivered with extremely high quality. So it's great\nprogress we've seen and we've got a great road map of features ahead of us to continue to enhance those\nexperiences for folks.\nSpencer Wang\nVice President of Finance, Corporate Development & Investor Relations\nLast question on the content side or the topic of content comes from Ben Swinburne of Morgan Stanley.\nWhat are the learnings from the success of K-Pop Demon Hunters, more animated musicals with fictional\nbands, perhaps a question more?\nTheodore A. Sarandos\nCo-CEO, President & Director\nThen that is a question from the manager has probably has that movie playing on repeat in their home, if\nI guess it correctly. KPop Demon Hunters is a phenomenal success out of the gate. One of the things that\nI'm excited, really proud of the team over is original animation, not SQL, not live-action remake original\nanimation feature is very tough and has been struggling for years. And I think the fact that our biggest\nhits now, Leo, Sea beast and now KPop Demon Hunters our original animation. So we're super thrilled\nabout that.\nThe mix of music and pop culture, getting it right matters, get the storytelling matters, the innovation\nand animation itself matters. And the fact that people are in love with this film and they love with the\nmusic from this film that will keep it going for a long time. So we're really thrilled. And now the next beat\nNETFLIX, INC. FQ2 2025 EARNINGS CALL - PRELIMINARY COPY  JUL 17, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n10\nis where does it go from here? So we put in the letter how just how successful the music has been and\ncontinues to be and we think that will drive fandom for this fictional K-Pop band that we have.\nBut more importantly, for the on Golden and for the song soda pop, these are enormous hits and they all\ncame from a filmness available only on Netflix. So we're really excited that we can pierce the culture with\noriginal amid features considering that folks have been poking us on it. Let's do it again later in the year\nwithin your dreams, right? Under Dream is another very funny one and also complete the original.\nSpencer Wang\nVice President of Finance, Corporate Development & Investor Relations\nGreat. I'll move this on now to a few questions on plans as well as product. So from Michael Morris of\nGuggenheim Yes, Netflix continues to broaden content genres, notably with live sports and the recently\nannounced TF1 partnership. Is there a path to additional tiers of service based on types of content\navailable? Or will Netflix always make all content available at the ad-free ad-supported price points?\nGregory K. Peters\nCo-CEO, President & Director\nI've learned to never say never. So I would say we remain open to evolving our consumer-facing model. I\nthink we've got a few principles, important principles that we're carrying with us that I don't see changing\nsignificantly. One is we want to provide members choice, right? So how do we have a different set of plans\nat different price points in different futures allows folks to opt into what the -- is the right Netflix for them.\nAlso, how do we provide good accessibility to new members around the world we want to grow, and that\nmeans making sure that we've got accessible price points. And then finally, the plans we offer, they have\nto ensure that we're having reasonable returns to the business based on the entertainment value that\nwe delivered, and we're hoping to grow those. And so those returns would grow as well. And obviously,\nthe reason to do that is we can continue to reinvest and adding more entertainment and building a better\nexperience.\nAnd maybe one other thought, too, is there is a component of complexity and choice stack that we have\nto consider and how we think about our offering is structured. So having said all that though, I think we\nbelieve that the bundle is a great value for members. It allows members around the world to access a\nwide range of entertainment in a very easy way, at a very reasonable price. So I would expect that, that\nwill remain an important feature of our offering for the foreseeable future.\nTheodore A. Sarandos\nCo-CEO, President & Director\nA lot of value and simplicity, yes. .\nSpencer Wang\nVice President of Finance, Corporate Development & Investor Relations\nYes. From Rich Greenfield, the Lightshed partners, help us understand why your new UI/UX is so\nimportant as you expand live content. Beyond live, can you provide some color on what metrics have\nimproved since the launch of the new UI such as speed of users finding a title and change in failed\nsessions?\nGregory K. Peters\nCo-CEO, President & Director\nYes. As we said previously, it's really hard for new immediately compete, be better than the UI that we've\nhad for the past 10 years has been iteratively evolved and improved. But now that we've actually rolled\nout this new UI to the first large wave of TV devices, we're actually seeing performance that's better\nthan what we saw in our prelaunch testing. And to some degree, that's expected because we made some\nimprovements based on the results of that testing phase. So it's exciting to see that those delivered\nactually better results.\nNETFLIX, INC. FQ2 2025 EARNINGS CALL - PRELIMINARY COPY  JUL 17, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n11\nBut the rate of that change actually gives us increased confidence that this new experience will drive\nbetter performance by the variety of metrics we look at, some of which include the ones that Rich is\nmentioning in relatively short order. And then maybe just a point on why do we build this and launch this\nnew experience in the first place? Why was it so important? Bluntly, the previous experience was designed\nfor the Netflix of 10 years ago. And the business has evolved considerably since then. We got a wider\nbreadth of entertainment options. We got TV and film, more of those, of course, from around the world,\nbut now also games and live events.\nAnd if you think about the discovery experience that's best suited for these new content types, it's\ninherently different. Helping our members understand that there's a really good reason for them to launch\nNetflix and tune in at 7:00 p.m. on a Friday night versus just showing up whenever they were free and\nwanted to be entertained. That's a totally different job, and we really need a different user interface\nto do that job well. Add to that, we saw the opportunity to leverage newer technologies like real-time\nrecommendations that respond dynamically to what you need from us in that specific moment. So the\nNetflix you get on a Tuesday night is different from the Netflix you get on a Sunday afternoon.\nBut all of those rationales together and what we're seeing in terms of the performance of far, we're very\nconfident that we've got a much better platform in this new user experience to build from to continue to\nimprove, and that will help us meet the needs of the business over the years to come.\nSpencer Wang\nVice President of Finance, Corporate Development & Investor Relations\nThanks, Greg. The next question comes from Steve Cahall of Wells Fargo. YouTube is the only streamer\nthat exceeds Netflix in terms of U.S. share of TV time. Do you see an opportunity to bring notable YouTube\ncreators and their content exclusively to Netflix? How big could this opportunity be?\nTheodore A. Sarandos\nCo-CEO, President & Director\nThanks, Steve. Look, we want to be in business with the best creatives on the planet, regardless of where\nthey come from, some of them are here in Hollywood. Others are in Korea, some are in India and some\nare creators distribute only on social media platforms and most of them have not yet been discovered. So\nfor those creators doing great work, -- we have phenomenal distribution, desirable monetization, brilliant\ndiscovery in our UI and a hungry audience waiting to be entertained.\nSo Steve, you recently -- I think I listened to you on a broadcast where you talked about our business\nmodel and I believe on this very topic. And we largely agree with you and believe that working with a\nwide set of content creators makes a lot of sense for us. And as you said, if I'm remembering it right,\nnot everything on YouTube will fit on Netflix, and we couldn't agree with that more. But there are some\ncreators on YouTube like Ms. Rachel that are a great fit. If you saw on the engagement report, she's\nhad 53 million views in the first half of 2025 on Netflix. So she clearly works on Netflix. And we're really\nexcited about the Side Men and Pop the Balloon, a wide variety of creators and video podcasters that\nmight be a good fit for us. And particularly if they're doing great work and looking for different ways to\nconnect with audiences.\nGregory K. Peters\nCo-CEO, President & Director\nAnd maybe broadening this out for a second and taking that question to look at sort of all of the\ncompetitors that we face for a share of TV time. We've always said that the market for entertainment is\nvery large, and we face competition from all kinds of directions. So whether it's linear or streamers or\nvideo games or social media, it's also a very dynamic competitive market, as we and all of our competitors\nseek to provide better and better options for consumers. And one of those changes, one of those vectors\nof dynamicism has been that sort of steady inevitable shift to streaming and on-demand as more\nservices move to deliver their content in a way that we all know consumers want. That creates increasing\ncompetitive pressure for us that we've got to respond to.\nNETFLIX, INC. FQ2 2025 EARNINGS CALL - PRELIMINARY COPY  JUL 17, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n12\nWe also see free services as a form of strong competition. Three is it's very powerful from a consumer\nperspective. So it's not surprising that some free services are growing in engagement. But I think Ted said\nit well earlier in the call, not all hours are created equal. And we have a different profit model from other\nservices, a strong profit model. So we're going to compete to win more moments of truth for sure, but\nespecially compete to win those most profitable moments. And back to your specific question, it's worth\nremembering there's about 80% of total TV view share that neither Netflix or YouTube are winning right\nnow. We think that represents a huge opportunity for which we are competing aggressively and we aim to\ngrow our share.\nTheodore A. Sarandos\nCo-CEO, President & Director\nThe vast majority of our money and attention is focused on that 80%.\nSpencer Wang\nVice President of Finance, Corporate Development & Investor Relations\nNext question from Justin Patterson of KeyBanc. Could you please talk about your generative AI\ninitiatives? Where do you think Gen AI will be most impactful over time, revenue or expense efficiency?\nTheodore A. Sarandos\nCo-CEO, President & Director\nWell, let me start with Gen AI. We remain convinced that AI represents an incredible opportunity to\nhelp creators make films and series better, not just cheaper. They're AI-powered creator tools. So this is\nreal people doing real work with better tools. Our creators are already seeing the benefits in production\nthrough pre-visualization and shot planning work and certainly, visual effects. It used to be that only big\nbudget projects would have access to advanced visual effects like de-aging.\nRemember, last quarter, we talked about Pedro Paramo. That's just no longer the case. And this year,\nwe had a [indiscernible] is a very big show for us from Argentina. And in that production, we leveraged\nvirtual production and AI-powered VFX and there was a shot in the show that the creators wanted to show\nbuilding collapsing of [ Buenos Aires ]. So our ILI team line team partnered with their creative team using\nAI powered tools, they were able to achieve an amazing result with remarkable speed and in fact, that\nVFX sequence was completed 10x faster than it could have been completed with visual -- traditional VFX\ntools and workflows.\nAnd also, the cost of it just wouldn't have been feasible for a show in our budget. So that sequence\nactually is the very first Gen AI final footage to appear on screen in a Netflix original series or film. So\nthe creators were thrilled with the result. We were thrilled with the result. And more importantly, the\naudience was thrilled with the result. So I think these tools are helping creators expand the possibilities of\nstorytelling on screen, and that is endlessly exciting.\nGregory K. Peters\nCo-CEO, President & Director\nAnd maybe to cover a few of the other areas. The member experience is a place where we feel like there's\ntons of opportunity to leverage these new generative technologies to improve the experience. we've been\nin the personalization and recommendation business for 2 decades, but yet we see a tremendous room\nand opportunity to make it even better by leveraging some of the more newer generative techniques.\nWe're also rolling out, have piloted right now a conversational experience that uses, allows our members\nto basically have a sort of natural language discussion with our user interface thing. I want to watch a film\nfrom the '80s that's a dark psychological thriller, get some results back, maybe iterate through those in a\nway that you just couldn't have done in our previous experiences. So that's super exciting and we see that\nall of the work that we do there essentially is a force multiplier to that large content investment that we're\nmaking. If we do a better job there, that means every dollar that we spend means more value back to our\nmembers by connecting them with the titles that they're truly going to love.\nNETFLIX, INC. FQ2 2025 EARNINGS CALL - PRELIMINARY COPY  JUL 17, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n13\nAdvertising is another really great area. We've seen -- it's a high hurdle to create a brand forward spot\nin a creative universe of one of the titles that we're currently carrying. But it's very compelling for both\nwatchers and for those brands, and we think these generative techniques can decrease that hurdle\niteratively over time and enable us to do that in more and more spots. So there's a bunch of places where\nwe think we've got an advantage in terms of data and scale where we can leverage these new generative\ntechniques to deliver just more benefits for our members and for our creative community.\nTheodore A. Sarandos\nCo-CEO, President & Director\nIf you don't mind me coming back for 1 second, I just rolled off inline knows an [ Eye Line ] is. I probably\nshould clarify, that Eye Line is our production innovation group inside of our VFX Scan Line, and they're\ndoing a lot of this work with our creators. So I just realized that just through that out there, as everyone\nknew.\nSpencer Wang\nVice President of Finance, Corporate Development & Investor Relations\nThanks for clarifying, Ted. Let's see. Our next question comes from Brian Pitz of BMO Capital Markets.\nWith your evolving gaming ambitions, including partnerships with Grand Theft Auto and the recently\nannounced roadblocks agreement, can you talk to near-term monetization opportunities within gaming?\nGregory K. Peters\nCo-CEO, President & Director\nSure. We look at the near-term monetization opportunity with games, very similar to how we've looked at\nother new content categories. You can think in scripted or film or on and on. And that's essentially, if we\ndeliver more value to our offering, we get increased user acquisition, we get increased retention, we get\nincreased willingness to pay. So it drives all of the core fundamentals of our business. We've seen those\npositive effects, albeit in a small way relative to the size of our overall business when it comes to members\nplaying games on the service. We already have those positive proof points.\nAnd we're going to ramp our investment in this area, which is currently quite small compared to our\noverall content investment as we ramp the size of those positive effects. So we want to remain disciplined\nin not investing too far ahead of demonstrating that we know how to translate that investment into value\nfor our members. We've seen good progress, as you know, with licensed games like GTA. We've seen good\nprogress with the games we developed like Squid Game Unleashed. So you'll see more from us in both of\nthose categories, as well as a whole new set of interactive experiences that we think that we're either in a\nunique or differential position to deliver.\nSo we're super excited to roll those out over the next year. And then we remain open to the core question,\nremain open evolving our monetization model, but we have got to get to a lot more scale before that\nbecomes a really materially relevant question. So we're going to do that work first. And it's probably worth\nrestating the TAM for this market is very, very large. We remain convicted about our strategic opportunity\nand excited to make more progress.\nSpencer Wang\nVice President of Finance, Corporate Development & Investor Relations\nThanks, Greg. We'll take our last question from Jessica Reif Erlich of Bank of America Securities. Given\nyour healthy balance sheet and what appears to be a coming wave of M&A in media globally, are there\ncertain types of assets that would strengthen your moat, i.e., what is your view of owning successful IP or\nstudio assets as they come to market?\nSpencer Adam Neumann\nChief Financial Officer\nI'll take that one, Spencer. Thanks, Jessica. Well, we agree. Continued consolidation of studio and network\nassets is likely. But at least with respect to consolidation within legacy media, we don't think it materially\nchanges the competitive landscape. As you also know, we've historically been more builders than buyers\nNETFLIX, INC. FQ2 2025 EARNINGS CALL - PRELIMINARY COPY  JUL 17, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n14\nand we continue to see big runway for growth without fundamentally changing that playbook. You heard a\nlot of that today. So we look at a lot of things. We apply a framework or lens to those opportunities when\nwe look. Is it a big opportunity? Does it strengthen our entertainment offering? Does it strengthen our\ncapabilities? Does it accelerate our strategy?\nAnd we look at all of that relative to the opportunity cost of distraction or other alternatives. We've been\npretty clear in the past that we also have no interest in owning legacy media network, so that also kind\nof reduces the funnel for us. But in general, we believe we can and will be choosy. We've got a great\nbusiness. We're predominantly focused on growing that organically, investing aggressively and responsibly\ninto that growth and returning excess cash to shareholders through share repurchase. And I think you'll\nsee us continue on that path.\nSpencer Wang\nVice President of Finance, Corporate Development & Investor Relations\nGreat. Thanks, Spence.. And that will wrap up our Q2 earnings call. So we thank you all for taking the\ntime to join us, and we look forward to seeing you all next quarter. Thank you.\nNETFLIX, INC. FQ2 2025 EARNINGS CALL - PRELIMINARY COPY  JUL 17, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n15\nCopyright © 2025 by S&P Global Market Intelligence, a division of S&P Global Inc. All rights reserved.\nThese materials have been prepared solely for information purposes based upon information generally available to the public\nand from sources believed to be reliable. No content (including index data, ratings, credit-related analyses and data, research,\nmodel, software or other application or output therefrom) or any part thereof (Content) may be modified, reverse engineered,\nreproduced or distributed in any form by any means, or stored in a database or retrieval system, without the prior written permission\nof S&P Global Market Intelligence or its affiliates (collectively, S&P Global). The Content shall not be used for any unlawful or\nunauthorized purposes. S&P Global and any third-party providers, (collectively S&P Global Parties) do not guarantee the accuracy,\ncompleteness, timeliness or availability of the Content. S&P Global Parties are not responsible for any errors or omissions, regardless\nof the cause, for the results obtained from the use of the Content. THE CONTENT IS PROVIDED ON \"AS IS\" BASIS. S&P GLOBAL\nPARTIES DISCLAIM ANY AND ALL EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF\nMERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE OR USE, FREEDOM FROM BUGS, SOFTWARE ERRORS OR DEFECTS,\nTHAT THE CONTENT'S FUNCTIONING WILL BE UNINTERRUPTED OR THAT THE CONTENT WILL OPERATE WITH ANY SOFTWARE\nOR HARDWARE CONFIGURATION. In no event shall S&P Global Parties be liable to any party for any direct, indirect, incidental,\nexemplary, compensatory, punitive, special or consequential damages, costs, expenses, legal fees, or losses (including, without\nlimitation, lost income or lost profits and opportunity costs or losses caused by negligence) in connection with any use of the Content\neven if advised of the possibility of such damages. S&P Global Market Intelligence's opinions, quotes and credit-related and other\nanalyses are statements of opinion as of the date they are expressed and not statements of fact or recommendations to purchase,\nhold, or sell any securities or to make any investment decisions, and do not address the suitability of any security. S&P Global Market\nIntelligence may provide index data. Direct investment in an index is not possible. Exposure to an asset class represented by an\nindex is available through investable instruments based on that index. S&P Global Market Intelligence assumes no obligation to\nupdate the Content following publication in any form or format. The Content should not be relied on and is not a substitute for the\nskill, judgment and experience of the user, its management, employees, advisors and/or clients when making investment and other\nbusiness decisions. S&P Global Market Intelligence does not act as a fiduciary or an investment advisor except where registered\nas such. S&P Global keeps certain activities of its divisions separate from each other in order to preserve the independence and\nobjectivity of their respective activities. As a result, certain divisions of S&P Global may have information that is not available to\nother S&P Global divisions. S&P Global has established policies and procedures to maintain the confidentiality of certain nonpublic\ninformation received in connection with each analytical process.\nS&P Global may receive compensation for its ratings and certain analyses, normally from issuers or underwriters of securities or from\nobligors. S&P Global reserves the right to disseminate its opinions and analyses. S&P Global's public ratings and analyses are made\navailable on its Web sites, www.standardandpoors.com (free of charge), and www.ratingsdirect.com and www.globalcreditportal.com\n(subscription), and may be distributed through other means, including via S&P Global publications and third-party redistributors.\nAdditional information about our ratings fees is available at www.standardandpoors.com/usratingsfees.\n© 2025 S&P Global Market Intelligence."}, "content_hash": "7312cc8358df3c95325a1513643e30698a055adce2ee1bffa2ddc63f278e96d3", "transcript_name": "NetflixEarningCall-July2025.json"}