{"validated_at": "2025-09-01T16:32:08.186025", "input": {"call_type": "conference", "summary_length": "long", "answer_format": "bullet", "filename": "QualcommConference.pdf"}, "transcripts": {"presentation": "................................................................................................\n....................................................................\nCOPYRIGHT © 2025 S&P Global Market Intelligence, a \ndivision of S&P Global Inc. All rights reserved\nspglobal.com/marketintelligence\nQUALCOMM Incorporated \nNasdaqGS:QCOM\nCompany Conference Presentation\nThursday, August 28, 2025 7:45 PM GMT\n \n \nCALL PARTICIPANTS\n2\nPRESENTATION\n3\nQUESTION AND ANSWER\n4\nQUALCOMM INCORPORATED COMPANY CONFERENCE PRESENTATION  AUG 28, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n2\nCall Participants\n....................................................................................................................................................................\nEXECUTIVES\nNakul Duggal\nSenior VP and GM of Automotive\n& Cloud Computing of Qualcomm\nTechnologies, Inc.\nANALYSTS\nRoss Clark Seymore\nDeutsche Bank AG, Research\nDivision\nQUALCOMM INCORPORATED COMPANY CONFERENCE PRESENTATION  AUG 28, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n3\nPresentation\n....................................................................................................................................................................\nRoss Clark Seymore\nDeutsche Bank AG, Research Division\nAll right. Good. I guess it's still morning for us out here. So thanks, everybody, for coming back. We'll get\nstarted with our next fireside chat. We're very happy to have Nakul Duggal, who is the group GM of the\nAutomotive and Industrial business at Qualcomm. Qualcomm as you all know, is heavily into the handset\nside of things, but is over the last 5 years plus is heavily invested on diversifying their business, and Nakul\nis the head of some of the biggest portions of that. Probably, at least in my estimation, I don't think the\ncompany has really said it, but probably runs somewhere upwards of 1/4 to nearly 1/3 of the company. So\nwe're very happy that you could come up.\nNakul Duggal\nSenior VP and GM of Automotive & Cloud Computing of Qualcomm Technologies, Inc.\nThank you for having me.\nQUALCOMM INCORPORATED COMPANY CONFERENCE PRESENTATION  AUG 28, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n4", "q_a": "Question and Answer\n....................................................................................................................................................................\nRoss Clark Seymore\nDeutsche Bank AG, Research Division\nSo why don't we jump into a little bit about the diversification strategy at the highest level. How are you --\nand we'll dive into the individual businesses here in a bit. But at the highest level, the goal to diversify, the\nresources you're given, the strategic imperative, all of that, whether it's the Board or Cristiano or Akash,\nhow are you tasked for running that?\nNakul Duggal\nSenior VP and GM of Automotive & Cloud Computing of Qualcomm Technologies, Inc.\nSo thank you again for having me. I've been with the company for -- I celebrated 30 years in June.\nSo I understand the history of the company. I understand how we invest. I understand how we build\necosystems. One of the things that became pretty clear as we were focused on diversification about\n10-ish years ago was what is the value of the technology stack that we build in markets outside of our\nmainstream markets. And what became pretty apparent was our understanding of markets outside of our\ncore mobile business was fairly limited.\nThe approach that we took when we were starting to build out our automotive business was -- how do we\nbuild a much more intimate, much more proximate business that is aligned around the needs of the auto\nindustry. And this was a decade ago. So automotive was obviously very different from what you see today.\nAnd it allowed us to appreciate the complexity involved in quality, in safety, in supply chain resilience, in\nthe long life cycle that is required, the software differences. And we have since taken automotive as a\nbusiness that we manage pretty much completely independent of the mobile business.\nSo it gets not only the resources and the investments needed, but it's a much longer view on how are\nwe going to see success there. The approach that we took in automotive helped us in formulating a lens\nthrough which to look at other markets like industrial, markets that have a slower-moving cadence, but\nobviously much more committed to the transformation that then comes along. And so those approaches\nhave certainly helped us cement the way that we then invest as well. And then the bets that we make,\nwhether M&A or strategic partnerships, that's all part of that same strategy.\nRoss Clark Seymore\nDeutsche Bank AG, Research Division\nSo let's dive a little bit into the automotive side of things. I think you guys are doing -- you're on track\nfor nearly $4 billion in revenues in this calendar year. You're a bit ahead of what your targets were. And\nI think over the last 5 years, the CAGR of that business has been about 40%, incredibly impressive,\nespecially at a time where many of the auto semi companies are having some challenges just cyclically. So\ntalk a little bit about what has driven that growth looking backwards, and then we'll get into some of the\nforward growth drivers as you drive towards your goal of having, I think, $9 billion towards the end of this\ndecade.\nNakul Duggal\nSenior VP and GM of Automotive & Cloud Computing of Qualcomm Technologies, Inc.\nYes. So I think one thing that automotive requires apart from everything else that you have to do is a\ntremendous amount of predictability that the supplier has to provide to their customer. It's become a very\ncomplicated market in the last 5 years or so. And because of all of the complexity that automakers already\ndeal with, electrification, geopolitics, supply chain resilience, when they look to us, one of the things that\nthey find is a global player that invests heavily in software has a very broad portfolio of semis -- is able to\nthink 5 years out, make those investments on behalf of the automaker.\nAnd that just makes us a very stable, reliable supplier that is focused on the transformation that's going\non in the automotive space, central compute, SDV, driver assistance, automated driving, all of that. And\na lot of those bets were made by automakers 5-plus years ago. So as they make those bets, they look at\nQUALCOMM INCORPORATED COMPANY CONFERENCE PRESENTATION  AUG 28, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n5\nwhat bets are working, which ones are not. I think the revenues that we delivered a year in advance are\nreally an indication of winning at the right time, those programs essentially launching at the right time.\nAnd frankly, being very broad-based. We supply into pretty much every automaker globally. So we are not\nas affected by changes in the type of drivetrain that is selling or what happens in one part of the world\nversus the other. We are fairly insulated to that.\nRoss Clark Seymore\nDeutsche Bank AG, Research Division\nSo how would -- if we just took the $4 billion in revenues now and the $9 billion that you have as your\ntarget, I think, at fiscal '31, talk about how the mix changes within that. And I know you have even just\nto keep throwing around large numbers, $45 billion design pipeline, I believe. And how important is that\ntransition from probably the connectivity side to the ADAS side, et cetera?\nNakul Duggal\nSenior VP and GM of Automotive & Cloud Computing of Qualcomm Technologies, Inc.\nSo I think connectivity is a very predictable -- I guess, it's the most predictable part of the composition\nof the revenue. It's mostly our modem business, the RF business, some WiFi attach alongside it, some\nBluetooth, some GPS. We have a power line communications business. The remainder of the business\nis actually very proportionate to the rate at which cars are moving towards central compute. -- bringing\nin a tremendous amount of integration of a number of different ECUs that were previously discrete and\ndisparate. Now these are all getting integrated. And it's happening across multiple automakers and\nmultiple generations at the same time.\nSo to give you an example, there are more conservative automakers that are launching products that we\nintroduced in the 2020, 2021 time frame this year on a very large global footprint. So they will essentially\ntake some of our Gen 3 cockpit products and deploy them across their global fleet. And those will last\nfor 7, 8 years. And then there are others who are taking our Gen 5 platforms, which we only sampled\nbeginning of beginning of '25, and those will go SOP first quarter of '26. And the -- I won't get into the\ncontent delta, but the performance delta between Gen 3 and Gen 5 is probably 15x. So we have this very\ninteresting trend that is now happening in the auto industry where everybody is moving towards their\nnext-generation architecture, but the rate of adoption is not the same.\nSo we benefit from being able to see really fast-moving companies adopt new technology and rush to\ncompete, while at the same time, we have a very stable, very predictable foundation on top of which\nprevious generation silicon is getting deployed. To add to that, as we start to see ADAS wins coming in\nand ADAS on the silicon side really started to scale for us early part of, I guess, middle of '24 is when we\nstarted to actually get designs to scale up with our Gen 4.5. So we started to build our ADAS silicon about\n3 years ago, and we have announced 20 OEMs. This number will just keep growing because everybody is\ngoing to start to kind of move in that direction.\nBecause architecturally, we have aligned the cockpit architecture and the ADAS architecture, it allows\nautomakers to significantly save in software cost. They have to build once and then they can deploy based\nupon the workload that they have. So you will see a lot more of the compute concentration over the next\n5 years. And I think it will be a combination of high-performance, high-value compute with a foundation of\na lot of the legacy programs that we have won that will continue.\nRoss Clark Seymore\nDeutsche Bank AG, Research Division\nSo in some ways, it's analogous to Qualcomm going from a connectivity leader to a compute leader across\nthe entire company, whether it even be in handsets, the same thing is happening in automotive.\nNakul Duggal\nSenior VP and GM of Automotive & Cloud Computing of Qualcomm Technologies, Inc.\nI think that's right.\nRoss Clark Seymore\nQUALCOMM INCORPORATED COMPANY CONFERENCE PRESENTATION  AUG 28, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n6\nDeutsche Bank AG, Research Division\nSo is the majority of -- and you might even have had charts in this at your last analyst meeting, so forgive\nme if I didn't recall. But the majority of the $4 billion today, is it safe to say, is more the connectivity and\ncockpit. And then towards the $9 billion side, the ADAS side will be a significantly larger portion than it is\ntoday, and that's the direction of travel.\nNakul Duggal\nSenior VP and GM of Automotive & Cloud Computing of Qualcomm Technologies, Inc.\nYes. I think -- and I think you will start to see a blend of ADAS and cockpit just in terms of architectures.\nWe introduced the Flex architecture. And so that blends it. But yes, I think you will see a lot more of the\ncompute portfolio in the next 5 years.\nRoss Clark Seymore\nDeutsche Bank AG, Research Division\nSo when we think about the ADAS side of things, what's the primary differentiator that Qualcomm has?\nNakul Duggal\nSenior VP and GM of Automotive & Cloud Computing of Qualcomm Technologies, Inc.\nSo I think there are a couple of things. In markets where the ADAS stack is well understood and you know\nwhat you're looking to deploy, whether it's urban Navigator an autopilot or highway navigator an autopilot\nwhere the number of sensors are well known, the stack is fairly robust. We excel at being able to then\noptimize that for silicon, optimize it for power, optimize it for performance. That is something that is there\nin the history of the company. It's there in our architecture. And so that's where we are really able to\nextract a significant amount of performance on a per millimeter square basis on the thermal envelope that\nwe have provided, and that's helping us win quite a bit. The other piece that helps is our tiering.\nSo we have built a portfolio, especially for ADAS that allows us to go towards the -- I wouldn't say the real\ntier, but entry and then above. And so we are very well positioned with the portfolio on entry, mid and\nthen premium. And so customers who are building their stacks and are starting to mature them, harden\nthem, they want to be able to have a common portfolio that allows them to be able to think between tiers\nin the same generation and also across generations. That I think, is making a huge difference in terms of\nthe rate at which we are winning in ADAS.\nRoss Clark Seymore\nDeutsche Bank AG, Research Division\nAnd that scalability that you're mentioning, how is that applicable on both the hardware/semiconductor\nside as well as on the software side?\nNakul Duggal\nSenior VP and GM of Automotive & Cloud Computing of Qualcomm Technologies, Inc.\nYes, absolutely. So the software architecture that we have is the same software platform that travels\nfrom a premium tier SoC all the way down to an entry-tier platform. And so that saves OEMs a significant\namount of switching cost. And then to the extent possible, we also try to maintain that across generations.\nRoss Clark Seymore\nDeutsche Bank AG, Research Division\nAnd discuss on the software side, the importance of the Arriver acquisition from a few years back.\nNakul Duggal\nSenior VP and GM of Automotive & Cloud Computing of Qualcomm Technologies, Inc.\nYes. So we decided perhaps a bit late that the stack business was something that we had to get into\nbecause it was going to have high attach. It was going to be global. It was going to become part of every\nvehicle. And I think clearly, that's how it's turning out. Rather than doing it organically, and we've had a\nQUALCOMM INCORPORATED COMPANY CONFERENCE PRESENTATION  AUG 28, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n7\nteam that has been working on the stack for quite some time. We decided we needed to have a team in-\nhouse that had real-world experience in actually deploying this. It was the right idea. We did this right in\nthe middle of COVID. So it was not the best time to get into the middle of a complex acquisition.\nBut what helped us was BMW was very interested in working with somebody that they could have a very\nclose partnership with in terms of driving their next-generation stack requirements, ADAS requirements.\nSo it became this 3-way and 2-way once we acquired Arriver, where we've built out our stack team over\nthe last 3 years or so. We have built the computer vision stack in-house. It's going to be commercial\nby the end of the year across 60 countries, 100 countries next year. And if you think about it, this is\nsomething that we did from a standstill.\nSo in 2022, we had no stack. We will have this global stack launching next month. And then with BMW, we\npartnered to develop the drive policy stack together. So the Arriver team was very instrumental in not just\nbringing in the expertise, the IP, the experience, but also creating a foundation inside the company on how\nto go build a stack business, a stack product, which is something that Qualcomm obviously has not done\nbefore. So I think it was the right time and has been hugely instrumental in the success.\nRoss Clark Seymore\nDeutsche Bank AG, Research Division\nSo when you put together the hardware and the software side, what is the primary differentiation that you\noffer versus -- in the ADAS realm versus, say, the Mobileye side or the NVIDIA side, which tend to be the\n2 primary competitors. And if there's other competitors you want to highlight, go ahead, but those are the\nones I think of.\nNakul Duggal\nSenior VP and GM of Automotive & Cloud Computing of Qualcomm Technologies, Inc.\nYes. So I think there are multiple layers to a stack. I think the active safety stack, which is basically\nthe foundation for making sure that you are able to be compliant with all of the global requirements.\nThat is something that I think we are now working to get to par and perhaps even ahead of some of our\ncompetitors. Mobileye, obviously, is the gold standard, has been doing this for a long time.\nAnd so the goal is to be able to certainly meet and eventually get ahead of those types of requirements.\nI don't really look at many other stacks as really at that scale because if you look at the data, if you look\nat what's out there, other than stacks that have been built vertically by OEMs, there isn't really anybody\nelse apart from Mobileye that I would say is at the same level. As you start to go to features and go higher\nup the stack, -- that then comes down to the OEM, what type of sensor set they're deploying, what type of\nfeatures they are developing.\nAnd we actually -- and we welcome for those of you that are interested to come check out the\n[indiscernible] in Munich, and we'll have some here in San Diego as well starting next month. You can\nexperience the customer functions. You can actually see for yourself the type of performance. That we are\nvery proud of because that is something that not only have we built together, but we have -- so that is a\nstack that we can take and extend over to other OEMs, which is what we are in the middle of doing.\nRoss Clark Seymore\nDeutsche Bank AG, Research Division\nSo you talked a little bit about the importance or we talked about the scalability side of things. When you\ntalk about Snapdragon Ride and then you have the Flex side of things, talk about the Flex platform and\nthe importance of it. And I get the sense that, that is a unique ability that you have on the scalability\nfront. So just kind of expand on that, if you could.\nNakul Duggal\nSenior VP and GM of Automotive & Cloud Computing of Qualcomm Technologies, Inc.\nSo when we decided to start building safety-grade chips for automotive compute, it became pretty clear\nto us that this whole separation in a car between what is the infotainment domain and what is the safety\ndomain. This was obviously historically made sense. But going forward, especially with AI, especially\nQUALCOMM INCORPORATED COMPANY CONFERENCE PRESENTATION  AUG 28, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n8\nwith physical AI, these lines will start to blur. And so architecturally, we decided that we will allow for\nan architecture that allows us to be able to run a software stack that doesn't differentiate between\ninfotainment and driver assistance. We did that with our Gen 4.5 products.\nNow with our Gen 5 products, the level of performance that we are adding, it's 3 to 5x more powerful than\nthe 4.5. You just have plenty of headroom to be able to run 2 stacks concurrently and still have room left\nover for more. So what we have started to notice is OEMs that own their own stack want to be able to run\nthe stack as an application as opposed to a dedicated domain. And especially when you start to go mid-\ntier where you want to be able to get cost optimization, where you want to be able to go from 2 separate\nECUs to a single ECU and potentially a single SoC. The Flex architecture makes a lot of sense.\nWe introduced the Flex architecture for the first time. I think it was I think it was maybe a Snapdragon\nSummit in '24. We will launch with Leap Motor in China, our first Flex platform in the middle of '26. So\nthis is an example where somebody who actually owns the infotainment stack and the ADAS stack in-\nhouse, they can go deploy this on the same SoC. And we're starting to see that interest from a number of\ndifferent players.\nRoss Clark Seymore\nDeutsche Bank AG, Research Division\nAnd do you get the sense -- we talked a little bit about the uniqueness of your stack and the gold standard\nfrom a competitor point of view. What about just on the pure silicon side of things, the competitive\nlandscape on that, do you tend to think of Qualcomm is coming from kind of the bottoms up and so more\nworking your way from the L1 functionality up? Or do you have the headroom to start kind of at the top\nand go down and what the competitive landscape looks depending upon which side you're coming from?\nNakul Duggal\nSenior VP and GM of Automotive & Cloud Computing of Qualcomm Technologies, Inc.\nI think we made a bet 5 years ago that when it comes to ADAS, we are going to focus on L2+. Right or\nwrong, that was the bet that we made. So L2+ and below, and that's kind of the market that we want\nto focus on. We deliberately did not focus on L5 and robotaxis and all of that. So the platform that we\nstarted to build was the same common platform for both cockpit and ADAS because we started to add the\nsafety capability. And I think it was a very good decision because it has allowed us to flex in the direction\nof getting down to entry-tier chips, which we've now had available commercially over the last 3 years or\nso. And then this next generation, we have moved up tier into premium and super premium.\nSo in the same window of time, we actually have this portfolio that really scales across the board. There\nisn't anything that we do not have as far as silicon road map goes on our platforms, except for some very\nbasic entry commodity silicon. And so that makes it a portfolio that is super complex to contend with for\nmany of our competitors because it is reliable. We have tens of millions of chips that we are deploying\nannually, multiple hundred millions deployed. They're all safety grade. They're all supply resilient, multi-\nsourced -- quality proven, software proven. And so for somebody that is trying to do this for the very first\ntime in an environment where there's massive risk in terms of execution, in terms of a global footprint,\ngeopolitics, I feel pretty good that I think we are actually in a pretty good place with the strategy. I mean,\nit's played out well.\nRoss Clark Seymore\nDeutsche Bank AG, Research Division\nYes. Well, clearly, you're well ahead of plan and doing $4 billion in revenues already at a time, like I\nsaid before, that's been challenging. So something has gone very well for you. So that's definitely a\ncomplement. You said 5 years ago, the focus and the bet at the time was placed on L2+ and below. Has\nthat evolved now to a higher level as you've succeeded and gotten more knowledge of the industry?\nNakul Duggal\nSenior VP and GM of Automotive & Cloud Computing of Qualcomm Technologies, Inc.\nQUALCOMM INCORPORATED COMPANY CONFERENCE PRESENTATION  AUG 28, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n9\nSo we are transitioning to an end-to-end AI architecture for our stack, and that becomes very data-\ndriven. And as you have a data-driven approach, then you want to be able to make sure that you can\nkeep advancing the same stack towards L3. But we feel that the majority of the market is still going to\nremain in that L2+ space. And there are a number of reasons for that. I think one is just the liability that\nthe automaker has to take on. The other is the cost pressures, the market adoption, consumer adoption. I\nthink the teams that we have are developing a stack that will certainly be ready for an L3 implementation.\nWe are thinking about this more in the context of redundant architecture. So if you deploy an L3\narchitecture, what is the fallback how do you deal with the safety aspect. So for us, what has become a\ngreat learning in the partnership with BMW is that you really have to focus on the safety aspects of the\narchitecture that you're building because at the end of the day, that is what matters, right? I think these\nare all great features to talk about and read about. But as a consumer, if the product that you're building,\nyou can't stand behind from a safety perspective, it's not going to get all the much traction. And there, we\nfeel like at least one competitor has taken that seriously, and I think they do a very good job with it, and\nthat's the approach that we're taking.\nRoss Clark Seymore\nDeutsche Bank AG, Research Division\nSo when customers -- when suppliers, semiconductor suppliers get design wins, everybody talks about\nthem. You guys talked about getting 20 OEMs and a bunch of, I think, 12 new design wins last quarter,\nall great numbers. We hear from a lot of your competitors, the same customers, design wins with the\nsame customers. How externally do we reconcile that everybody has the same design wins with the\nsame customers? Are they on different SKUs, different models? And especially as you move into ADAS, it\nseems less and less likely that you would have a multisource agreement. So how do you guys suggest we\nreconcile that?\nNakul Duggal\nSenior VP and GM of Automotive & Cloud Computing of Qualcomm Technologies, Inc.\nI think it varies quite a bit. I think it varies by OEM. It varies by region. It varies by the domain that you're\nreferring to. For example, we see less and less multi-sourcing across telematics and infotainment. In\nADAS, we see multiple generations of programs coexist because those programs run long, sometimes they\nget delayed. The next-generation program that needs more functionality will probably overlap significantly\nwith the previous generation program. There are aspects of the car architecture that come into play.\nFor example, electrification has a massive impact on the architecture, the EV architecture of the vehicle.\nThat has a very specific set of suppliers that have been selected. So there isn't really a single SoC supplier\nto a single domain, especially for the mid- to large-sized OEMs. The smaller OEMs, it's pretty much one or\nthe other. But -- and then as you start to look at China, where the pace at which the market is moving is\nmuch faster, you absolutely have overlapping programs all the time.\nRoss Clark Seymore\nDeutsche Bank AG, Research Division\nSo to try to put some rough numbers around it and your willingness to give these, if you guys don't give\nthem, then fine, you can just say that. But as investors think about the content per vehicle and how that\nchanges over time, not necessarily today to tomorrow, you could put it in multiples. But as you go from\nconnectivity to cockpit to ADAS, how should we think about what sort of multiplier effect that could entail?\nNakul Duggal\nSenior VP and GM of Automotive & Cloud Computing of Qualcomm Technologies, Inc.\nSo I think yes, we have not really broken this down in terms of the actual ASPs. But I think connectivity\nis very predictable in terms of what are the types of ASPs, right? They're mostly they're mostly double\ndigits. I think with infotainment and ADAS, that's where I think there is a significant amount of premium\nthat is available, mostly because we are driving a tremendous amount of integration value. So we are\nmassively integrating new functionality, coexistence. And we are reducing the overall system BOM for\nthe automakers. So that's where we are able to extract the premium. But we haven't really provided any\nQUALCOMM INCORPORATED COMPANY CONFERENCE PRESENTATION  AUG 28, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n10\nspecifics on the ASPs themselves. I mean it's a range. It's a broad range depending upon which tier you're\nreferring..\nRoss Clark Seymore\nDeutsche Bank AG, Research Division\nRight. But I think would it be safe to say the content per vehicle rises as you move along that range\ntowards the ADAS side?\nNakul Duggal\nSenior VP and GM of Automotive & Cloud Computing of Qualcomm Technologies, Inc.\nAbsolutely, absolutely.\nRoss Clark Seymore\nDeutsche Bank AG, Research Division\nWhat -- and does the profitability scale directionally with -- you definitely don't break out what the\nprofitability is gross or operating margin for your segment. I'm not asking that. But does it scale upward\nas you follow that same trend as the ASPs or content? Or is it more based on revenue scale?\nNakul Duggal\nSenior VP and GM of Automotive & Cloud Computing of Qualcomm Technologies, Inc.\nYes. I mean it's very dependent upon the tier that we are talking about, which underlying chip we are\ntalking about. But yes, the profitability absolutely does scale. Yes.\nRoss Clark Seymore\nDeutsche Bank AG, Research Division\nSo last question on auto because we do want to get over to the industrial side of things. You're doing\nalmost $4 billion a year in revenue now. Your target is to get to $9 billion, like I said, in 5-ish years or so,\n5, 6 years from now. What are the biggest steps for us to monitor externally that are necessary to get\nfrom the $4 billion to the $9 billion.\nNakul Duggal\nSenior VP and GM of Automotive & Cloud Computing of Qualcomm Technologies, Inc.\nI think the biggest one is execution to the pipeline that we have shared. And so we have internally a way\nto track the rate at which the programs that we have won, how well are they executing. So that, I think, is\na very clear leading indicator in terms of the rate at which the quarterly revenues are building up. I think\nthe other is the win rate. Are we continuing to add to the pipeline? How quickly does it replenish? There\nis a lot of macro out there just in terms of tariffs, the sales of OEMs, China competition, what does that\nstart to go look like, especially in Europe, especially rest of world. But I think the size of the market is also\ngrowing, right?\nThe silicon content in cars is growing. Every car is contributing to an expanding SAM. So I feel like, of\ncourse, there will be competition and there will be complexity. But I think cars by the end of this decade\nare all going to become fairly advanced products pretty much all over. And so that, I think, certainly plays\nvery well to the strategy that we have. And as far as the road map goes and the investments that we are\nmaking, those are all made very well in advance. So most of the products that we have to go build are\nalready designed or in design right now, and we are only doing this because customers have made a clear\ncase as to what they're looking for in the next generation. So we feel pretty good about.\nRoss Clark Seymore\nDeutsche Bank AG, Research Division\nGood. Well, it's going well so far, indeed. So congratulations on that. Thank you. So why don't we pivot\nover to the industrial side of things. Now this is going to be a subset that you -- a subset of your IoT\nbusiness that you don't break out, but I believe it's somewhere around $1 billion that you're responsible\nfor of the roughly $6 billion, $6.5 billion of IoT. Is that -- it's a bit round numbers we're in the ZIP code.\nQUALCOMM INCORPORATED COMPANY CONFERENCE PRESENTATION  AUG 28, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n11\nNakul Duggal\nSenior VP and GM of Automotive & Cloud Computing of Qualcomm Technologies, Inc.\nIt's a bit north of that.\nRoss Clark Seymore\nDeutsche Bank AG, Research Division\nA bit north of that?\nNakul Duggal\nSenior VP and GM of Automotive & Cloud Computing of Qualcomm Technologies, Inc.\nYes.\nRoss Clark Seymore\nDeutsche Bank AG, Research Division\nGood. better than south. So talk a little bit about the strategy that Qualcomm has applied to this market\nand how it might differ from what you did in automotive.\nNakul Duggal\nSenior VP and GM of Automotive & Cloud Computing of Qualcomm Technologies, Inc.\nYes. So -- so this is something that I've been managing for the last 18 months or so. And a couple\nof things ran through about this market that were maybe a little bit different from what we saw in\nautomotive. I think one was there is a massive interest and need for Qualcomm technology to be adopted\nacross these very wide industrial segments, but we needed to package our products a whole lot better.\nThey needed to be made much more relevant to the specific industries because there was not a lot of\nfamiliarity with Qualcomm in a lot of these spaces. They had to be made easier to use. We had to have\nthe right channels in place, the right infrastructure in place. So that has now started to happen. And\nwe've broken this down across 5 major product segments. We have an industrial connectivity product\nsegment similar to what we have in auto, which is doing quite well. We have a camera segment that\nwe are doubling down. So we have taken the camera space, called that out separately and focused on\ncameras as an area where we will see a tremendous amount of AI capability getting built out.\nSo that, I think, is actually growing very well. We have what we call our consumer and commercial\nprocessor business, which is really a very broad market from retail, enterprise, home and life, appliances,\nand that is growing very quickly. We have an industrial processor business, which is focused on all of these\nindustrial applications, which we leverage a lot of automotive IP and products from. And then we have a\nnew robotics and drones business. So we have organized the product segments to be very horizontal and\nvery focused on a large number of verticals that can take that capability.\nWe have revamped our go-to-market team. So there's a lot of familiarity in terms of which verticals need\nwhat specific type of product. And then we are building solutions. So we are not just stopping it. So think\nof it similar to maybe not a great comparison, but like we felt the need to go build a stack because this\nwas something that was going to have mass adoption. Similarly, we feel like in the camera space, there\nare going to be a number of solutions that will be needed because AI is just going to become the way that\nyou engage with the camera.\nSo we are building out solutions across a wide variety of segments because we feel like as you get to\nthe solution level, you're just going to be much more relevant to the end customer. We've also taken an\napproach to be very developer-focused, which is not something that it was a muscle that we didn't really\n-- we didn't have a need to really develop that in the past. But in this space, because there's just such a\nlarge number of people that are not developing with AI, having the ability to be able to be accessible to an\necosystem that as a B2B company, we had never really focused on.\nQUALCOMM INCORPORATED COMPANY CONFERENCE PRESENTATION  AUG 28, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n12\nSo you'll hear more about this in the coming months about what we are doing there, but that's become a\nvery urgent and important focus. So as you push in all these different bookends of the problem statement,\nI think overall, we just become relevant to a lot of players that we previously were not.\nRoss Clark Seymore\nDeutsche Bank AG, Research Division\nSo at the highest of levels in the 2, 3 minutes we have left, the differentiation Qualcomm offers entering\nthis space. And I know it's probably different in each of those verticals that you'd mentioned, but if there's\na common thread, please summarize.\nNakul Duggal\nSenior VP and GM of Automotive & Cloud Computing of Qualcomm Technologies, Inc.\nI think our scale, right? I think there are not many companies like us who exist in the industrial space.\nThere are not many companies that are coming to meet customers where they're at in terms of trying to\nunderstand their end-to-end problems. Like, for example, we built a partnership with Aramco a year ago.\nWe have 2 dozen projects that are going on. Just with that one customer, we have set up a team in Riyadh\nand in Iran to go support those customers. So our ability to be able to engage with the customer and get\nto a solution, given the scale at which our technology operates, our products operate, that is something\nthat comes pretty naturally to us once we kind of provide focus to the problem statement.\nI don't think there is really any other company that does everything from Bluetooth shelf labels to edge\nappliances to drones and robots and industrial processors, industrial PC chips. It's a massive portfolio\nin terms of what we have. So I feel very good about the projections that we have made in terms of the\ngrowth in the industrial and embedded IoT.\nRoss Clark Seymore\nDeutsche Bank AG, Research Division\nIs the go-to-market direct or more distribution heavy?\nNakul Duggal\nSenior VP and GM of Automotive & Cloud Computing of Qualcomm Technologies, Inc.\nIt's a mix depending upon the complexity of the product. Products that are more complex require a direct\ntouch. We are also, as I mentioned earlier, very developer focused. So we are building out some more\ncapability that allows us to make certain products simpler and easier to use, and that will make those\nproducts very distribution friendly. And then there are certain products that we do sell for distribution.\nRoss Clark Seymore\nDeutsche Bank AG, Research Division\nTalk a little bit about the -- I believe you're north of $1 billion in revenue, as you said. I believe in fiscal\n'29, Akash said you had a $4 billion target for the revenues, much like I asked on automotive in the last\nminute we have left, Talk about what it takes to get from where you are today to kind of quadrupling-ish\nor tripling depending upon where you are.\nNakul Duggal\nSenior VP and GM of Automotive & Cloud Computing of Qualcomm Technologies, Inc.\nI think it's pretty straightforward. I think there are 2 types of customer profiles. I think one is the ones\nthat we are very familiar with who are now consuming a much broader portfolio that was exposed to them\npreviously. And that, I think we are seeing tremendous growth there, cameras, industrial processors,\nconsumer processors, et cetera. The other is customers that are less familiar with us and where we have\nto change the profile of the product for it to be much more easily available and accessible to them. But the\nsize of the market is very large.\nThis is not a small market and the number of products that we are putting into the portfolio are also very\nlarge. By the way, the other part that is interesting is we are not building a lot of new products for this\nQUALCOMM INCORPORATED COMPANY CONFERENCE PRESENTATION  AUG 28, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n13\nmarket. We may build 1 or 2 products for what is a very large portfolio. So what that should tell your\naudience is we have a lot of capability in-house that we can leverage and reuse. So that obviously also\nhelps us significantly in terms of the expense that we have to take on to enter these markets. And we are\ndirecting that expense towards software, towards expanding the channel towards building out solutions.\nRoss Clark Seymore\nDeutsche Bank AG, Research Division\nWell, Nakul, we're actually out of time already, but congratulations on the diversification that you've done.\nAutomotive has been especially impressive, and we can all see that, but I know the industrial side has\ndone quite well underneath the surface as well. So thank you for joining us.\nNakul Duggal\nSenior VP and GM of Automotive & Cloud Computing of Qualcomm Technologies, Inc.\nThank you very much.\nQUALCOMM INCORPORATED COMPANY CONFERENCE PRESENTATION  AUG 28, 2025\nCopyright © 2025 S&P Global Market Intelligence, a division of S&P Global Inc. All Rights reserved.\nspglobal.com/marketintelligence\n14\nCopyright © 2025 by S&P Global Market Intelligence, a division of S&P Global Inc. All rights reserved.\nThese materials have been prepared solely for information purposes based upon information generally available to the public\nand from sources believed to be reliable. No content (including index data, ratings, credit-related analyses and data, research,\nmodel, software or other application or output therefrom) or any part thereof (Content) may be modified, reverse engineered,\nreproduced or distributed in any form by any means, or stored in a database or retrieval system, without the prior written permission\nof S&P Global Market Intelligence or its affiliates (collectively, S&P Global). The Content shall not be used for any unlawful or\nunauthorized purposes. S&P Global and any third-party providers, (collectively S&P Global Parties) do not guarantee the accuracy,\ncompleteness, timeliness or availability of the Content. S&P Global Parties are not responsible for any errors or omissions, regardless\nof the cause, for the results obtained from the use of the Content. THE CONTENT IS PROVIDED ON \"AS IS\" BASIS. S&P GLOBAL\nPARTIES DISCLAIM ANY AND ALL EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF\nMERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE OR USE, FREEDOM FROM BUGS, SOFTWARE ERRORS OR DEFECTS,\nTHAT THE CONTENT'S FUNCTIONING WILL BE UNINTERRUPTED OR THAT THE CONTENT WILL OPERATE WITH ANY SOFTWARE\nOR HARDWARE CONFIGURATION. In no event shall S&P Global Parties be liable to any party for any direct, indirect, incidental,\nexemplary, compensatory, punitive, special or consequential damages, costs, expenses, legal fees, or losses (including, without\nlimitation, lost income or lost profits and opportunity costs or losses caused by negligence) in connection with any use of the Content\neven if advised of the possibility of such damages. S&P Global Market Intelligence's opinions, quotes and credit-related and other\nanalyses are statements of opinion as of the date they are expressed and not statements of fact or recommendations to purchase,\nhold, or sell any securities or to make any investment decisions, and do not address the suitability of any security. S&P Global Market\nIntelligence may provide index data. Direct investment in an index is not possible. Exposure to an asset class represented by an\nindex is available through investable instruments based on that index. S&P Global Market Intelligence assumes no obligation to\nupdate the Content following publication in any form or format. The Content should not be relied on and is not a substitute for the\nskill, judgment and experience of the user, its management, employees, advisors and/or clients when making investment and other\nbusiness decisions. S&P Global Market Intelligence does not act as a fiduciary or an investment advisor except where registered\nas such. S&P Global keeps certain activities of its divisions separate from each other in order to preserve the independence and\nobjectivity of their respective activities. As a result, certain divisions of S&P Global may have information that is not available to\nother S&P Global divisions. S&P Global has established policies and procedures to maintain the confidentiality of certain nonpublic\ninformation received in connection with each analytical process.\nS&P Global may receive compensation for its ratings and certain analyses, normally from issuers or underwriters of securities or from\nobligors. S&P Global reserves the right to disseminate its opinions and analyses. S&P Global's public ratings and analyses are made\navailable on its Web sites, www.standardandpoors.com (free of charge), and www.ratingsdirect.com and www.globalcreditportal.com\n(subscription), and may be distributed through other means, including via S&P Global publications and third-party redistributors.\nAdditional information about our ratings fees is available at www.standardandpoors.com/usratingsfees.\n© 2025 S&P Global Market Intelligence."}, "content_hash": "596c427b2946dd2d1e2b24b0783f7d2dc98dc45e16f07545f956f1de10df573d", "transcript_name": "QualcommConference.json"}